-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Dec 23, 2021 at 06:58 AM
-- Server version: 10.4.14-MariaDB
-- PHP Version: 7.4.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `kutuphanah`
--

-- --------------------------------------------------------

--
-- Table structure for table `abouts`
--

CREATE TABLE `abouts` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `answers`
--

CREATE TABLE `answers` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `courseId` bigint(20) UNSIGNED NOT NULL,
  `questionId` bigint(20) UNSIGNED NOT NULL,
  `instructorId` int(11) NOT NULL,
  `studentId` int(11) NOT NULL,
  `answer` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `mark` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `banks`
--

CREATE TABLE `banks` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `userId` bigint(20) UNSIGNED NOT NULL,
  `iban` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `persone_name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `countryId` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `cityId` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `bank_name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `acount_number` int(11) DEFAULT NULL,
  `bank_sub_name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `swift_code` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `banks`
--

INSERT INTO `banks` (`id`, `userId`, `iban`, `persone_name`, `countryId`, `cityId`, `bank_name`, `acount_number`, `bank_sub_name`, `swift_code`, `created_at`, `updated_at`) VALUES
(12, 13, 'beb12345667777', 'hamadaaaooo', 'cairoooo', 'cairoooo', 'cairoooo', 367658698, 'naserrroo', '111234567777', '2021-08-12 12:13:30', '2021-08-15 05:51:38'),
(13, 14, 'erferv', 'veferfrevvv', '15', 'eqfqervv', 'erfeqrrfvv', 0, 'erfeqrv', 'ferfrefrev', '2021-08-12 12:40:58', '2021-09-15 03:35:33'),
(28, 47, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2021-09-03 21:34:19', '2021-09-03 21:34:19'),
(30, 50, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2021-09-05 11:23:25', '2021-09-05 11:23:25'),
(31, 48, '123456789', 'husni', '28', NULL, 'iiab', 654321, 'irbdh', NULL, '2021-09-05 11:23:25', '2021-09-11 09:17:43'),
(32, 51, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2021-09-10 20:36:57', '2021-09-10 20:36:57'),
(33, 53, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2021-09-15 15:10:13', '2021-09-15 15:10:13');

-- --------------------------------------------------------

--
-- Table structure for table `books`
--

CREATE TABLE `books` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `userId` int(11) DEFAULT NULL,
  `categoryId` int(11) DEFAULT NULL,
  `subCategoryId` int(11) DEFAULT NULL,
  `languageId` int(11) DEFAULT NULL,
  `countryId` int(11) NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `price` double(8,2) DEFAULT NULL,
  `date` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `pages` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `licensing_authority` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `isbn_num` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `license_number` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `license_year` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `description` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `photo` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `file` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `status` int(11) NOT NULL DEFAULT 0,
  `meta_key` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `slug` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `books`
--

INSERT INTO `books` (`id`, `userId`, `categoryId`, `subCategoryId`, `languageId`, `countryId`, `name`, `price`, `date`, `pages`, `licensing_authority`, `isbn_num`, `license_number`, `license_year`, `description`, `photo`, `file`, `status`, `meta_key`, `slug`, `created_at`, `updated_at`) VALUES
(3, 16, 2, 2, 2, 1, 'أمية الشفتين وقبلة الغقرب', 9.00, '2021-07-08', '5', '354', 'gef', '54', '2001', 'هي الرواية التي لاقت إقبالا هائلا في الجزائر وشمال إفريقيا ومصر .. تتحدث عن قصة عشق درامية ممزوجة في قالب تشويقي مميز حاكه المؤلف ببراعة .. تحدثت الرواية عن جميع طبقات الشعب ومعاناتهم وأفكارهم وآمالهم .. لا تكاد تنجو القصة حتى تكبكب ثانية في بحور الهجر والعذاب .. جوهر القصة يدور حول مصيبة العاشق إن كان الخجل يلف عشقه .. فنرى العاشق ومعشوقته أذاب الهوى قلوبهما وإستغل الأقراب ضعفهما وزادا مشاكلهما وفراقهما زعذابهما .. ولكن مافتئ القلب أن لاح من بحر الهزيمة إلى يم الفوز بالأحضان والعشق الفنان ولكن هيهات هيهات فعلا .. فكما قيل مهمتك فعلا في هذه الدنيا هي الفوز بقلب وفي مطيع وقد تستغرق مدة حياتك في البحث المضني .. فكذلك بطلنا إيهاب الطالب الجامعي الذي ما إن وقفت دقات قلبه متناغمة مع ناقوس أنثى حتى لاحت المشاكل والضنون ولعبت الدنيا ببراعة لعبتها وفتشت لهما عن كن كل أسباب القهر والهجر .. لكن لله نفحات يجمع بها قلوب المعذبين على بسيطته .. يجمعهما في أحداث عسى أن يستغلا فرصة ذلك .. سنرى في دروب الحروف كم كانت المتاهة طويلة وغريبة جدا.	', 'image-book.jpg', '1631172126.pdf', 0, 'رواية ,روايات,نبيل حميدة,رومنسية,الجزائر,حب,حقيقي,قصة,عشق,خواطر,نجاح	', 'أمية-الشفتين-وقبلة-الغقرب', NULL, NULL),
(4, 19, 2, 2, NULL, 1, 'أبتسم للحياة', 5.00, '2021-07-08', '5', '354', 'gef', '54', '2001', 'مجموعة قصصية عبارة عن قصص واقعية مر بها الكاتب	', 'image-book.jpg', '1631172126.pdf', 1, 'السعادة,الفرح,التفاؤل,التنمية البشرية,ديني,القوة	', 'أبتسم-للحياة', NULL, NULL),
(5, 19, 2, 2, 1, 1, ' ثقوب سرية في غابات الأمازون  ', 10.00, '2021-07-08', '5', '354', 'gef', '54', '2001', 'رواية خيال علمي دراما بوليسية فلسفة تصلح ان تكون فيليم سينمائي عالمي	', 'image-book.jpg', '1631172126.pdf', 0, 'الأمازون,خيال علمي,دراما,رواية خيالية,ثقوب سرية في غابات الأمازون,رواية بوليسية,رواية دراما,رواية غموض,رواية أكشن,اكشن,دراما,تنمية بشرية,رواية عن القوة ,التفكير ,رواية عن الحياة,فلسفة,رواية فلسفة	', ' ثقوب-سرية-في-غابات-الأمازون  ', NULL, NULL),
(6, 20, 1, 1, 1, 1, 'هذيان هامشي', 4.00, '2021-07-08', '5', '354', 'gef', '54', '2001', 'كنت أزور محمود على امتداد المدة التي كان يرقد خلالها في المستشفى.. كنت أزوره على فترات متباعدة، نظرا لوجود تلك المستشفى في المدينة البعيدة. ورغم ذلك فقد توطّدت علاقتنا شيئا فشيئا حتى صرت صديقا له.. كنت الوحيد الذي أزوره، فقد تلاشت كل علاقات محمود الخائبة. حتى أقاربه القليلون نسوه، كأن لم يكن في حياتهم.. ولم يكن محمود ليبالي بذلك، فهو لم يكن يوما على علاقة وطيدة بأقاربه. كان منفيّا ومنسيّا، ومنعزلا في ذلك الحي الهامشيّ الذي عاش فيه.. بعد لقائي الأوّل والوحيد بمحمود في السجن، رأيته مرة ثانية يوم وفاة والدته. إذ أراد مدير السجن أن يرحمه، تعاطفا مع حالته الصحية، فأخذ على عاتقه مسؤولية حضور ذلك السجين محمود جنازة أمه. سامحا له بأن يودعها الوداع الأخير، ويلقي عليها نظرة واحدة أخيرة.. في تلك المرّة التي رأيت فيها محمودا، لم يكن بتلك الحدّة، ولا القوة النسبيّة التي كان عليها في السجن.. كان منكسرا ومنهزما كعجوز وحيد. وتذكرت تلك المقولة، وأنا المراقب الموضوعيّ للأحداث، \"ما يزال الإنسان شابّا فإذا ماتت أمه، شاخ فجأة.\" أمّا في المستشفى فقد بات محمودا أكثر كآبة وحكمة.. التقيته أوّل مرة في العاشر من مارس لسنة تسع وتسعين، وهو يرقد للعلاج.. التقيته خمس مرات في ما أذكر، وكنت في كلّ مرة أحتاج إلى دليل يقودني نحوه، داخل دهاليز تلك المستشفى المخيفة.. كان محمود يرقد وحيدا في غرفة ضيّقة، وكأنّه حالة خاصّة من البشر. وكان على امتداد زياراتي له يطيل الصمت والشرود.. كان مكتئبا فعلا، وكان يخضع لإشراف طبي مشترك بين أطباء الجسد وأطباء النفس.. كنت أحادث محمودا كصديق، مستبعدا من رأسي وأقوالي أيّ شيء قد يعكّر مزاجه.. استبعدت من أقوالي حديثي عن عجزه، وعن مريم، وعن أمّه، وعن أبيه، وعن حياته، كأني لا أعرف هذه الأمور.. ورغم ذلك فقد كان محمود، ينزعج من مجرّد حضوري!! كان يريد أن يمكث وحيدا، وأن يترك لشأنه، كشجرة نفضت أوراقها في الخريف.. وفي لقائي الثالث به، يوم الثاني عشر من أبريل، خطر لمحمود أن يتحدث في تلك الأمور التي كنت أتحاشى الخوض فيها، وقد رأيته يتحسّن إلى الأفضل من ناحية نفسيّة على الأقلّ.. قال محمود:\" أتدري حضرة المحامي ما يكون هذا اليوم؟\" قلت:\" ما يكون يا محمود؟\" قال وقد عمّه السلام والسكون والحكمة، كأنّه يأتي من عالم آخر:\" إنّه يوم الذكرى الثالثة لوفاة مريم، تلك المرأة التي كانت تواسيني بصبر، فقد كانت صبورة وحكيمة. وماتت كما يلفظ البحر صَدَفَة.. كما يدوس الرجل خنفساء، صُدفة..\" قلت كمن يستغلّ فرصة:\" أكنت تحبّها يا محمود؟\" ردّ دون أن يفاجئه السؤال:\" لست أدري.. ربّما لم تكن هناك فرصة للحبّ.. لكنّي كنت أحترمها..\" قلت كمن يطلق الرصاص:\" لماذا إذن قتلتها بوحشيّة؟\" ردّ منقلبا إلى غضب خفيف، سرعان ما تداركه بالعودة إلى سكونه:\" كلا، لم أقتلها.. أعني أني قتلتها، وذاك ما كان من قدرها..\" قلت كمن يواصل إطلاق الرصاص، وقد حاصر مجرما:\" لقد قلت إنّك لم تقتلها..\" - قتلتها.. - وفي التحقيق قلت إنك تكرهها، والآن تقول أحترمها.. ألن تصارحني وتريحني يا محمود.. - أنت تعرف أني مجنون الآن.. لا تثق بكلام مجنون. ذاكرتي يصيبها التلف.. ثق بأقوالي السابقة، وكفى.. - لماذا كانت الطعنة مرتعشة؟ كيف أقنعت المحقق أنّ مريم انتحرت في التحقيق الأول، وأنت تعرف ماذا يعني التحقيق البوليسي في بلادنا.. لا أحد تقريبا ينجو من قول الحقيقة في حضرة التحقيقات. كيف نجوت أنت إن لم تكن صادقا؟! ثم عدت واعترفت بالجريمة؟ لماذا لا تريحني يا محمود، وتحلّ اللغز.. كان محمود يسمعني بشرود، وبينما كان يغيب مع كآبته، أضفت مطلقا رصاصتي الأخيرة القاتلة:\" هل لذلك علاقة بعجزك الجنسي؟\" انقلب محمود فجأة ناظرا إليّ بحنق وتساؤل، نظرات حادة مخيفة. غير أني واصلت متحدّيا دون رحمة:\" لقد زرت طبيبك وعرفت كل شيء..\" لم يستطع محمود التحمّل، وهجم عليه الألم الجسدي يعصره عصرا، وصاح محمود صيحاته البائسة بفزع، فهرع إليه الطبيب والممرّضات يسعفونه. وقال الطبيب:\" ماذا قلت له حتى يحصل معه هذا؟ يجب أن تغادرنا يا سيدي.\" فغادرت وتركت محمود للرحمة والقدر.. في زيارتي الأخيرة له، كان محمود أكثر سلاما ودعة.. لم ينزعج من زيارتي على عكس ما توقعته، بل صافحني مبتسما، رغم مسحة الحزن التي كان عليها. وسأل عن أحوالي وهو يُجري الكلام على لسانه بصعوبة. مستأنسا بكلامي معه، إذ كنت أحدّثه حديثا مشجّعا.. ثم قلت:\" هل تعرف ماذا أهدتني العجوز أمك؟\" التفت إليّ بفضول خفيف، فأضفت:\" لقد أهدتني خواطرك.. خواطرك الرائعة يا محمود.\" ابتسم وقال:\" لا أذكر.\" قلت:\" ألم تعد تؤمن بالكتابة؟\" قال:\" لم أعد أؤمن بشيء، رغم أني لم أؤمن بشيء في حياتي مثلما آمنت بالكتابة، حتى أني شاركت مرة في مسابقة أدبيّة..\" قلت بفضول غريب:\" وماذا حصل معك؟\" ردّ بسخرية:\" حصلت على تنويه يقول؛ نشكر لكم مشاركتكم الرائعة، لكن المسابقة مخصصة للروايات، وما تقدّمونه لا يصنف ضمن فن الرواية..\" قلت مشجّعا:\" نعم يا محمود ما تكتبه جميل، ربما نشرت خواطرك يوما..\" رد باستعلاء، ممزوج بحزن عميق:\" ترهات، قد توقعك في المشاكل.\" قلت مغيّرا الموضوع:\" فمن تكون فدوى يا محمود؟ تلك التي تذكرها في خواطرك..\" سكت شاردا لحظة، ثم بكى بصمت كمن تحرقه ذكرى، وترقرقت دموع كان يكبتها، رغما عنه، محيلة إياه على غصة في الحلق وانكسار.. ثم انفتح على كلام صاف كأنه يلقي إلى الحياة سرّه كحكيم، قبل رحيله قائلا:\" سرّ الحياة والعذابات.. وهم البدايات.. ألق الأمنيات فدوى هي حبيبتي.. لكن سامح الله والدي..\" قلت:\" لماذا لم يجمع الحب بينكما؟\" شرد للحظة قصيرة، ثم رأيته يغيب في فراشه، ويُصَرُّ كقط حزين.. فهمت أنّه يتعين عليّ المغادرة، فغادرت وفي النفس شيء لا أفهمه من الحسرة واللوعة.. كان ذلك في الثلاثين من أبريل، وقد عزمت أن لا أعود لزيارة محمود، فودّعته بنظرات متأسّفة ورحيمة مشفقة، فيما كنت أغادره بخيبة وأسف.. كان شعورا مرّا بالخيبة والحزن لا أفهمه، كنت أغيب عائدا إلى بلدتي وهائما في شوارعها، ملتحما بحزنها وسكونها الأبدي. فيما كان ذلك الكلب الذي تركته على حافة الرصيف يموت.. يموت ويتحلّل مثيرا القرف بنتونة رائحته في الأنوف، دون أن يثير ضجر أحد أو انزعاجه. وكانت الخيبة تستوطن النفوس كعشّ الغراب، وكانت المدينة تنام، تنام كجثة ملقاة في صحراء، لا تثير انتباه أو حيرة أحد..	', 'image-book.jpg', '1631172126.pdf', 0, 'جريمة, تحقيق, وجود, رحلة, حياة, مأساة, قضية, حب, جنون, شعر	', 'هذيان-هامشي', NULL, NULL),
(7, 22, 1, 1, 1, 1, 'حد الموس (حبيبتي)', 8.00, '2007', '5', '354', 'gef', '54', '2001', 'حيث عمره الماضى والحاضر وتلك الام والحبية والاخت كل شي في حياته.هذا الحب الخاص الحب الذى كان الكل يضرب به المثل هي من كانت وراء نجاحه وهي ايضا وراء شقائهُ وعذابهُ هي كل حياته هي من ضاع من اجلها كل شي وماو صل اليه الان حب ليس عادى رغم فرق السن الذى كان بينهم وهي امه واخته هذا الحب رغم عمره الصغير حين ذلك وحتي اليوم وهو يحلم بها رغم ذلك الفراق الذي لم يكن بينهم ابداً طول حياته منذ ان عارفها وهذة الحياة التي كانت يعشواهُا مع بعضهم البعض وتلك العيشة وذلك الذي كان بينهم وكأنهم في أي بلد اروبي او امريكا وهم في منزل واحد تحت سقف واحد ورغم انهم ليسوا اقراباء او حتى جيران وهنا هو(حداالموس) الذى هو العرف والتقاليد والعادات التى نعيش فيها هنا وان كان (حد الموس) شئ صعب السير عليه لكن هنا هو الطبيعى ويطبق في كل شي مع اختلاف الحياة الان الا ان كل شي كان لهم فى النور وامام الجميع ومصدر فخر لهم وذلك الحب الذي كان كأنه بين اخت كبيرة وهي ترع اخها الصغير وهو يحارب من اجلها ومن اجل مستقبلها وحياتها حب كيف ينساهُا ابدا وهو يعيش من اجله واجلها وتلك الاحداث التي قلابة الدنيا راسا علي عقب معه والهروب في تلك الاعمال والبعد عن الناس والخوف عليها ايضا وهي السبب الرئيسي في كل ذلك هذه الذكرة الجملية الشعاع الذي ينور حياته. نعم حباً كان كما لوكان حب الام والاخت حباً وهي لتجوز له ورغم انها لم تكن الام والاخت اوحتي أي صلة القرابة انما هي الحب الاواحد ولغيرها في قلبه ولن يكون هناك في قلبه الاهي حتى اخر العمر.ورغم الندم انها كانت الفرصة الكثيرة له ان تكون هي زوجته وامراته في كل وقت بعد ما اصبح له شأن وكيان كما كان يحلم وهي ايضا ان تحب ان تراهُ علي ذلك الامر وهو ذو مناصب وكيان علمي وقيادي وهو معها كل وقت حيث عمره الماضى والحاضر وتلك الام والحبية والاخت كل شي في حياته.هذا الحب الخاص الحب الذى كان الكل يضرب به المثل هي من كانت وراء نجاحه وهي ايضا وراء شقائهُ وعذابهُ هي كل حياته هي من ضاع من اجلها كل شي وماو صل اليه الان حب ليس عادى رغم فرق السن الذى كان بينهم وهي امه واخته هذا الحب رغم عمره الصغير حين ذلك وحتي اليوم وهو يحلم بها رغم ذلك الفراق الذي لم يكن بينهم ابداً طول حياته منذ ان عارفها وهذة الحياة التي كانت يعشواهُا مع بعضهم البعض وتلك العيشة وذلك الذي كان بينهم وكأنهم في أي بلد اروبي او امريكا وهم في منزل واحد تحت سقف واحد ورغم انهم ليسوا اقراباء او حتى جيران وهنا هو(حداالموس) الذى هو العرف والتقاليد والعادات التى نعيش فيها هنا وان كان (حد الموس) شئ صعب السير عليه لكن هنا هو الطبيعى ويطبق في كل شي مع اختلاف الحياة الان الا ان كل شي كان لهم فى النور وامام الجميع ومصدر فخر لهم وذلك الحب الذي كان كأنه بين اخت كبيرة وهي ترع اخها الصغير وهو يحارب من اجلها ومن اجل مستقبلها وحياتها حب كيف ينساهُا ابدا وهو يعيش من اجله واجلها وتلك الاحداث التي قلابة الدنيا راسا علي عقب معه والهروب في تلك الاعمال والبعد عن الناس والخوف عليها ايضا وهي السبب الرئيسي في كل ذلك هذه الذكرة الجملية الشعاع الذي ينور حياته. نعم حباً كان كما لوكان حب الام والاخت حباً وهي لتجوز له ورغم انها لم تكن الام والاخت اوحتي أي صلة القرابة انما هي الحب الاواحد ولغيرها في قلبه ولن يكون هناك في قلبه الاهي حتى اخر العمر.ورغم الندم انها كانت الفرصة الكثيرة له ان تكون هي زوجته وامراته في كل وقت بعد ما اصبح له شأن وكيان كما كان يحلم وهي ايضا ان تحب ان تراهُ علي ذلك الامر وهو ذو مناصب وكيان علمي وقيادي وهو معها كل وقت	', 'image-book.jpg', '1631172126.pdf', 0, ',الى,كل,من,يظن,ان,الحنان,هو,المراة,فقط,نقول,له,لا,تعال,لاتنظر,الى,حب,وقلب,الرجال,وكل,عطاء,منهم,تعال,لترى,الحب,الصادق,والترابط,والوحدة,الوطنية,فى,بلادنا,	', 'حد-الموس (حبيبتي)-', NULL, NULL),
(8, 22, 1, 1, 1, 1, 'هي(الخيانة)', 5.00, '2007', '5', '354', 'gef', '54', '2018', 'وهو ماكان سبب النحاح والانتشار والجذاب لما كان فيها من عقب والكل يلهث وراء متابعتها وشرائها ايضا ومنهم هؤلاء من كان فعلا مكوى بتلك النار وهو يعيش مع الرضاء بالامر بارداته او بغير ارداته ومع مسكنات مايقدم علماء النفس والاجتماع والباحثين فى تلك الامور من التسامح فى ذلك الشئ وهو الخيانة وقدرة الرجال على التسامح اكثر ولاقانون ردع فى تلك الامور والتعجيز لمن لاتسطيع يده ان يقدم على اى خطوة فى الانتقام حتى من به القوة وايضا السلطة وهو عاجز لامور تختلف لكل شخصية منهم سواء اكان قوىاً او ضعيف وايضا حتى من تمكن من فعل شئ وهو سواء انتقام من زوجته تلك الخائنة اما بالانفصال وبداء من جديد وتغيرت حياته او من قتل وضاع مستقبله امام كل القوانىن بالعالم التى لايهم فيه غير جريمة القتل وليس عذر الخيانة حتى فى مصر هنا او غيره من اى انتقام وتزايد تلك الامور فى النساء حين تعلم انه لايكون هناك اى عقب لها من قوى غير انه الاقرب هو سيكون السماح فى اخر الامر ولاقوة ولاعقاب لهم جعلت الامر يسود وبلا اى خوف وحتى ان كان موت لهم اوقتل كما يحدث احيانا اصبح لايهم طالم الاهم هو المتعة فى المغامرة وراء اللهث فى طريق الحرام وايضا نهاية الزوج بشتا الطروق لحياته من عقب اوالالم فى تلذ للمراة حتى ان انتهت حياتها باى شكل وانتقامها ايضا فى ذلك. وليس هذا ضرب من الخيال او تعنت ضد المراة ولكن بالفعل هو نتج تلك الابحاث الاجتماعية فى ذلك الشأن وما قدم ويقدم من كل علماء الاجتماع والطب النفسئ وليس كل ثغرات الحياة الزوجية واسباب الخيانة هو الرجل وحده وما يفعل الرجال من كل سبب لان تخون زوجته بالفعل مما وراد فى تلك القصة والان فى تلك الاحداث هو اثبات ان المراة ايضا على طول الحياة ومنذ بداء الخالق وهى تاتى باشياء اقوى واخطر بكثير كما ثبت التاريخ ذلك وكل دور فى الشر وايضا فى الخير واكثر وهى تكون سبب السعادة والحسنة التى فى الدنيا او الجحيم حتى ان لم ترتكب مثل ذلك الشئ الشنيع.والاهم ان هناك العقاب الربنى الذى هو كل وقت سوء فى الدنيا او الاخرة	', 'image-book.jpg', '1631172126.pdf', 0, ',ان,كان,الرجل,هو,صانع,الة,الدمار,فأن,المرأة,هى,الدمار,نفسه,بكل,ماتفعل,من,حب,وكراهية,وظلم,وهى,بداية,لكل,شر,بعد,ان,كانت,هى,سبب,الطرد,من,الجنة,ولكل,امراة,تخون,وتظن,انها,لانهاية,لها,	', 'هي-(الخيانة)', NULL, NULL),
(9, 23, 2, 2, 1, 1, 'الملخص في النحو والصرف', 6.00, '2021-07-08', '5', '354', 'gef', '54', '2020', 'الملخص في النحو والصرف، كتاب يشمل النحو والصرف للمراحل التعليمية المختلفة، بطريقة التفريعات والتشجيرات، وهي طريقة سهلة وواضحة، نالت إعجاب الطلاب والمعلمين وأساتذة الجامعات، الكتاب إعداد الأستاذ مجدي حجاج، أستاذ اللغة العربية والخط العربي، ومدقق لغوي، وشاعر فصحى. الكتاب تقديم الأستاذ الدكتور أنور السنوسي، أستاذ ورئيس قسم اللغة العربية الأسبق بكلية التربية جامعة دمنهور. صفحة الكتاب على فيسبوك باسم الكتاب، تجاوزت خمسة وأربعين ألف متابع قد نال الكتاب إعجابهم، الكتاب حقق أعلى نسبة مبيعات في دار كتبنا للنشر لمدة خمسة أشهر متتالية، ونظرا لطريقته السهلة في تناول النحو والصرف يحرص كثير من أهل اللغة العربية والطلاب والمعلمين أن يقتنوا الكتاب، في مصر وخارجها. وكان الباعث لي على تأليف هذا الكتاب هو أن كثير من الطلاب ينظرون إلى النحو على أنه طلاسم لا يمكن فهمها، ويبتعدون عن دراسة النحو والصرف بسبب الفهم الخاطيء الذي سيطر على عقولهم، وقد يكون هذا بسبب تقصير من بعض المعلمين في توصيل النحو للطلاب بطريقة ميسرة، او قصور في الكتب الدراسية، التي لا تمكن الطلاب من فهم دروس النحو، كما أن هناك كثير من الطلاب لا يكلف نفسه عناء البحث والقراءة. لذلك قمت بكتابة هذا الكتاب بطريقة التفريعات والتشجيرات، حتى يستطيع الطالب ربط المعلومات ببعض، بطريقة سهلة، ومبتعدا عن التكرار الذي يجعل الطالب يمل من القراءة، وكذلك تناولت كل درس في صفحة. كذلك بدأت من السهل إلى الصعب، وبالتدرج من المرحلة الابتدائية ثم المرحلة الإعدادية ثم المرحلة الثانوية، فتجد في الكتاب المناهج الدراسية للمراحل المختلفة، ولكن بترتيب النحو الأساسي، أي بداية من أقسام الكلام ثم الجمل ثم المرفوعات والمنصوبات والمجرورات والتوابع، ثم الصرف. وستجد في نهاية الكتاب الفهرس الذي ييسر لك الوصول للدرس الذي تبحث عنه. الكتاب صدر عن دار كتبنا للنشر في يوليو 2020، وحقق أعلى نسبة مبيعات لمدة خمسة أشهر. الكتاب ييسر لك دروس النحو ويضعها بين يديك في كتاب واحد، وفي عدد صفحات قليلة مقارنة بالكتب الأخرى، وبطريقة سهلة تجعلك محبا للنحو والصرف، ومقبلا على دراسته.	', 'image-book.jpg', '1631172126.pdf', 0, 'الملخص في النحو والصرف الملخص في النحو والصرف مجدي حجاج الملخص في النحو والصرف للمراحل التعليمية المختلفة النحو للثانوية العامة النحو للإعدادية النحو للمرحلة الابتدائية النحو الصرف النحو والصرف أ. مجدي حجاج أ. مجدي حجاج الملخص فؤ النحو مجدي حجاج النحو والصرف مجدي حجاج أقسام الكلمة الجملة الاسمية الجملة الفعلية المرفوعات المنصوبات المجرورات التوابع الصرف المشتقات المصادر	', ' ثقوب-سرية-في-غابات-الأمازون  ', NULL, NULL),
(10, 24, 2, 2, 1, 1, 'في زمن العصابة', 7.00, '2021-07-08', '5', '354', 'gef', '54', '2020', 'إن كانت المذكرات الشخصية تعنى بتوثيق يوميات أفراد وشخصيات ما فإن الجرائد هي مذكرات البلد، ولوعينا بمدى أهمية أن يكون الصحفي موضوعيا وجريئا في توثيق يوميات بلده بطريقة صريحة وصادقة تمكن الأجيال القادمة من العودة إلى تواريخ معينة وإلقاء نظرة على أحداث مضت والإطلاع برؤية واضحة على نوعية \"السياسيين\" خلال فترة ما وكذا استشعار \"أحوال البلد\" خلال نفس الفترة، لوعينا بهذا فقد ارتأينا أن نرسم ملامح \"البلد\" في مقالات رأي أو كما تسمى أعمدة على صفحات \"جريدة الأوراس نيوز\"، وإن كان ألبوم الصور جامعا لذكريات الأشخاص فقد ارتأينا أن يكون كتاب \"في زمن العصابة\" ألبوما جامعا لصور مكتوبة عن الجزائر على وجه الخصوص وبعض المقتطفات لبلدان أخرى خلال فترة زمنية معينة قررنا أن نسميها \"زمن العصابة\"، ذلك لأن كل الأحداث التي يوثقها الكتاب أو بالأحرى كل ما جاء في الكتاب هو تلخيص لما جرى خلال فترة زمنية كانت العصابة حاكمة فيها وتحاول التمدد والتغول والخلود. تجدون في الكتاب أعمدة منتقاة لما قيل في ركن \"وجب الكلام\" للصحفي حمزه لعريبي على صفحات \"جريدة الأوراس نيوز\" طيلة حوالي أربع سنوات الأخيرة قبل تاريخ الانتفاضة الشعبية ضد \"العصابة\" في الثاني والعشرين من فيفري عام ألفين وتسعة عشر، أي حوالي أربع سنوات من حكم \"العصابة\"، والتي تعتبر جريدة الأوراس نيوز بطاقم من الصحفيين الشباب إحدى ضحاياها لما عانته من تضييق وصل بها حد السقوط لولا الصمود فقط لأنها قررت ألا تكون مجرد رقم في الساحة الإعلامية، بل شاهدا \"شاف كل حاجة\" وشاهدا قال كل شيء \"في زمن العصابة\".	', 'image-book.jpg', '1631172126.pdf', 0, 'في زمن العصابة , الحراك , النظام , الجزائر , حمزه لعريبي , الأوراس نيوز	', 'في-زمن-العصابة', NULL, NULL),
(11, 26, 2, 2, 1, 1, 'مجنون الحي', 2.00, '2021-07-08', '5', '354', 'gef', '54', '2018', 'مجموعة من القصص تحمل عنوان إحدى القصص وهي قصة مجنون الحي التي تتحدث عن رجل لا يستطيع التعايش مع مجتمعه فيديو غريب من بلد إلى بلد ومن حي إلى آخر في عرض سردي قصصي لمايقابله من مفارقات، إلى جانب قصص أخرى السجينة وهي عن كاتبة رواية تتمرد عليها شخصيات روايتها و قصة روضة وهي تدور في منطقة وسط بين الموت والحياة في حوار بين شخصيات القصةفي فلسفة وجودية، قصة رؤية وهي عن منولوج داخلي بين الشخصية الاساسية وحارس صندوق في صدرها ينفتح وتخرج الذكريات وتلتقي بالأحرى التي أهملتها ، وقصة السير بمحاذاة الساحل وهي عن شاب في ليلة حفل خطبته يتذكر طفولته وحياته التي غابت في البحر الذي ينحر الشاطئ ويأكل المصيف القديم ، قصة الأريكة وقصة السترة وقصة الصخرة وقصة العرس وهي قصص اجتماعية عن حياة الرجل والمرأ،قصة خروج وقصة لقاء وقصة البعاد هي قصص اجتماعية تتركز على المرأة والرجل وجدلية الحياة ،قصة هذيان وقصة عثرة والوقوف علىالجانبالآخر في معظمها اجتماعية . قصة عشب يتألم من أهم القصص التي تصف معانت المرأة لجعل حياتها الزوجية تسير بشكل يرضيها وحقها في الزواج بعد طلاقها وكيف يقبل الأولاد برجل غير أبيهم ومحاولات المرأة في الاستقلال بعيدا عن تحكم الأسرة والألم زوجها لها لتقبل بالحياةمعه من أجل الحفاظ على الشكل الأسري والعائلي وهويعلم أنها لا ترغب في الحياة معه.	', 'image-book.jpg', '1631172126.pdf', 0, 'االمرأة , حوار , مفارقات', 'مجنون-الحي', NULL, NULL),
(12, 27, 2, 2, 1, 1, 'شفرة الملك داؤد', 3.00, '2021-07-08', '5', '354', 'gef', '54', '2018', 'الولايات المتحدة الامريكية الرابعة بعد الظهر جلست (سوزان فريزر) أمام شاشة التلفاز.. تدير القنوات التلفزيونية في لامبالاة... عندما وقع بصرها على وجه مألوف في إحدى القنوات. وعند إعادة القناة.. كانت كما توقعت – تنظر إلى (د. ماركوس بوند) استاذ (علم اللاهوت وتاريخ الكنيسة).. والواعظ في كنيستهم المحلية. بدا انيقاً في مظهره. كالعادة... كان يتحدث في هدوء وأمامه، كما يظهر على الشاشة عدد كبير من المستمعين.. ربما تكون في جامعة ما.. وكان هنالك شريط اخباري أسفل الشاشة كتب عليه د. ماركوس بوند... لمحات من تاريخ الكنيسة. رفعت سوزان الصوت قليلا، فهي منذ مدة اصبحت تهتم بآراء هذا الرجل وظهر على الشاشة جمهور من الناس يستمعون اليه في اهتمام. تمنت الا تكون المحاضرة في نهايتها وهي تستمع اليه وهو يقول: – ثم رحل المعلم وترك التلاميذ بعد أن أوصاهم أن يسيروا على خطاه – وما هي إلا بضع سنوات حتى التصق بهم (شاول) الذي سمى نفسه لاحقا بولس زاعما أنه قد صار واحدا منهم بعد أن ظهر له المسيح في رؤية نهارية. ولما جاء شاول إلى (اورشليم) حاول أن يلتصق بمجتمع التلاميذ.. وكان الجميع يخافونه غير مصدقين أنه تلميذ – فأخذه برنابا.. أحد التلاميذ وأحضره إلى الرسل... لكنه لم يلبث بعد أن توطد مركزه في مجتمع التلاميذ، أن تشاجر مع برنابا نفسه. الرجل الصالح والذي كان له الفضل في تقديمه إلى التلاميذ.. فحصلت بينهما مشاجرة حتى فارق أحدهما الآخر.. بالطبع لم يكن سبب المشاجرة اختلافا شخصيا في الامور الروتينية بين البشر – فقد كان الخلاف خلافا عقائديا فكريا خطيرا لدرجة أنهما فارقا بعضهما البعض. وكان ذلك إيذانا باختفاء اسم برنابا ووجوده في سفر أعمال الرسل. وسفر أعمال الرسل هذا.. ألفه لوقا.. ليكون امتدادا لإنجيل لوقا في حوالي سنة خمسة وستون ميلادية ويجوز تسميته سفر أعمال بولس.. ويعتقد أن مادته جُمعت في فلسطين. وكذلك اختفى من قبل اسم بطرس – الذي عينه المسيح راعيا لتلاميذ – وانقطع ذكره منذ الاصحاح الثاني عشر من سفر أعمال الرسل حيث تشاجر معه بولس أيضا. إن بولس لم يكن يعلم قدر بطرس.. ومكانته المركزية بين التلاميذ.. ولم يكن يعلم بالتفويض الذي أعطاه له المسيح... بان يحل ويربط كما يشاء... وبطرد برنابا وطرد رئيس التلاميذ، فإن الأمر قد خلا لبولس فأصبح رأس الكنيسة ومشرعها الاول.. وقد ساعده في تسهيل مهمته.. إلمامه بالثقافة الهيلنية الاغريقية التي كانت سائدة حينذاك. وترتب على قيادة بولس لحركة التبشير انحراف المسار بعيدا... بعيدا جدا عن خطها الاول. يتفق العلماء بوجه عام على أن تعاليم (بولس) تخالف تعاليم المسيح نفسه وذلك في نقاط هامة وأساسية... فعلى سبيل المثال فيما يتعلق بالناموسا. فان المسيح قال إنه لم يأت لينقض الناموس.. فمن نقض هذه الوصاية الصغرى وعلم الناس إبطالها.. يُدعى الأصغر في ملكوت السموات. لكن بولس نقض هذه الوصاية وعلم الناس إبطال الناموس... أفبهذا الا يستحق لقب الأصغر في ملكوت السموات؟ وفي ما يختص باقتران الايمان بالأعمال فان بولس جعل نوال البر وقفا على الايمان فقط في تحد لتعاليم المسيح. فقد دعا المسيح للعمل في الدنيا وبين أن الايمان وحده لا يكفي بدون عمل صالح.. (وأما الذي يسمع ولا يعمل فيشبه انسانا بني بيته على الأرض من دون اساس فغمره النهر فسقط حال)ا.. وهذا يعقوب التلميذ يقول في رسالته. ما المنفعة يا اخواتي أن يقول أحد إن له ايمانا ومكث وليس له أعمال؟ هل يقدر الايمان أن يخلصه. إنه بالأعمال يتبرر الانسان لا بالإيمان وحده. ولكن العجيب أن بولس يخالف ذلك، ويجعل نوال البر والخلاص وقفا على الايمان فقط في تحد غريب وسافر. عند الفاصل الاعلاني القصير تمنت سوزان فريزر أن يكون آدامز واطسون بجانبها فقد مر زمن طويل لم يلتقيا فيه وراحت تفكر فيه بشوق كبير.   المكسيك في بلدة ريفية سياحية تعود آدمز السير مرتجلا في هذا الطريق الريفي الصغير الذي يمر أمام مقر اقامته العتيقة. نظر إلى ساعته فوجدها الرابعة والثلث. فغمغم لن تنال مني اليوم. (فرانك). وفرانك هذا، حارس المنزل الذي يقيم فيه آدمز. كان رجلا صارما للغاية. فبجانب الحراسة كانت له مهام أخرى.. مراقبة آدمز. فقبل عامين تقريبا في إحدى الولايات الامريكية، كان آدمز واطسون يتلقى مكالمة هاتفية من والده الملياردير (سكوت واطسون) طالبا منه الحضور خلال نصف ساعة أينما كان موقعه. حاول الاعتراض بتعلله بضيق الوقت وارتباطه بموعد لزيارة خالة محبوبته (سوزان فريزر). ولكن تحت اصرار والده، كان عليه التصرف بسرعة. موعد زيارته للخالة المريضة مازال فيه متسع من الوقت. فقبل المرور على والده في مكتبه، متمنيا أن تسير الأمور على ما يرام. وفي لحظات كان أمام المكتب الفخم الذي كتب عليه، مركز ادارة شركات واطسون سكوت. أوقف سيارته الفارهة الرياضية في موقف السيارات، ودلف بهدوء إلى الداخل. وفجاءة قطع ذكرياته اقترابه من المبني الذي يسكن فيه. وهو مبنى قديم مكون من طابقين، وملحق بها حديقة كبيرة منسقة الاشجار.	', 'image-book.jpg', '1631172126.pdf', 0, 'رواية, شفرة الملك, شفرة الملك داؤد, الياس', 'شفرة-الملك-داؤد', NULL, NULL),
(13, 28, 2, 2, 1, 1, 'صندوك الفريسكا', 3.00, '2021-07-08', '5', '354', 'gef', '54', '2018', 'ملخص المجموعة القصصية صندوق الفريسكا 1- القصة الأولى حسناء بنها: تتحدث عن قصة حسناء العروسة التي كانت ستُزَفّ خلال أيام على عريسها.. وبعد أن جهزت شقتها ولم يبق إلّا حفل الزفاف والدخلة.. فجأة تموت مخلفة وراءها حسرة لا تنقطع في قلب أبويها. 2- الخروف مات: تتحدث عن موت أحد الخراف فوق سطح أحد المنازل، وحزن أهل البيت عليه.. 3- رفصة عِجْل:تحكي عن تعذيب أحد العجول أثناء ذبحه، وإصابة العجل للجزار الذي تولّى عملية ذبحه، فقد كان جزارًا غشيمًا تسبب برعونته في خوف العجل.. مما جعله يرفصه رفصة كادت تودي بحياته! 4- صندوق الفريسكا: تحكي قصة إبراهيم بائع الفريسكا على الشاطئ، الذي كافح حتى وصل إلى تحقيق حلمه، ونجاحه في الثانوية العامة والتحاقه بكلية الطب.. 5- سرقوا العجلة: تحكي قصة أحد موظفي الأمن الفقراء الذي كان يذهب لعمله بالعجلة، وفوجئ ذات يوم بسرقتها.. ولمَّا كان جالسًا على المقهى يندب حظه ساعده أحد المهندسين من خلال هاتفه المحمول بنشر مقطع عن سرقة العجلة على الفيس بوك.. الأمر الذي حقّق معدل مشاهدة عاليًا, وجلب له رزقًا وفيرًا.. فمن الناس من تبرع بمبلغ ثلاثين ألف جنيه، ومنهم من اشترى له \"موتوسيكل\".. 6- المدقّق: تحكي قصة أحد المدققين اللغويين الذي كافح من أجل الوصول إلى حُلْمِهِ بأن يكون مؤلفًا، وروائيًّا. 7- زهرة البوسنة: تحكي قصة فتاة تمَّ اغتصابها على أيدي مجموعة من الصرب أثناء حرب البوسنة والهرسك في تسعينيات القرن الماضي. 8- برايل وأحمد عبد المعطي: تحكي قصة صبِيٍّ مكفوفِ البصر في العاشرة، يحقق أمله في أن يصبح سبّاحًا، ونتعرف من خلال القصة على طريقة برايل في الكتابة للمكفوفين.. كما نتعرف على المصحف المكتوب بطريقة \"برايل\".. 9- بائع السعادة: عم محمود الخرداواتي، الذي كان يبيع الخرداوات في شارع الجسر، وشراء أحد الأطفال فانوسًا مصنوعًا من الصاج والزجاج، ونتعرف مدى الفرحة والسعادة التي شعر بهما الصبي عندما وضع الشمع في الفانوس. وكذا تصوير فرحة الطفل بالملابس الرياضية التي اشتراها من عم محمود، والفانلة الصفراء المرسوم عليها صورة محمود الخطيب، لاعب الأهلي الشهير في السبعينيات، والثمانينيات من القرن العشرين. 10- صلاح المراجيحي: كان يَنْصُبُ المراجيح أمام \"حارة عابد\" بشارع الجسر، وتصوير فرحة الأطفال بركوب المراجيح، والمفاجأة التي حدثت يوم أن سقطت المراجيح بالأطفال.. 11- إهمال: تحكي قصصًا من إهمال الأمهات لأبنائهنّ.. ممّا تسبّب في وفاتهم.. 12- تمثيل: تحكي قصة قتل عصام المخبر علي يد \"أبي علي\" وأبنائه؛ انتقامًا منه على تغريره بابنتهم، وحملها منه في الحرام! 13- مذكرات ملحد سابق: طالب دكتوراه تعلم بالجامعة الأمريكية، ثم ذهب إلى الولايات المتحدة ليحصل على الدكتوراه في أمراض الكبد... يبتعد عن طريق الإيمان لفترة؛ بسبب تراكمات من مرحلة الطفولة، ويقابل جارته المسيحية التي تؤمن إيمانًا صوفِيًّا.. وتناقشه في أهمية الإيمان في حياة البشر جميعًا.. وخلال عمله بمكتبة لبيع الكتب القديمة يتأثر بما كتبه كل من ماركس وإنجلز ولينين، ويتحول إلى الاشتراكية، ولكن أباه يمرض مرضًا يجعله يلزم الفراش، مما يوجب عليه أن يرحل إلى مصر في زيارة قصيرة.. وعندما يجد تحوّلًا في عائلته يعيد التفكير في جدوى الإيمان وأهميته، فيقرر اصطحاب أمه وأبيه للبحث عن علاج، ثم يذهب للمركز الإسلامي في نيويورك، ويقابل رئيسه الذي يتحاور معه، ويعطيه بعض الكتب التي تجيب على ما يحيره عن الإسلام وعقيدته وشريعته، وكونه الدين الصالح لجميع البشر... يعود إلى مصر في إجازة قصيرة ويلتقي حب حياته، ويتزوج منها ويستعيد إيمانه بربه، ويقرر أن يكتب مذكراته، وكيف ألحد، ثم عاد للإيمان مرة أخرى.	', 'image-book.jpg', '1631172126.pdf', 0, 'صندوق الفريسكا, شعبان منير, مجموعة قصص, رواية	', 'صندوك-الفريسكا', NULL, NULL),
(14, 28, 2, 2, 1, 1, 'كيد الرجال', 2.00, '2021-07-08', '5', '354', 'gef', '54', '2019', 'قصص ورسائل بنكهة فلسفيّة تتجلّى في التّساؤلات الخصبة الّتي تؤدّي إلى تساؤلات متجدّدة، هل المخاطب فتاة أمْ أنّ \"أنتِ\" ليسَ إلّا ضميرا يغري الرّومنسيّة الموسومة بالتّعاسة والارتباك لتتدفّق فيضا بوّاحا لا يكادُ ينضب، ما سرّ العنوان يا ترى؟ يحتاج الجواب إلى قراءة متمعّنة حتما، هو تحدٍّ جديد وقد يكون مجرّد تحدّ آخر بالنّسبة لك وذلك لا يغني عن كونِه قد يكون شيقا وماتعا جدّا. قصص ورسائل بنكهة فلسفيّة تتجلّى في التّساؤلات الخصبة الّتي تؤدّي إلى تساؤلات متجدّدة، هل المخاطب فتاة أمْ أنّ \"أنتِ\" ليسَ إلّا ضميرا يغري الرّومنسيّة الموسومة بالتّعاسة والارتباك لتتدفّق فيضا بوّاحا لا يكادُ ينضب، ما سرّ العنوان يا ترى؟ يحتاج الجواب إلى قراءة متمعّنة حتما، هو تحدٍّ جديد وقد يكون مجرّد تحدّ آخر بالنّسبة لك وذلك لا يغني عن كونِه قد يكون شيقا وماتعا جدّا. قصص ورسائل بنكهة فلسفيّة تتجلّى في التّساؤلات الخصبة الّتي تؤدّي إلى تساؤلات متجدّدة، هل المخاطب فتاة أمْ أنّ \"أنتِ\" ليسَ إلّا ضميرا يغري الرّومنسيّة الموسومة بالتّعاسة والارتباك لتتدفّق فيضا بوّاحا لا يكادُ ينضب، ما سرّ العنوان يا ترى؟ يحتاج الجواب إلى قراءة متمعّنة حتما، هو تحدٍّ جديد وقد يكون مجرّد تحدّ آخر بالنّسبة لك وذلك لا يغني عن كونِه قد يكون شيقا وماتعا جدّا. قصص ورسائل بنكهة فلسفيّة تتجلّى في التّساؤلات الخصبة الّتي تؤدّي إلى تساؤلات متجدّدة، هل المخاطب فتاة أمْ أنّ \"أنتِ\" ليسَ إلّا ضميرا يغري الرّومنسيّة الموسومة بالتّعاسة والارتباك لتتدفّق فيضا بوّاحا لا يكادُ ينضب، ما سرّ العنوان يا ترى؟ يحتاج الجواب إلى قراءة متمعّنة حتما، هو تحدٍّ جديد وقد يكون مجرّد تحدّ آخر بالنّسبة لك وذلك لا يغني عن كونِه قد يكون شيقا وماتعا جدّا.	', 'image-book.jpg', '1631172126.pdf', 0, 'كيد الرجال, بلغنامي, عبدالرحيم', 'كيد-الرجال', NULL, NULL),
(15, 14, 1, 1, 1, 14, 'كيد الرجال مكررر', 8.00, '2021-07-13', '3', '3547', '33', '55555', '2003', 'قصص ورسائل بنكهة فلسفيّة تتجلّى في التّساؤلات الخصبة الّتي تؤدّي إلى تساؤلات متجدّدة، هل المخاطب فتاة أمْ أنّ \"أنتِ\" ليسَ إلّا ضميرا يغري الرّومنسيّة الموسومة بالتّعاسة والارتباك لتتدفّق فيضا بوّاحا لا يكادُ ينضب، ما سرّ العنوان يا ترى؟ يحتاج الجواب إلى قراءة متمعّنة حتما، هو تحدٍّ جديد وقد يكون مجرّد تحدّ آخر بالنّسبة لك وذلك لا يغني عن كونِه قد يكون شيقا وماتعا جدّا. قصص ورسائل بنكهة فلسفيّة تتجلّى في التّساؤلات الخصبة الّتي تؤدّي إلى تساؤلات متجدّدة، هل المخاطب فتاة أمْ أنّ \"أنتِ\" ليسَ إلّا ضميرا يغري الرّومنسيّة الموسومة بالتّعاسة والارتباك لتتدفّق فيضا بوّاحا لا يكادُ ينضب، ما سرّ العنوان يا ترى؟ يحتاج الجواب إلى قراءة متمعّنة حتما، هو تحدٍّ جديد وقد يكون مجرّد تحدّ آخر بالنّسبة لك وذلك لا يغني عن كونِه قد يكون شيقا وماتعا جدّا. قصص ورسائل بنكهة فلسفيّة تتجلّى في التّساؤلات الخصبة الّتي تؤدّي إلى تساؤلات متجدّدة، هل المخاطب فتاة أمْ أنّ \"أنتِ\" ليسَ إلّا ضميرا يغري الرّومنسيّة الموسومة بالتّعاسة والارتباك لتتدفّق فيضا بوّاحا لا يكادُ ينضب، ما سرّ العنوان يا ترى؟ يحتاج الجواب إلى قراءة متمعّنة حتما، هو تحدٍّ جديد وقد يكون مجرّد تحدّ آخر بالنّسبة لك وذلك لا يغني عن كونِه قد يكون شيقا وماتعا جدّا. قصص ورسائل بنكهة فلسفيّة تتجلّى في التّساؤلات الخصبة الّتي تؤدّي إلى تساؤلات متجدّدة، هل المخاطب فتاة أمْ أنّ \"أنتِ\" ليسَ إلّا ضميرا يغري الرّومنسيّة الموسومة بالتّعاسة والارتباك لتتدفّق فيضا بوّاحا لا يكادُ ينضب، ما سرّ العنوان يا ترى؟ يحتاج الجواب إلى قراءة متمعّنة حتما، هو تحدٍّ جديد وقد يكون مجرّد تحدّ آخر بالنّسبة لك وذلك لا يغني عن كونِه قد يكون شيقا وماتعا جدّا.', '1631172126.jpeg', '1631692267.pdf', 0, 'كيد الرجال, بلغنامي, عبدالرحيم n', 'كيد-الرجال-مكررر', NULL, '2021-09-17 12:19:55'),
(16, 48, 3, 1, 1, 14, 'من الشغف إلي الهدف', 15.00, '2021-07-13', '3', '3547', '33', '55555', '2000', 'يرشدك هذا الكتاب إلى تحقيق ثلاثة أهداف رئيسية : 1- النجاح 2- السعادة 3- الثراء أيضاً نتعلم في هذا الكتاب الطرق العملية في حل العديد من مشكلات الحياة المختلفة التالية: 1- العمل (كسب المال) وكيفية البدء بمشروع جديد. 2- مشكلة التشتت ( لا نعرف بالضبط ماذا نريد، كيف نعيش، ما هي أهدافنا). 3- المخاوف المختلفة: الخوف من الفقر، الخوف من الموت، الخوف من المستقبل، الخوف من مواجة الناس، الخوف من الفشل، الخوف من النجاح. 4- القلق والتوتر والحزن والاكتئاب والغضب والاحباط. 5- عدم الارتياح في الوظيفة أو المهنة الحالية. 6- ادارة الذات، كيف نستطيع إدارة الأفكار والمشاعر والسلوك. سنقوم بعلاج هذه المشكلات من خلال الطرق والتوصيات والأفكار في رحلة الحياة (نقدم أفكار وحلول) بإسلوب شيق، للبدء من الشغف والانتهاء بالهدف لتحقيق السعادة والنجاح والثراء. يجيب الكتاب عن السؤال \"كيف\" أكثر من السؤال \"ماذا\"، لذلك فهو يركز على أهم التجارب والتوصيات المبنية على الخبرات العملية وليس مجرد نظريات أو معلومات فقط. لذلك سنتعلم كيفية إدارة ذاتنا وحياتنا، كيف نغير تفكيرنا، كيف ننجح بمشاريعنا، كيف نفكر بعقلية الأغنياء بدل عقلية الفقراء، كيف نتخلص من الخوف والقلق والاكتئاب، كيف نعيش حياتنا بسعادة، كيف نزيد من دخلنا المادي، كيف نطور مهنتنا، كيف نبدأ مشروعنا الخاص، وذلك من خلال خطوات عملية واقعية مبنية على خبرات وتجارب المؤلف. ملاحظات: 1- إن جميع الشخصيات والقصص التي في الكتاب هي من خيال المؤلف وليست حقيقية. 2- إن محتوى هذا الكتاب يعبّر عن رأي المؤلف فقط وذلك من واقع خبرات وتجارب المؤلف، باستثناء بعض المفاهيم العامة المقتبسة من مصادر أخرى ومشار اليها بالمراجع ]بين قوسين[ والمدرجة في نهاية الكتاب.', '1631001767.jpg', '1631172126.pdf', 0, 'من الشغف الى الهدف,الشغف,الموهبة,المهارات ,مهارات الحياة,تنمية الثقة بالنفس,قوة الشخصية,النجاح,معادلة النجاح,طريق النجاح,النجاح في المهنة,تاسيس مشروع,السعادة,تحقيق السعادة,تحقيق الثراء,الحرية المالية', 'من-الشغف-إلي-الهدف', NULL, '2021-09-11 09:03:48'),
(17, 48, 1, 1, 1, 3, 'حالتي النفسية سيئة جداً', 6.00, '2021-07-13', '3', '3547', '33', '55555', '2000', 'يرشدك هذا الكتاب إلى التخلص من الحالة النفسية السيئة وإعادة طعم الحياة الحلوة وإضاءة النور في طريق حياتك النفسية والعاطفية والإجتماعية، وبناء الثقة بالنفس وقوة الشخصية. هذا الكتاب عملي تطبيقي، يحتوي على إرشادات وتمارين عملية ذهنية وسلوكية مبنية على تجارب وخبرات المؤلف من أجل تحسين الصحة النفسية وبناء الثقة بالنفس وقوة الشخصية والتخلص من المشاعر السلبية. هذا الكتاب ليس كتاب طبي وليس كتاب عِلمي وإنما كتاب مبني على تجارب وخبرات المؤلف، الذي قام بتقديم العديد من البرامج التدريبية في التنمية البشرية والبرمجة اللغوية العصبية ومهارات النجاح في الحياة؛ لا يوجد في الكتاب أي شيء يمت صلة بالعلاج بالأدوية أو يمت صله بالطب وإنما فقط مجموعة تمارين وإرشادات حسب الرأي الشخصي للمؤلف في طريقة التفكير وبناء الثقة بالنفس من أجل التخلص من المشاعر السلبية مثل: الخوف، القلق، الوسواس، الإكتئاب، التوتر، الغضب، الخجل، اليأس والإجباط. في هذا الكتاب سوف تتعلم كيف تفكر بطريقة إيجابية سليمة، وأن تتخلص من التفكير السلبي أو التفكير الزائد، وكيف تقوم ببرمجة عقلك الباطن بطريقة صحيحة من أجل التخلص من المشاعر السلبية ومن أجل تقوية الشخصية وزيادة الثقة بالنفس، وكيف تتغلب على مخاوفك، وكيف تعيش حياتك بسعادة، بدون حزن ولا قلق ولا خوف ولا توتر. سلسلة المشاعر السلبية تبدأ بالتفكير السلبي والإستجابة السلبية للظروف الصعبة والذكريات الأليمة والناس السلبين والمحبطين من حولنا وتنتهي باليأس من الحياة مروراً بالمراحل التالية والتي تعتبر متسلسلة ومترابطة إلى حد كبير: المرحلة الاولى: ظهور مشكلة الظروف الصعبة في البيئة المحيطة بنا والصعوبات في التعامل مع الناس، وظهور مشاكل بسبب الذكريات الأليمة. المرحلة الثانية: التفكير السلبي والإستجابة السلبية للظروف المذكورة بالمرحلة الأولى. المرحلة الثالثة: ظهور المخاوف المختلفة مثل: ( الخوف من المرض، الخوف من الفشل، الخوف من المستقبل، الخوف من المسئولية، الخوف من الزواج، الخوف من الناس، الخوف من انتقادات الناس، الخوف من البدء بعمل جديد أو مشروع جديد، الخوف من المجهول، الخوف من الموت ........ الخ ). المرحلة الرابعة: القلق والتوتر. المرحلة الخامسة: الغضب السريع والشعور بالضيق. المرحلة السادسة: الإكتئاب. المرحلة السابعة: ظهور بعض الأعراض الجسدية نتيجة الحالة النفسية ( ألم بالمعدة، خدران بالأطراف، مشكلات في البطن والغازات والقولون، صداع، تعب عام، أرق، إنخفاض بالطاقة الحيوية والنشاط الجسدي، ........ الخ). المرحلة الثامنة: السلوك السلبي، الهروب من الواقع والإنطوائية، شرود الذهن، العيش بأحلام اليقضة والعالم الإفتراضي، كثرة النسيان، اختلال الاَنية. المرحلة التاسعة: السلوك الإدماني، الإدمان على المُسَكّرات والمخدرات من أجل الهروب من الواقع ونسيان الحاضر. المرحلة العاشرة: اليأس من الحياة والتفكير بالإنتحار. اذا كنت تعاني من حالة نفسية فبأي مرحلة وصلت من المراحل المتسلسلة العشرة السابقة؟ مهما كانت المرحلة التي وصلت إليها فلا تقلق، سنقدم لك الحل بطرق بسيطة وسهلة التطبيق من خلال مجموعة إرشادات وتمارين عملية من أجل التخلص من الحالة النفسية، وأيضاً تقوية الشخصية وزيادة الثقة بالنفس. اقرأ هذا الكتاب من أوله الى اَخره بنفس التسلسل لتحصل على الفائدة. الكتاب يعرض المشكلة والحل بشكل مختصر، كتاب صغير بمحتوى كبير، قم بتطبيق التمارين والإرشادات الموجودة بالكتاب أول بأول، لا تستعجل بقراءة الكتاب. الكتاب يُركّز على أهم التجارب والتوصيات المبنية على تجارب وخبرات المؤلف الذي قام بتقديم العديد من الدورات التدريبية في التنمية البشرية والنجاح بالحياة؛ لذلك سوف تتعلم كيفية إدارة ذاتك وحياتك، كيف تغير تفكيرك، كيف تتخلص من الخوف والقلق والتوتر والحزن والإكتئاب والغضب والتفكير السلبي، كيف تعيش حياتك بسعادة، كيف تستعيد ثقتك بنفسك ونشاطك وحماسك، وذلك من خلال (الإرشادات والتمارين) على شكل خطوات عملية.', '1631001727.jpeg', '1631172126.pdf', 0, 'التفكير السلبي,حالتي النفسية سيئة جدا,حسني المستريحي,الخوف,القلق,التوتر,الوسواس,اختلال الانية,الوسواس القهري', 'حالتي-النفسية-سيئة-جدا', NULL, '2021-09-07 08:02:07'),
(18, 29, 1, 1, 1, 3, ' أسطورة أڤمد الجزء الثالث-جواب بين نظرتين  ', 2.00, '2021-07-13', '3', '3547', '33', '55555', '2020', 'الملخّص: يسعى الكاتبُ إلى تأليف جزء ثالث لإحدى الأساطير الشّعبيّة الخاصّة بمنطقة القبائل بأعالي جبال تيزي وزّو بالجزائر، هي حكاية شعبيّة بطلُها أقمد، وخلال ذلك يكتشف رفقة صديقه أحمد أنّ هنالك عجوزا تعيشُ وحيدة تعرفُ تكملة القصّة. يخوض الكاتبُ مغامرات غريبة وغير متوقعة ويسترجعُ ذكريات كثيرة من أجل الوصولِ إلى مراده. الملخّص: يسعى الكاتبُ إلى تأليف جزء ثالث لإحدى الأساطير الشّعبيّة الخاصّة بمنطقة القبائل بأعالي جبال تيزي وزّو بالجزائر، هي حكاية شعبيّة بطلُها أقمد، وخلال ذلك يكتشف رفقة صديقه أحمد أنّ هنالك عجوزا تعيشُ وحيدة تعرفُ تكملة القصّة. يخوض الكاتبُ مغامرات غريبة وغير متوقعة ويسترجعُ ذكريات كثيرة من أجل الوصولِ إلى مراده. الملخّص: يسعى الكاتبُ إلى تأليف جزء ثالث لإحدى الأساطير الشّعبيّة الخاصّة بمنطقة القبائل بأعالي جبال تيزي وزّو بالجزائر، هي حكاية شعبيّة بطلُها أقمد، وخلال ذلك يكتشف رفقة صديقه أحمد أنّ هنالك عجوزا تعيشُ وحيدة تعرفُ تكملة القصّة. يخوض الكاتبُ مغامرات غريبة وغير متوقعة ويسترجعُ ذكريات كثيرة من أجل الوصولِ إلى مراده. الملخّص: يسعى الكاتبُ إلى تأليف جزء ثالث لإحدى الأساطير الشّعبيّة الخاصّة بمنطقة القبائل بأعالي جبال تيزي وزّو بالجزائر، هي حكاية شعبيّة بطلُها أقمد، وخلال ذلك يكتشف رفقة صديقه أحمد أنّ هنالك عجوزا تعيشُ وحيدة تعرفُ تكملة القصّة. يخوض الكاتبُ مغامرات غريبة وغير متوقعة ويسترجعُ ذكريات كثيرة من أجل الوصولِ إلى مراده.	', '1631001727.jpeg', '1631172126.pdf', 0, 'بلغنامي, عبدالرحيم, أسطورة أڤمد	', ' أسطورة-أڤمد-الجزء-الثالث-جواب-بين نظرتين  ', '2021-09-23 17:25:26', '2021-09-07 08:02:07'),
(19, 29, 1, 1, 1, 3, ' أسطورة أڤمد الجزء الثاني-الميراث الأبدي  ', 2.00, '2021-07-13', '3', '3547', '33', '55555', '2020', 'ملخّص رواية: أسطورة أ ڤمد (الميراث الأبدي) -الرّواية ذات قالبٍ فلسفيّ عموما. -يتأثّر الكاتب بإحدى القصص الّشعبيّة لمنطقة القبائل تدعى \"أسطورة أ ڤمد\"؛ والّتي يرويها له صديقه، هذا يجعله يعودُ من الغربة إلى الوطن من أجل استعادة حبيبته إيمان التي فارقته دون سابق إنذار أو تفسير، لكنّه يصدم بموتِها... بعدَ مدّة يلتقي ابنة عمّ زوجة صديقِه والّتي تروي له بقيّة القصّة الشّعبيّة، لكن أثناء ذلك تنشأ بينهما علاقة وتتكشّف حقائق كثيرة وتتهيّج الذّكريات بشكل مبعثر، لكنّها في مرحلة ما تترابط ليتشكّل المشهد الكامل ويكتشف الكاتب أنّ حبيبته إيمان، دبّرت فراقهما لأنّها كانتْ تنوي أن تأتمنَهُ على أغلى ميراث كان من الممكن أن تتركه له. من جهة أخرى يقرّر أڤمد-بطل الأسطورة الشّعبية-الانتقام من قريته الّتي طردتهُ بعد تحوّله إلى تنّين، غير أنّ الأمور تأخذ منعطفا حادّا، بعد أن يدرك أنّ أحدهم سرق الشّعلة المقدّسة من القوم الّذين يحكمهم (أي التّنانين)، يضطرّ بعدها لمواجهة كائنات سفليّة وقوى خارقة، ينتصرُ عليها في النّهاية، ويتمكّن من تسليم أحد الأشخاص الّذين آذاهم ذكرى من أحد الغالين على قلوبهم تكفيرا على خطئه الّذي أُجبر على ارتكابه ذات يوم. ملخّص رواية: أسطورة أ ڤمد (الميراث الأبدي) -الرّواية ذات قالبٍ فلسفيّ عموما. -يتأثّر الكاتب بإحدى القصص الّشعبيّة لمنطقة القبائل تدعى \"أسطورة أ ڤمد\"؛ والّتي يرويها له صديقه، هذا يجعله يعودُ من الغربة إلى الوطن من أجل استعادة حبيبته إيمان التي فارقته دون سابق إنذار أو تفسير، لكنّه يصدم بموتِها... بعدَ مدّة يلتقي ابنة عمّ زوجة صديقِه والّتي تروي له بقيّة القصّة الشّعبيّة، لكن أثناء ذلك تنشأ بينهما علاقة وتتكشّف حقائق كثيرة وتتهيّج الذّكريات بشكل مبعثر، لكنّها في مرحلة ما تترابط ليتشكّل المشهد الكامل ويكتشف الكاتب أنّ حبيبته إيمان، دبّرت فراقهما لأنّها كانتْ تنوي أن تأتمنَهُ على أغلى ميراث كان من الممكن أن تتركه له. من جهة أخرى يقرّر أڤمد-بطل الأسطورة الشّعبية-الانتقام من قريته الّتي طردتهُ بعد تحوّله إلى تنّين، غير أنّ الأمور تأخذ منعطفا حادّا، بعد أن يدرك أنّ أحدهم سرق الشّعلة المقدّسة من القوم الّذين يحكمهم (أي التّنانين)، يضطرّ بعدها لمواجهة كائنات سفليّة وقوى خارقة، ينتصرُ عليها في النّهاية، ويتمكّن من تسليم أحد الأشخاص الّذين آذاهم ذكرى من أحد الغالين على قلوبهم تكفيرا على خطئه الّذي أُجبر على ارتكابه ذات يوم.	', '1631001727.jpeg', 'belghanamiabderrahim@gmail.com_application_pdf_1617876894048.pdf', 0, 'أسطورة أڤمد, بلغنامي, عبدالرحيم	', ' أسطورة-أڤمد-الجزء-الثاني-الميراث-الأبدي  ', '2021-09-23 17:25:26', '2021-09-07 08:02:07'),
(20, 29, 1, 1, 1, 3, ' أسطورة أڤمد الجزء الأول)-جواب بين نظرتين  ', 2.00, '2021-07-13', '3', '3547', '33', '55555', '2020', 'هي رواية من نوع الأساطير الشّعبية الهادفة، تحكي قصّة ميلين الفتاة القبائليّة الجميلة وزوجها أحمد، تطلبُ منه أخذها إلى بيتِ أبيها بعدَ خصامِهما، هناكَ أينَ يروي له أبوها \"عمّي يغموراسن\" أسطورة شعبيّة بطلُها يدعى أڤمد... تعبثُ القصّة بواقعِه وتجعلُه يستعيدُ ذكريات ظنّ أنّه نسيَها، وفي اليوم التّاسع تتوضّحُ الأمور... عندئذ يفهم السبب الّذي من أجله روى له الحكاية ويدرك مكمن المشكل في علاقته بزوجته. تتأرجحُ القصّة بينَ الواقع والخيال، متخمة بالرومنسية والخيال والدراما وروح الدّعابة، ولا تخلوا من الأسئلة الفلسفيّة الشّهيّة والأجوبة المختلفة. الرواية عمل تمّ نشره وتوجد قراءات عنه، لكنّه متحرّر من كل الالتزامات وللكاتب حرّيّة التصرّف فيه، أتمنّى أن ينال إعجابكم. هذه إحدى القراءات: https://www.djazairess.com/eldjoumhouria/179624 هي رواية من نوع الأساطير الشّعبية الهادفة، تحكي قصّة ميلين الفتاة القبائليّة الجميلة وزوجها أحمد، تطلبُ منه أخذها إلى بيتِ أبيها بعدَ خصامِهما، هناكَ أينَ يروي له أبوها \"عمّي يغموراسن\" أسطورة شعبيّة بطلُها يدعى أڤمد... تعبثُ القصّة بواقعِه وتجعلُه يستعيدُ ذكريات ظنّ أنّه نسيَها، وفي اليوم التّاسع تتوضّحُ الأمور... عندئذ يفهم السبب الّذي من أجله روى له الحكاية ويدرك مكمن المشكل في علاقته بزوجته. تتأرجحُ القصّة بينَ الواقع والخيال، متخمة بالرومنسية والخيال والدراما وروح الدّعابة، ولا تخلوا من الأسئلة الفلسفيّة الشّهيّة والأجوبة المختلفة. الرواية عمل تمّ نشره وتوجد قراءات عنه، لكنّه متحرّر من كل الالتزامات وللكاتب حرّيّة التصرّف فيه، أتمنّى أن ينال إعجابكم. هذه إحدى القراءات: https://www.djazairess.com/eldjoumhouria/179624	', '1631001727.jpeg', '1631172126.pdf', 0, 'أسطورة أڤمد, بلغنامي, عبدالرحيم	', ' أسطورة-أڤمد-الجزء-الأول)-جواب-بين نظرتين  ', '2021-09-23 17:25:26', '2021-09-07 08:02:07'),
(21, 52, 1, 1, 1, 3, ' نباتات الأسفلت', 3.00, '2021-07-13', '3', '3547', '33', '55555', '2018', 'نباتات الاسفلت هي مجموعة قصصية حصلت على جائزة عماد قطري للإصدار الأول سنة ، للقاص أحمد ثروت2017 تتكون من 23 قصة مختلفة في الطول و الرؤية و الطرح عبارة عن ثلاث قصص قصيرة جداً و عشرين قصة قصيرة أو طويلة ، يقسم المؤلف الكتاب لخمسة أجزاء كل جزء يحوي بين ثلاث و ست قصص، و كل جزء يحمل عنواناً مختلفاً فالجزء الأول مثلاً عنوانه عن الشتاء و الصباحات الأخيرة أغني أنا و يشمل قصص وقائع قصيرة من الشارع الطويل و الخروج العودة و اختيار و المرشّح ، و الجزء الأخير عنوانه عن نباتات الأسفلت نفسها أحكي لكم و يشمل القصة التي تحمل اسمها المجموعة .المجموعة القصصية عنوانها نباتات الأسفلت و أسفلها كتب المؤلف: أحداث لم تذكرها كتب التاريخ و الجغرافيا. كتبت قصص المجموعة بين أعوام 1995 و 2001 و قصة واحدة عامة 2004 في فترة الحياة الجامعية للمؤلف تتنوع فضاءات القصص الموجودة بالمجموعة بين الغرف المغلقة والسماوات المفتوحة، بين دواخل النفس البشرية ومظاهر المجتمع المحيط.. كما يحاول الكاتب من خلال النصوص القصصية مناقشة العديد من القضايا المجتمعية أو النفسية من خلال أطروحات قصصية تختلف في الشكل وكيفية السرد ويحاول من خلالها المؤلف التجريب بشتى الطرق المتاحة أمامه دون أن يُلزم نفسه بقالب قصصي محفوظ أو شكل متفق عليه.مجموعة قصصية متنوعة ومتباينة بشكل واضح	', '1631001727.jpeg', '1631172126.pdf', 0, 'قصة،قصة قصيرة،كتب،أدب،نباتات الاسفلت،أحمد ثروت	', ' نباتات-الأسفلت  ', '2021-09-23 17:25:26', '2021-09-07 08:02:07'),
(22, 20, 1, 1, 1, 3, ' تكهنات لا تخطئ', 3.00, '2021-07-13', '3', '3547', '33', '55555', '2020', 'حين ننفتح من جديد على الواقعيّة لنتفحّص جيّدا أخبار مجتمعنا الغارق في الفقر والتخلّف والجهل والأحلام الهاربة تلك التي لا تعدو أن تكون أوهاما.. مأساة الإنسان الفرد داخل مجتمع فردانيّ متوحّش لا يولي اهتماما إلّا للمادة والمال. ذلك المجتمع الذي افتقد أخلاقه يعيش على هامش التاريخ حياة المزابل. فشخصيات قصصنا هي أشباح بشر بلا ذوات، مرهقة ومثقلة بالألم والسخط والضياع، تتساءل وتبحث عن الخلاص، ثم تختار طريق الوهم حالمة بالثراء السريع وزواج البدعة ومتعة حسيّة غائبة وروح منسيّة تائهة، وذوات بلا حياة تعيش مأساتها اليوميّة بلا شريك فلا أحد يهتمّ لأحد إلا بمقدار ما يدفعه من مال.. قصص مجموعتنا حالات اجتماعيّة بائسة ولكنّ تلك الحالات لم تبقى استثناءً بل صارت القاعدة ومن خلالها نتعرّف على ملامح مجتمع يرزح تحت الجهل والفقر والجريمة.. القتلة الثلاثة هادمي اللذات ومفرّقي الجماعات. متى اجتمعوا لم يكن بعد حياة. والمثقف في هذا المجتمع مغلوب على أمره، مرفوض أو منسجم مع مجتمعه، مرتهن قلمه وفكره للسلطة، فهو منافق ومهادن، ساقط في الفردانيّة يبحث عن وهمه الخاص في السعادة محاولا سرقة بعض اللحظات السعيدة مختارا عزلته التي تُخترق دائما. وهو متخاذل فاشل تافه إلى أقصى درجات التفاهة. منسحب إلى درجة التفأرن. خائف ومطارد وكلب.. إنّه التيه والتخبّط في البحث عن حلول، ولكننا أثناء رحلة البحث عن ذلك الحل السحريّ للقضايا الكبرى لشخصياتنا، تنسحب على بؤسنا خرائط الحزن الذي لا يخرقه أمل، فكل الأبواب موصدة إلا باب الوهم والتخبط في اللوعة والأفعال التي لا تؤدي إلا إلى الضياع والخيبة والجنون.. إنّه عالمنا القديم وقد تجدّد بآليات معاصرة، عالم الجريمة والفقر والهزيمة والجهل والضياع. ذلك العالم الذي نعيد اكتشافه أدبيا لنقف على مسبباته وعوامل خذلانه وتشريح دلالاته. وعند اكتشافنا لهذا العالم ننفتح كما ننغلق على حياة هي موت مؤجل التنفيذ وتخبّط في متاهات لا نريدها حين نطمح بتلك الأشياء التي تبدو من حقنا، لكن في غيابها وفي ظلّ واقعنا المحاصر بالفساد والضجر والخديعة تجد شخصيات قصصنا أنفسها من جديد في مواجهة الضياع..	', '1631001727.jpeg', '1631172126.pdf', 0, 'واقعية , مجتمع , سخرية , خيبة , محاولة نجاح , تشويق	', ' تكهنات-لا-تخطئ', '2021-09-23 17:25:26', '2021-09-07 08:02:07'),
(23, 19, 1, 1, 1, 3, ' ابتسم للحياة', 5.00, '2021-07-13', '3', '3547', '33', '55555', '2016', 'مجموعة قصصية عبارة عن قصص واقعية مر بها الكاتب	', '1631001727.jpeg', '1631172126.pdf', 0, 'واقعية , مجتمع , سخرية , خيبة , محاولة السعادة,الفرح,التفاؤل,التنمية البشرية,ديني,القوة	 , تشويق	', ' ابتسم-للحياة', '2021-09-23 17:25:26', '2021-09-07 08:02:07'),
(24, 14, 2, NULL, NULL, 14, 'evrev', 3.00, '2021-09-28', '33', 'refre', 'ee', 'erfre', '2002', 'ferfre', '1631679436.jpeg', 'books1.pdf', 0, 'ferfe', 'evrev', '2021-09-15 04:17:16', '2021-09-15 04:17:16');

-- --------------------------------------------------------

--
-- Table structure for table `carts`
--

CREATE TABLE `carts` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `bookId` bigint(20) UNSIGNED NOT NULL,
  `userId` bigint(20) UNSIGNED NOT NULL,
  `number` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `status` int(11) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `carts`
--

INSERT INTO `carts` (`id`, `bookId`, `userId`, `number`, `status`, `created_at`, `updated_at`) VALUES
(5, 5, 14, NULL, 0, '2021-09-03 09:19:11', '2021-09-03 09:19:11'),
(6, 3, 14, NULL, 0, '2021-09-03 09:19:22', '2021-09-03 09:19:22');

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `icon` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `slug` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `status` int(11) NOT NULL DEFAULT 0,
  `top` int(11) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `title`, `icon`, `image`, `slug`, `status`, `top`, `created_at`, `updated_at`) VALUES
(1, '  الرواية و الشعر', 'cwfrw', 'fwfr', 'style1', 1, 0, NULL, NULL),
(2, ' التنمية البشرية', 'cwfrw', 'fwfr', 'style1', 1, 0, NULL, NULL),
(3, 'النجاح والثراء  ', 'cwfrw', 'fwfr', 'style1', 1, 0, NULL, NULL),
(4, ' الصحة النفسية', 'cwfrw', 'fwfr', 'style1', 1, 0, NULL, NULL),
(5, ' السعادة و أنماط الحياة', 'cwfrw', 'fwfr', 'style1', 1, 0, NULL, NULL),
(6, 'المذاكرة وقوة الحفظ', 'cwfrw', 'fwfr', 'style1', 1, 0, NULL, NULL),
(7, 'الفن والأدب  ', 'cwfrw', 'fwfr', 'style1', 1, 0, NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `certificates`
--

CREATE TABLE `certificates` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `chapters`
--

CREATE TABLE `chapters` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `courseId` bigint(20) UNSIGNED NOT NULL,
  `chapter_name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `short_number` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `status` int(11) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `chapters`
--

INSERT INTO `chapters` (`id`, `courseId`, `chapter_name`, `short_number`, `status`, `created_at`, `updated_at`) VALUES
(1, 1, 'chapter 1', '1', 0, '2021-08-13 04:02:22', '2021-08-13 04:02:22');

-- --------------------------------------------------------

--
-- Table structure for table `child_categories`
--

CREATE TABLE `child_categories` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `categoryId` bigint(20) UNSIGNED NOT NULL,
  `subCategoryId` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `icon` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `slug` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `status` int(11) NOT NULL DEFAULT 0,
  `top` int(11) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `child_categories`
--

INSERT INTO `child_categories` (`id`, `categoryId`, `subCategoryId`, `title`, `icon`, `slug`, `status`, `top`, `created_at`, `updated_at`) VALUES
(1, 1, 1, 'style3', 'vsvsf', 'vsfvfs', 0, 0, NULL, NULL),
(2, 1, 1, 'style3', 'vsvsf', 'vsfvfs', 0, 0, NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `cities`
--

CREATE TABLE `cities` (
  `id` int(10) UNSIGNED NOT NULL,
  `countryId` int(11) NOT NULL,
  `name` varchar(255) CHARACTER SET utf8 NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `contacts`
--

CREATE TABLE `contacts` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `contact_infos`
--

CREATE TABLE `contact_infos` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `logo` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `title_ar` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `title_en` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `phone` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `address_ar` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `address_en` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `mesion_ar` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `mesion_en` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `longitude` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `latitude` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `mesion_image` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `vesion_ar` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `vesion_en` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `vesion_image` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `description_ar` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `description_en` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `privacy_ar` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `privacy_en` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `terms_ar` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `terms_en` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `agreements_ar` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `agreements_en` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `return_ar` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `return_en` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `version` double DEFAULT NULL,
  `favicon` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `percent` int(11) DEFAULT NULL,
  `max_price` int(11) DEFAULT NULL,
  `min_price` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `contact_infos`
--

INSERT INTO `contact_infos` (`id`, `logo`, `title_ar`, `title_en`, `phone`, `email`, `address_ar`, `address_en`, `mesion_ar`, `mesion_en`, `longitude`, `latitude`, `mesion_image`, `vesion_ar`, `vesion_en`, `vesion_image`, `description_ar`, `description_en`, `privacy_ar`, `privacy_en`, `terms_ar`, `terms_en`, `agreements_ar`, `agreements_en`, `return_ar`, `return_en`, `version`, `favicon`, `percent`, `max_price`, `min_price`, `created_at`, `updated_at`) VALUES
(1, '1630673621.jpeg', 'vevre', 'vrev', ' 009 054 43 80 7388', ' admin@kutuphanah.com', 'Halaskargazi Cad. No:53 Kemahlı apt. Kat:8 Şişli : ISTANBUL / TURKEY ', 'Halaskargazi Cad. No:53 Kemahlı apt. Kat:8 Şişli : ISTANBUL / TURKEY ', NULL, NULL, '6356', '635635', NULL, NULL, NULL, NULL, '<h1 style=\"text-align:right\">عن منصة كوتبانه</h1>\r\n\r\n<h4 style=\"text-align:right\">كوتبانه هي منصة لبيع الكتب العربية الرقمية حول العالم، وتتيح مجال للمؤلف أن يكون هو الناشر لعمله على المنصة، وتتيح مجال للقراء امكانية شراء الكتب الرقمية بصيغة PDF</h4>\r\n\r\n<h5 style=\"text-align:right\">منصة كوتبانه هي علامة تجارية تابعة لشركة:</h5>\r\n\r\n<p style=\"text-align:right\">THE ADVANCED STYLE FOR TRAININIG EGITIM VE REHBERLIK HIZ.LTD.STI.</p>\r\n\r\n<h5 style=\"text-align:right\">العنوان:&nbsp; تركيا- مدينة اسطنبول</h5>\r\n\r\n<p style=\"text-align:right\">Şişli -İstanbul /T&uuml;rkiye,&nbsp;&nbsp;&nbsp; Ergenekon mah. Halaskargazi cad. Kemahlı apt. No:53 ,&nbsp; D:10</p>\r\n\r\n<p style=\"text-align:right\">بيانات البنك التابع للشركة :<br />\r\nCountry : Turkey<br />\r\nCity : Istanbul<br />\r\nBank Name : Kuveytturk bank</p>\r\n\r\n<p style=\"text-align:right\">Branch Name : Sisli<br />\r\nAccount Number : 10035566<br />\r\nIBAN : TR62 0020 5000 0100 3556 6000 01<br />\r\nSWIFT code : KTEFTRISXXX<br />\r\nBeneficiary Name : The Advanced Style for Training egitim ve rehberlik hizmetleri limited sirketi<br />\r\nالعملة : TL</p>', '<h1>About&nbsp;kutuphanah</h1>\r\n\r\n<p>Kotbaneh is a platform for selling digital Arabic books around the world, and it allows the author to be the publisher of his work on the platform, and it allows readers to buy digital books in PDF format<br />\r\nCotban platform is a trademark of:<br />\r\nTHE ADVANCED STYLE FOR TRAININIG EGITIM VE REHBERLIK HIZ.LTD.STI.</p>\r\n\r\n<p>Address: Turkey - Istanbul</p>\r\n\r\n<p>Country&nbsp;: Turkey<br />\r\nCity : Istanbul<br />\r\nBank Name : Kuveytturk bank<br />\r\nBranch Name : Sisli<br />\r\nAccount Number : 10035566<br />\r\nIBAN : TR62 0020 5000 0100 3556 6000 01<br />\r\nSWIFT code : KTEFTRISXXX<br />\r\nBeneficiary Name : The Advanced Style for Training egitim ve rehberlik hizmetleri limited sirketi<br />\r\nCurrency : TL</p>', '<h1 style=\"text-align:center\">سياسة الخصوصية</h1>\r\n\r\n<p style=\"text-align:right\">&nbsp;</p>\r\n\r\n<p style=\"text-align:right\">&nbsp;</p>\r\n\r\n<p style=\"text-align:right\">سياسة الخصوصية هذه توفر طريقة جمع البيانات الخاصة بك بالطريقة المستخدمة من قبل كوتبانه. ننصح بقرأة سياسة الخصوصية بعناية. عن طريق الدخول إلى الخدمات التي تقدمها kutuphanah.com انك توافق على جمع و استخدام البيانات الخاصة بك عن طريق kutuphanah.com و بعض مقدمي الخدمة طرف ثالث بالطريقة المنصوص عليها في سياسة الخصوصية هذه. إذا كنت لا توافق على سياسة الخصوصية هذه، يرجى عدم استخدام هذا الموقع kutuphanah.com من خلال قبول سياسة الخصوصية أثناء التسجيل، يجب أن توافق صراحة على استخدامنا و الكشف عن المعلومات الشخصية الخاصة بك وفقاً لسياسة الخصوصية هذه. يتم تضمينها في سياسة الخصوصية هذه و تخضع لشروط اتفاقية المستخدم.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h5>حماية الخصوصية الخاصة بك مع كوتبانه</h5>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>تقدم كوتبانه العلامات التجارية الرائدة عالميًا وتجهز مجموعة منتجات شاملة تتضمن الكتب الرقمية. نريدك أن تشعر بالراحة عند استخدام موقعنا و تشعر بالأمان عند مشاركتك المعلومات الخاصة بك معنا، و بالتالي نحن فخورون للغاية بالتزامنا لحماية خصوصيتك. يرجى مواصلة قرأة السياسة التالية لفهم كيف يتم التعامل مع المعلومات الشخصية الخاصة بك كما تمكنك من الإستفادة الكاملة من موقعنا.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h5>ضمان الخصوصية الخاصة بك مع كوتبانه</h5>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>كوتبانه تلتزم بعدم بيع أو تأجير معلوماتك الشخصية لأي طرف ثالث (بإستثناء ماهو منصوص عليه في سياسة الخصوصية هذه) دون موافقتك. نحن و / أو المخولين مزودي الخدمة طرف ثالث المخولين لإستخدام المعلومات الشخصية التي قدمتها لنوفر لك الخدمات التي نقدمها.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h5>الطرف الثالث &ndash; مزودي الخدمة</h5>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>نحن نوظف شركات أخرى و أفراد لأداء المهام نيابة عنا. ومن الأمثلة على ذلك مباشرة الطلبات، إرسال البريد الإلكتروني،تحليل البيانات،تقديم المساعدة والتسويق، تقديم نتائج البحث، تجهيز مدفوعات بطاقات الائتمان. لديهم إمكانية الوصول إلى المعلومات الشخصية اللازمة لأداء وظائفهم، ولكن لاتستخدم لأغراض أخرى.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h5>المعلومات التي يمكن جمعها منك</h5>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>كوتبانه تقوم يجمع المعلومات التي قدمت من خلالكم في سجل جنباً إلى جنب مع المعلومات التي عرفناها عنك من خلال زيارة موقعنا و استخدامك لخدماتنا. نحن أيضاً نقوم بجمع المعلومات عن المعاملات التي تقوم بها بما في ذلك تفاصيل بطاقات الدفع المستخدمة. قد نقوم بجمع معلومات إضافية فيما يتعلق بمشاركتكم في أي عروض أو المسابقات التي نوفرها و المعلومات التي تقدمها تعطينا تغذية لإستكمال الملف الشخصي الخاص بك. نحن نراقب أيضاً أنماط حركة المرور للعملاء و استخدام الموقع، و التي تمكننا من تحسين الخدمة التي نقدمها. و سوف نقوم بجمع المعلومات الضرورية فقط وذات الصلة لنا لنقدم لك الخدمات المتاحة على الموقع.</p>\r\n\r\n<p>قد نقوم بجمع المعلومات الشخصية التالية عنك مثل:</p>\r\n\r\n<ol>\r\n	<li>الإسم بما في ذلك الإسم الأول وإسم العائلة</li>\r\n	<li>قم الهاتف الجوال وتفاصيل الإتصال</li>\r\n	<li>الملف الشخصي الديموغرافي ( مثل العمر، العنوان)</li>\r\n	<li>البريد الالكتروني</li>\r\n	<li>بيانات البنك الخاص بك</li>\r\n</ol>\r\n\r\n<p>يمكنك إنهاء حسابك في أي وقت. ومع ذلك قد تبقى معلوماتك المخزنة في الأرشيف على خدماتنا حتى بعد الحذف أو إنهاء حسابك.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h5>تفاصيل بطاقة الائتمان</h5>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>نحن لا تبقي أي تفاصيل بطاقة الائتمان في قاعدة البيانات المتوفرة لدينا أو السيرفر. من المهم بالنسبة لك الحماية ضد وصول غير المصرح لهم إلى كلمة المرور الخاصة بك أو الكمبيوتر الخاص بك. تأكد من تسجيل الخروج عند الانتهاء من استخدام جهاز كمبيوتر مشترك.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h5>استخداماتنا لمعلوماتك</h5>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>جميع المعلومات المتاحة على الموقع والي تشمل على الكتب الرقمية المنشورة وجاهزة للبيع، مع إمكانية البحث عن كتاب معين أو موضوع معين</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h5>متى يتم الإفصاح عن المعلومات الخاصة بك</h5>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>لن نستخدم معلوماتك الشخصية لأي غرض آخر سوى إتمام الصفقة معك. نحن لا نؤجر أو نبيع المعلومات الشخصية الخاصة بك، ولن نكشف عن أي معلومات شخصية إلى أي طرف ثالث إلا إذا:</p>\r\n\r\n<ol>\r\n	<li>أن يكون لدينا إذن منك</li>\r\n	<li>لتوفير المنتجات والخدمات التي طلبتها</li>\r\n	<li>للمساعدة في تحقيق ومنع إتخاذ إجراءات تتعلق بأنشطة غير مشروعة وغير قانونية، والمشتبه بهم بالاحتيال، خطراً على سلامة أو أمن أي شخص، انتهاكات شروط استخدام كوتبانه أو للدفاع ضد المطالبات القانونية.</li>\r\n	<li>ظروف خاصة مثل الامتثال لأوامر الإستدعاء، أوامر المحكمة، طلبات / أمر من السلطة القانونية أو وكالات إنفاذ القانون التي تتطلب مثل هذا الكشف</li>\r\n</ol>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h5>ماهي الخيارات المتاحة لك بخصوص جمع و استخدام و توزيع المعلومات الخاصة بك؟</h5>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>تزويد المعلومات الشخصية طوعية تماماً. و ليس مطلوب التسجيل معنا من أجل تصفع موقعنا. و مع ذلك نحن نقدم فقط بعض الخدمات للزوار الغير مسجلين .يمكنك تغيير الإهتمامات الخاصة بك في أي وقت، ووضع في أو خاج التسويق/ الترويج/النشرات الإخبارية. تحتفظ كوتبانه لنفسها بحق أن ترسل لك بعض الاتصالات و الخدمات ذات الصلة، و التي تعتبر جزء من حساب كوتبانه الخاص بك مع سهولة إلغاء الإشتراك. تستطيع القيام بتحديث المعلومات الخاصة بك و تغيير إعدادات حسابك في أي وقت.</p>\r\n\r\n<p>بناء على طلبك، سنقوم بإزالة / منع معلوماتك الشخصية من قاعدة بياناتنا، و بالتالي إلغاء التسجيل. و مع ذلك قد تبقى معلوماتك المخزنة في الأرشيف على خدماتنا حتى بعد الحذف أو إنهاء حسابك.</p>\r\n\r\n<p>إذا كنا نخطط لإستخدام معلوماتك الشخصية لأية أغراض تجارية، سنقوم بإعلامك في الوقت في الوقت الذي نقوم بجمع هذه المعلومات و نسمح لك لإختيار عدم المشاركة بمعلوماتك التي تستخدم لهذه الأغراض.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h5>الحماية</h5>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>للحماية من الضياع أو سوء الاستخدام تعديل المعلومات تحت سيطرتنا، لدينا إجراءات مادية و الكترونية و إدارية مناسبة.</p>\r\n\r\n<p>رغم أننا سوف نعمل على الحفاظ على سرية معلوماتك الشخصية، لايمكن أن يكون الارسال الذي يتم بواسطة شبكة الإنترنت أن يكون آمن تماماً. باستخدام هذا الموقع، فإنك توافق على أننا لا نتحمل أية مسؤولية عن الإفصاح عن المعلومات الخاصة بك بسبب أخطاء في الإرسال أو أعمال غير مصرح بها لأطراف ثالثة.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h5>الوصول أو تغيير معلومات التعريف الشخصية الخاصة بك</h5>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>لحماية الخصوصية والأمن، سوف نتحقق من هويتك قبل منح الوصول أو إجراء تغييرات على معلومات التعريف الشخصية. إذا كت قد سجلت ملفك الشخصي على كوتبانه، يطلب إسم المستخدم الخاص بك و كلمة المرور من أجل الوصول إلى معلومات ملفك الشخصي.</p>\r\n\r\n<p>نحن نحتفظ بالحق في تغيير أو تحديث سياستنا في أي وقت. مثل هذه التغييرات يجب أن تكون فعالة فور إرسالها على هذا الموقع. يمكن تقديم وجهات نظركم، إقتراحاتكم إن وجدت عن طريق تقديم ملاحظاتك باستخدام نموذج اتصل بنا.</p>\r\n\r\n<p>يمكنك الاتصال بنا عن طريق الهاتف: 00905443807388 أو البريد الإلكترونى admin@kutuphanah.com</p>', '<h1 style=\"text-align:center\">Privacy policy</h1>\r\n\r\n<h2>Your account obligations</h2>\r\n\r\n<p>This privacy policy provides the method for collecting your data in the manner used by Kotbaneh. We recommend that you read the privacy policy carefully. By accessing the services offered by kutuphanah.com you consent to the collection and use of your data by kutuphanah.com and certain third party service providers in the manner set forth in this Privacy Policy. If you do not agree to this privacy policy, please do not use this website kutuphanah.com By accepting the privacy policy during registration, you must expressly consent to our use and disclosure of your personal information in accordance with this privacy policy. They are included in this Privacy Policy and are subject to the terms of the User Agreement.</p>\r\n\r\n<p>Protect your privacy with Cotban<br />\r\nQuetpane offers the world&#39;s leading brands and supplies a comprehensive product range that includes digital books. We want you to feel comfortable using our site and feel safe sharing your information with us, so we are very proud of our commitment to protecting your privacy. Please continue to read the following policy to understand how your personal information is handled and to enable you to take full advantage of our site.</p>\r\n\r\n<p>Ensure your privacy with Cotban<br />\r\nKotbaneh is committed not to sell or rent your personal information to any third party (except as provided in this Privacy Policy) without your consent. We and/or authorized third party service providers are authorized to use the personal information you provide to provide you with our services.</p>\r\n\r\n<p>Third Party - Service Providers<br />\r\nWe employ other companies and individuals to perform tasks on our behalf. Examples include directing orders, sending email, analyzing data, providing marketing assistance, providing search results, and processing credit card payments. They have access to personal information necessary to perform their functions, but not used for other purposes.</p>\r\n\r\n<p>Information that may be collected from you<br />\r\nCottban collects the information provided by you in a record along with the information we know about you by visiting our site and using our services. We also collect information about the transactions you make, including details of the payment cards used. We may collect additional information in connection with your participation in any offers or contests that we offer and the information you provide gives us a feed to complete your profile. We also monitor customer traffic and site usage patterns, which enable us to improve our service. We will only collect information that is necessary and relevant for us to provide you with the services available on the Site.</p>\r\n\r\n<p>We may collect the following personal information about you such as:</p>\r\n\r\n<p>Name including first and last name<br />\r\nEnter your mobile phone and contact details<br />\r\nDemographic profile (eg age, address)<br />\r\nE-mail<br />\r\nYour bank data<br />\r\nYou can terminate your account at any time. However, your information stored in archives on our services may remain even after deletion or termination of your account.</p>\r\n\r\n<p>Credit Card Details<br />\r\nWe do not keep any credit card details in our database or server. It is important for you to protect against unauthorized access to your password or your computer. Make sure to sign out when you&#39;re done using a shared computer.</p>\r\n\r\n<p>Our uses of your information<br />\r\nAll information available on the site, which includes digital books published and ready for sale, with the ability to search for a specific book or topic</p>\r\n\r\n<p>When is your information disclosed?<br />\r\nWe will not use your personal information for any purpose other than to complete a transaction with you. We do not rent or sell your personal information, and we will not disclose any personal information to any third party unless:</p>\r\n\r\n<p>To have your permission<br />\r\nTo provide the products and services you requested<br />\r\nTo help investigate and prevent actions related to illegal and illegal activities, suspected fraud, danger to the safety or security of any person, violations of the Terms of Use of Quetpane or to defend against legal claims.<br />\r\nSpecial circumstances such as compliance with subpoenas, court orders, requests/order from a legal authority or law enforcement agencies that require such disclosure<br />\r\nWhat choices are available to you regarding the collection, use and distribution of your information?<br />\r\nProviding personal information is completely voluntary. And registration with us is not required in order to slap our site. However we only provide some services to unregistered visitors. You can change your interests at any time, putting in or out of marketing/promotions/newsletters. Kottbaneh reserves the right to send you certain communications and related services, which are part of your Kottban account with the ease of unsubscribing. You may update your information and change your account settings at any time.</p>\r\n\r\n<p>Upon your request, we will remove/block your personal information from our database, thus canceling your registration. However, your information stored in archives on our services may remain even after deletion or termination of your account.</p>\r\n\r\n<p>If we plan to use your personal information for any commercial purposes, we will notify you at the time we collect that information and allow you to opt-out of your information being used for these purposes.</p>\r\n\r\n<p>protection<br />\r\nTo protect against loss or misuse and modification of information under our control, we have appropriate physical, electronic and administrative procedures in place.</p>\r\n\r\n<p>Although we will endeavor to maintain the confidentiality of your personal information, transmissions via the Internet cannot be completely secure. By using this website, you agree that we have no responsibility for disclosing your information due to transmission errors or unauthorized acts of third parties.</p>\r\n\r\n<p>Accessing or changing your personally identifiable information<br />\r\nTo protect privacy and security, we will verify who you are</p>', '<h1 style=\"text-align:center\">منصة كوتبانه لبيع الكتب العربية الرقمية حول العالم</h1>\r\n\r\n<h3 style=\"text-align:center\"><strong>دليل المؤلف : تعليمات انشاء حساب ونشر الكتب</strong></h3>\r\n\r\n<p dir=\"rtl\">عزيزي&nbsp;المؤلف ( الكاتب ) :</p>\r\n\r\n<p dir=\"rtl\">هل لديك كتب من تأليفك وتريد بيعها بسهولة ؟</p>\r\n\r\n<p dir=\"rtl\">هل تعبت من الاجراءات الطويلة والشروط الصعبة في نشر كتابك&nbsp;؟&nbsp;</p>\r\n\r\n<p dir=\"rtl\">اليك الحل:&nbsp;</p>\r\n\r\n<p dir=\"rtl\">تستطيع الان وبخلال 3 دقائق أن تنشر كتابك ( مجاناً ) على منصة كوتبانه ليصبح متاحة للبيع حول العالم بسهولة وبيسر وتحصل على نسبة&nbsp;60% من المبيعات، يمكنك نشر كتاب أو عدة كتب سواء الكتب الحالية أو الكتب القديمة التي نشرتها سابقا أو المشورة حاليا على منصات اخرى أو دور النشر.</p>\r\n\r\n<p dir=\"rtl\"><strong>شروط النشر هي&nbsp;:</strong></p>\r\n\r\n<p dir=\"rtl\">1-&nbsp;&nbsp;&nbsp;أن يكون كتابك مرخص من بلدك ويحتوي على رقم ( الترخيص/الفسح/الايداع /ردمك)</p>\r\n\r\n<p dir=\"rtl\">2-&nbsp;&nbsp;&nbsp;أن لا يقل كتابك عن 90 صفحة</p>\r\n\r\n<p dir=\"rtl\">3-&nbsp;&nbsp;&nbsp;أن يكون ضمن التصنيفات التالية : الروايات والشعر،&nbsp;الفن والأدب ، التنمية البشرية ، النجاح والثراء ، الصحة النفسية، السعادة وأنماط الحياة، المذاكرة وقوة الحفظ</p>\r\n\r\n<p dir=\"rtl\">واذا حقق كتابك تلك الشروط الاربعة تستطيع أن تنشره الان خلال 3 دقائق فقط يصبح كتابك أونلاين ومتاح للبيع بجميع دول العالم ، عندما تصل أرباحك الى 100 دولار سيتم تحويلها الى حسابك البنكي</p>\r\n\r\n<p dir=\"rtl\">أنت تستطيع أن تتحكم في سعر كتابك وادارة كتبك المنشورة وتستطيع بأي وقت الغاء النشر ،،، موقع كوتبانه يوفر المرونة للمؤلف</p>\r\n\r\n<p dir=\"rtl\"><strong>&nbsp;</strong></p>\r\n\r\n<p dir=\"rtl\"><strong>خطوات انشاء حساب جديد لأول مرة</strong>&nbsp;: هذه الخطوات تقوم فيها مرة واحدة فقط</p>\r\n\r\n<p dir=\"rtl\">ادخل على موقع كوتبانه على الرابط التالي :</p>\r\n\r\n<p dir=\"rtl\"><a href=\"#\" target=\"_blank\">https://kutuphanah.com/</a></p>\r\n\r\n<p dir=\"rtl\">1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;اضغط على زر ( تسجيل الدخول)</p>\r\n\r\n<p dir=\"rtl\">2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;سوف تجد (ليس لديك حساب؟&nbsp;<a href=\"\" target=\"_blank\">سجل الان</a>&nbsp;)&nbsp;اضغط على&nbsp;سجل الان</p>\r\n\r\n<p dir=\"rtl\">3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;قم بتعبئة البيانات المطلوبة واقرأ الشروط ، وافق على الشروط ثم اضغط على زر&nbsp;تسجيل حساب&nbsp;&nbsp;&nbsp;</p>\r\n\r\n<p dir=\"rtl\">تهانينا لقد قمت بتسجيل حساب</p>\r\n\r\n<p dir=\"rtl\"><strong>خطوات نشر كتاب:&nbsp;</strong>&nbsp;</p>\r\n\r\n<p dir=\"rtl\">ادخل على موقع كوتبانه على الرابط التالي :</p>\r\n\r\n<p dir=\"rtl\"><a href=\"\" target=\"_blank\">https://kutuphanah.com/</a>&nbsp;</p>\r\n\r\n<p dir=\"rtl\">1.&nbsp;اضغط على زر ( تسجيل الدخول )</p>\r\n\r\n<p dir=\"rtl\">2.&nbsp;أدخل بريدك الالكتروني وكلمة المرور واضغط على زر&nbsp;تسجيل الدخول</p>\r\n\r\n<p dir=\"rtl\">&nbsp;3.&nbsp; &nbsp; &nbsp;&nbsp;اضغط على زر لوحة التحكم</p>\r\n\r\n<p dir=\"rtl\">4. اضغط على الزر كتب من الشاشة الرئيسية أو اضغط على كلمة (كتب) من القائمة التي على اليمين&nbsp;</p>\r\n\r\n<p dir=\"rtl\">5. اضغط على زر نشر كتاب&nbsp;</p>\r\n\r\n<p dir=\"rtl\">6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ادخل بيانات كتابك وحمل كتابك بصيغة بي دي أف PDF فيصبح جاهز للبيع فورا .</p>\r\n\r\n<p dir=\"rtl\">يمكنك مشاهدة الفيديو التعريفي عن كيفية نشر الكتاب من صفحة كوتبانه على الفيسبوك على الرابط التالي :</p>\r\n\r\n<p dir=\"rtl\">&nbsp;</p>\r\n\r\n<p dir=\"rtl\">&nbsp;</p>\r\n\r\n<p style=\"text-align:right\">للاستفسارات : واتس أب أو مكالمة هاتفية على الرقم 00905443807388</p>', '<h2 style=\"text-align:center\">Kotbaneh platform for selling digital Arabic books around the world</h2>\r\n\r\n<p style=\"text-align:center\"><strong>Author&#39;s guide: Instructions for creating an account and publishing books</strong></p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Kotbaneh platform for selling digital Arabic books around the world<br />\r\nAuthor&#39;s guide: Instructions for creating an account and publishing books<br />\r\nDear author(s):</p>\r\n\r\n<p>span style=&quot;color: rgb(5, 5, 5);&quot;&gt;Do you have books of your own that you want to sell easily?</p>\r\n\r\n<p>Are you tired of the long procedures and difficult conditions in publishing your book?</p>\r\n\r\n<p>Here is the solution:</p>\r\n\r\n<p>Now, within 3 minutes, you can publish your book (for free) on the Cotban platform to make it available for sale around the world easily and easily and get 60% of sales, you can publish a book or several books, whether current books or old books that you previously published or advice currently on other platforms or publishing houses.</p>\r\n\r\n<p>The terms of publication are:</p>\r\n\r\n<p>1- Your book must be licensed from your country and contain the number (license / release / deposit / ISBN)</p>\r\n\r\n<p>2- Your book should not be less than 90 pages</p>\r\n\r\n<p>3- It should be within the following categories: novels and poetry, art and literature, human development, success and wealth, mental health, happiness and lifestyles, study and memorization power</p>\r\n\r\n<p>If your book fulfills these four conditions, you can publish it now in just 3 minutes. Your book will become online and available for sale in all countries of the world. When your profits reach $100, it will be transferred to your bank account.</p>\r\n\r\n<p>You can control the price of your book and manage your published books and you can cancel publication at any time,,, Kotbanah website provides flexibility for the author</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Steps to create a new account for the first time: These steps are only done once</p>\r\n\r\n<p>Enter the Cotban website at the following link:</p>\r\n\r\n<p>https://kutuphanah.com/</p>\r\n\r\n<p>1. Click on the (login) button.</p>\r\n\r\n<p>2. You will find (Do not have an account? Register now) click on Register now</p>\r\n\r\n<p>3. Fill in the required data and read the terms, agree to the terms and then press the Register an account button</p>\r\n\r\n<p>Congratulations, you have registered an account</p>\r\n\r\n<p>Steps to publishing a book:</p>\r\n\r\n<p>Enter the Cotban website at the following link:</p>\r\n\r\n<p>https://kutuphanah.com/</p>\r\n\r\n<p>1. Click on the (login) button.</p>\r\n\r\n<p>2. Enter your email and password and press the login button</p>\r\n\r\n<p>4.&nbsp; click on control&nbsp;pannel buttom&nbsp;</p>\r\n\r\n<p>5. click on books</p>\r\n\r\n<p>6. Enter your book data and download your book in PDF format, and it will be ready for sale immediately.</p>\r\n\r\n<p>You can watch the introductory video on how to publish the book from the Qutabana Facebook page on the following link:</p>\r\n\r\n<p><br />\r\nFor inquiries: WhatsApp or phone call at 00905443807388</p>', '<p dir=\"RTL\"><strong>اتفاقية المؤلف مع المنصة</strong></p>\r\n\r\n<p dir=\"RTL\">يرجى قراءة ما يلي بعناية، &nbsp;شروط الخدمة هذه ، هي اتفاقية ملزمة (&quot;الاتفاقية&quot;) بينك أنت كمؤلف وبين (&quot;المنصة&quot;) وهي منصة لبيع الكتب الالكترونية في كافة دول العالم ذاتية الخدمة بإسم تجاري (كوتبانه) التابعة الى شركة:</p>\r\n\r\n<p dir=\"RTL\"><span dir=\"LTR\">THE ADVANCED STYLE FOR TRAININIG EGITIM VE REHBERLIK HIZ.LTD.STI.</span></p>\r\n\r\n<p dir=\"RTL\">العنوان:&nbsp; تركيا- مدينة اسطنبول</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; Şişli -İstanbul /T&uuml;rkiye,&nbsp;&nbsp;&nbsp; Ergenekon mah. Halaskargazi cad. Kemahlı apt. No:53 ,&nbsp; D:10</p>\r\n\r\n<p dir=\"RTL\">&nbsp;</p>\r\n\r\n<p dir=\"RTL\">قد ترد كلمة (أنت أو المؤلف أو الناشر) لتعبر عن نفس الشخص الذي قام يإنشاء محتوى حصري خاص به ويكون على شكل كتاب رقمي بصيغة <span dir=\"LTR\">PDF</span> ويشار اليه هنا بكلمة (العمل)، &nbsp;ويريد أن يكون هو بنفسه الناشر لعمله والبائع لعمله من خلال المنصة.</p>\r\n\r\n<p dir=\"RTL\">أنت تعتبر المؤلف والناشر لعملك وبالتالي أنت تمتلك حقوق ومسئولية التأليف والنشر وحقوق الملكية الفكرية بالكامل، المنصة ليست دار نشر وانما منصة لبيع الكتب الرقمية فقط، أي أن المنصة هي الوسيط بين البائع وهو أنت المؤلف والناشر لعملك وبين المشتري وهو الشخص الذي يقوم بدفع مبلغ مقابل الحصول على العمل المنشور على المنصة، بحيث يحصل المشتري على الكتاب الرقمي ويستطيع تحميل الكتاب على جهازه الخاص.</p>\r\n\r\n<p dir=\"RTL\">المنصة تحصل على عمولة البيع البالغة 40% من المبيعات، والمؤلف يحصل على 60% من المبيعات الخاصة بعمله، وذلك ضمن هذة الاتفاقية غير الحصرية بمعنى أنك تستطيع أن تنشر عملك بمواقع اخرى بحيث لا يقل سعر الكتاب بالمواقع الاخرى عن السعر الذي تحدده أنت في المنصة، وتقوم المنصة بتحويل المبلغ الخاص بالمؤلف مرة كل شهر بحيث لا يقل المبلغ المستحق عن 100 دولار امريكي، واذا كان المبلغ المستحق أقل من 100 دولار يتم رصد المبلغ الى الموعد القادم للتحويل، وباعتبار ان جميع الكتب معروضه للبيع بعملة الدولار الامريكي فان المؤلف يقبل باستلام المبلغ على حسابه بالبنك&nbsp; سواء بنفس العملة او بعمله اخرى وبسعر الصرف الذي يحدده البنك، وكما يقبل المؤلف أي خصومات يخصمها البنك أو الضرائب الحكومية المفروضه على المبلغ ان وجدت.</p>\r\n\r\n<p dir=\"RTL\">&nbsp;أنت بنفسك تستطيع أن تقوم بنشر عملك على المنصة واتاحته للبيع حول العالم، وأنت مسئول عن جميع البيانات التي تقوم بادخالها على المنصة، وأيضا تتيح لك المنصة أن تنشر العمل أو تزيل العمل أو تعدل على العمل بأي وقت تشاء.</p>\r\n\r\n<p dir=\"RTL\">يتعهد المؤلف أن المنصة ليست الناشر لصاحب حقوق التأليف والنشر وانما فقط لتسويق وبيع الكتب الرقمية، وأن صاحب العمل هو الناشر لعمله الخاص والذي يجب أن يكون مرخص ومسجل لدى الجهات الحكومية المختصة وبالتالي يكون المؤلف مسئولا بالكامل عن نشر العمل الحصري الخاص به ومسئول عن محتوى العمل بالكامل. وأنك تتعهد وتؤكد أنه لا يوجد جانب من عملك ينتهك &nbsp;حقوق شخص أو جهة أو كيان آخر. في دورك كمؤلف و ناشر، فأنت تدرك أنك ناشر لعملك، وبالتالي أنت مسؤول عن كتابة وتحرير وتنسيق وتصميم غلاف كتابك، وعن تحميل كتابك إلى المنصة ، وإدارة البيانات الوصفية لكتابك.</p>\r\n\r\n<p dir=\"RTL\">يمنح المؤلف بموجبه ويتنازل إلى المنصة الحق غير الحصري في بيع عمله في جميع أنحاء العالم (حقوق البيع والتوزيع الرقمي)، &nbsp;ويتحمل المؤلف أية مسئولية تتعلق بحقوق الملكية الفكرية العائدة لقيام المنصة بتوزيع الكتاب الكترونياً، ويلتزم المؤلف بالتعويض عن كل ضرر يلحق بالمنصة من جراء قيام طرف ثالث بالمطالبة بأي مبالغ أو أضرار تتعلق بحق المنصة في بيع العمل الكترونياً حول العالم، ويكون بالتالي المؤلف ملتزماً بالتعويض عن كل ضرر يلحق بالمنصة من جراء قيام أي طرف ثالث بالمطالبة بأية مبالغ أو أضرار تتعلق بمضمون العمل. يتحمل المؤلف مسئولية ترخيص الكتاب &nbsp;من الجهات الحكومية المختصة ولا يجوز له أن ينشر أي عمل غير مرخص على المنصة، واذا قام بنشر عمل غير مرخص يتحمل المؤلف كافة المسئولية القانونية جراء ذلك. وتقع على عاتق المؤلف مسؤولية وضع إشعار حقوق الطبع والنشر على صفحة حقوق الطبع والنشر أو أي مكان بارز آخر في العمل الذي يقوم بنشره على المنصة.</p>\r\n\r\n<p dir=\"RTL\">تتيح المنصة للمؤلف امكانية مراقبة ومتابعة الكتب التي تباع عن طريق المنصة أول بأول وكما تتيح أيضا امكانية التحكم بالعمل المنشور من حيث الغاء العمل أو تغيير الاصدار مع امكانية تغيير بيانات الكتاب كالغلاف والمقدمة والسعر بحيث لا يقل سعر الكتاب عن 2 دولار امريكي ولا يزيد عن 9 دولار امريكي، ويحق للمؤلف أن ينشر عمله أو يزيله بأي وقت يشاء دون الالتزام بمدة معينة.</p>\r\n\r\n<p dir=\"RTL\">المنصة غير مسئولة عن الكتاب الذي تم بيعه للمشتري من حيث اعادة بيعه أو نشره بمواقع أخرى، فالكتاب الرقمي يمكن تداوله بسهولة بين الاشخاص وهذا خارج عن نطاق وسيطرة ومسئولية المنصة. واذا قام المشتري بنشر الكتاب الخاص بالمؤلف بمواقع اخرى فيستطيع المؤلف أن يضع المسئولية على المشتري مباشرة دون الرجوع الى المنصة.</p>\r\n\r\n<p dir=\"RTL\">تتعهد المنصة بالمحافظه على سرية المعلومات والبيانات المعطاه له بما في ذلك نصوص الكتاب بالكامل ولا يحق للمنصة استخدام العمل في غير محل الاتفاقية، كما لا يحق للمنصة اجراء أية تغييرات على محتوى العمل.</p>\r\n\r\n<p dir=\"RTL\">يحق للمنصة ازالة أي عمل من المنصة اذا كان العمل يخالف القانون من حيث المحتوى أو اذا كان العمل قديم ولا يوجد عليه طلب حسب تقدير المنصة، وكما يحق للمنصة ازالة أو تعليق كتاب عن البيع على المنصة اذا كان العمل يخالف أية شروط وارده ضمن هذه الشروط، أو يخالف أي جهة ثالثة من ناحية قانونية.</p>\r\n\r\n<p dir=\"RTL\">اذا تم اكتشاف أن العمل أو جزء منه ليس حق للمؤلف ، فيحق للمنصة بمطالبة المؤلف &nbsp;بجميع المبالغ التي حصل عليها من هذا العمل، وحجز جميع المبالغ المعلقة والتي لم يتم تحويلها بعد، وازالة العمل من الموقع،&nbsp; وبتحميل كافة المسئولية القانونية الى المؤلف.</p>\r\n\r\n<p dir=\"RTL\">&nbsp;</p>\r\n\r\n<p dir=\"RTL\">يحق للمنصة التغيير على هذه الشروط (الاتفاقية) بأي وقت، وبحيث تكون هذه الشروط (الاتفاقية) متاحة دائماً للمؤلف على المنصة ببوابة المؤلف، وسوف يتم وضع تاريخ أخر تعديل بنهاية الاتفاقية حتى يستطيع المؤلف أن يتابع التعديلات المحتملة على هذه الاتفاقية، ويحق للمؤلف أن يقوم بالغاء نشر جميع أعماله من المنصة اذا لم تناسبه الشروط الجديدة، واذا استمر المؤلف بالنشر فهذا يعني انه موافق على الاستمرار بالشروط الجديدة. سوف نعمل جاهدين بأن لا نغير بالشروط الا اذا اضطررنا بذلك فقط.</p>\r\n\r\n<p dir=\"RTL\">كل نزاع ينشأ حول تفسير هذه الشروط أو تنفيذ هذه الشروط يكون من اختصاص محاكم دولة تركيا، ويكون القانون التركي هو القانون الذي يحكم هذه الشروط ( الاتفاقية ) وذلك لان مقر ترخيص المنصة في تركيا.</p>\r\n\r\n<p dir=\"RTL\">&nbsp;</p>\r\n\r\n<p dir=\"RTL\">&nbsp;تاريخ اخر تعديل: 4/7/2021</p>\r\n\r\n<p dir=\"RTL\">&nbsp;</p>', '<p>vever</p>', '<h1 style=\"text-align:center\">سياسة الإرجاع</h1>\r\n\r\n<p style=\"text-align:right\">اذا كان هناك خطأ في طلبك كأن يكون عنوان الكتاب الذي اشتريته مختلف عن المحتوى ، وفي هذه الحالة نطلب منك أن تتواصل معنا وأن تقدم طلب استرداد للمبلغ أو طلب استبدال بكتاب اخر.</p>\r\n\r\n<p style=\"text-align:right\">لتقديم طلب استرداد أو إرجاع لطلب تم تقديمه من خلال كوتبانه، ستحتاج إلى الاتصال بـ كوتبانه عبر البريد الإلكتروني على admin@kutuphanah.com أو عبر الهاتف على 00905443807388&nbsp; أو عن طريق خدمة البلاغات.</p>\r\n\r\n<p style=\"text-align:right\">يتم قبول طلبات الاسترداد أو الإرجاع أو الاستبدال حتى 30 يومًا من تاريخ تقديم الطلب مع كوتبانه. قد تمنح كوتبانه تمديدات لهذه الفترة لبعض الحالات الخاصة وفقًا لتقديرها.</p>\r\n\r\n<p style=\"text-align:right\">إذا تم منح طلب الاسترداد بواسطة كوتبانه ، فسيتم رد المدفوعات على النحو التالي:</p>\r\n\r\n<ol>\r\n	<li style=\"text-align:right\">سيتم رد مدفوعات بطاقات الائتمان / الخصم في غضون يوم الى سبعة أيام &nbsp;عمل؛</li>\r\n	<li style=\"text-align:right\">سيتم رد مدفوعات PayPal في غضون يوم الى سبعة أيام عمل ؛</li>\r\n	<li style=\"text-align:right\">سيتم رد أموالك ذا كانت تزيد عن 30 دولار عن طرق الدفع الأخرى ما بين خمسة (5) إلى سبعة (10) أيام.</li>\r\n</ol>\r\n\r\n<h1 style=\"text-align:right\">سياسة التوصيل</h1>\r\n\r\n<p style=\"text-align:right\">عند استلام طلبك ، سيُطلب منك إما بدء التنزيل على الفور أو ستتلقى بريدًا إلكترونيًا منا يحتوي على إرشادات لإكمال التنزيل. إذا طُلب منك بدء التنزيل على الفور، فإن إكمال التنزيل سيعني تسليمك للعنصر (العناصر) الذي اشتريته</p>\r\n\r\n<p style=\"text-align:right\">في حالة عدم قدرتك على تنزيل العنصر (العناصر) التي تشتريها أو لم تستلم بريدًا إلكترونيًا منا يحتوي على إرشادات لإكمال التنزيل ، يجب عليك الاتصال بنا في غضون 5 أيام من تاريخ طلبك. إذا لم تتصل بنا في غضون 5 أيام من تاريخ طلبك ، فسيتم اعتبار العنصر (العناصر) الذي اشتريته مستلمًا وتم تنزيله وتسليمه إليك.</p>', '<h2 style=\"text-align:center\"><strong>Return Policy</strong></h2>\r\n\r\n<p>If there is an error in your order, such as the title of the book you purchased is different from the content, and in this case we ask you to contact us and submit a request for a refund or a replacement request with another book.</p>\r\n\r\n<p>To submit a refund or return request for an order placed through Kotban, you will need to contact Kotubane via email at admin@kutuphanah.com, by phone at 00905443807388, or via the reporting service.</p>\r\n\r\n<p>Refund, return or exchange requests are accepted up to 30 days from the date of placing the order with Quetpane. Quebec may grant extensions to this period for some special cases at its discretion.</p>\r\n\r\n<p>If the refund request is granted by Cotpan, then the payments will be refunded as follows:</p>\r\n\r\n<p>Credit/debit card payments will be refunded within one to seven business days;<br />\r\nPayPal payments will be refunded within one to seven business days;<br />\r\nYour money over $30 for other payment methods will be refunded within five (5) to seven (10) days.<br />\r\nDelivery Policy<br />\r\nUpon receipt of your order, you will either be asked to start the download immediately or you will receive an email from us with instructions to complete the download. If you are prompted to start the download immediately, completing the download will mean that you will be delivered the item(s) you purchased</p>\r\n\r\n<p>In the event that you are unable to download the item(s) you purchase or have not received an email from us with instructions to complete the download, you must contact us within 5 days of your order. If you do not contact us within 5 days of your order date, the item(s) you purchased will be considered received, downloaded, and delivered to you.</p>', 44, '1627564525.jpeg', 40, 9, 2, NULL, '2021-09-11 08:57:20');

-- --------------------------------------------------------

--
-- Table structure for table `countries`
--

CREATE TABLE `countries` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `iso` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `nicename` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `iso3` varchar(10) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `numcode` varchar(10) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `phonecode` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `countries`
--

INSERT INTO `countries` (`id`, `iso`, `nicename`, `name`, `iso3`, `numcode`, `phonecode`, `created_at`, `updated_at`) VALUES
(14, 'AF', 'AFGHANISTAN', '{\"ar\":\"أفغانستان\",\"en\":\"Afghanistan\"}', 'AFG', '4', '93', NULL, NULL),
(15, 'AL', 'ALBANIA', '{\"ar\":\"ألبانيا\",\"en\":\"Albania\"}', 'ALB', '8', '355', NULL, NULL),
(16, 'DZ', 'ALGERIA', '{\"ar\":\"الجزائر\",\"en\":\"Algeria\"}', 'DZA', '12', '213', NULL, NULL),
(17, 'AS', 'AMERICAN SAMOA', '{\"ar\":\"ساموا-الأمريكي\",\"en\":\"American Samoa\"}', 'ASM', '16', '1684', NULL, NULL),
(18, 'AD', 'ANDORRA', '{\"ar\":\"أندورا\",\"en\":\"Andorra\"}', 'AND', '20', '376', NULL, NULL),
(19, 'AO', 'ANGOLA', '{\"ar\":\"أنغولا\",\"en\":\"Angola\"}', 'AGO', '24', '244', NULL, NULL),
(20, 'AI', 'ANGUILLA', '{\"ar\":\"أنغويلا\",\"en\":\"Anguilla\"}', 'AIA', '660', '1264', NULL, NULL),
(21, 'AQ', 'ANTARCTICA', '{\"ar\":\"أنتاركتيكا\",\"en\":\"Antarctica\"}', NULL, NULL, '0', NULL, NULL),
(22, 'AG', 'ANTIGUA AND BARBUDA', '{\"ar\":\"أنتيغوا وبربودا\",\"en\":\"Antigua and Barbuda\"}', 'ATG', '28', '1268', NULL, NULL),
(23, 'AR', 'ARGENTINA', '{\"ar\":\"الأرجنتين\",\"en\":\"Argentina\"}', 'ARG', '32', '54', NULL, NULL),
(24, 'AM', 'ARMENIA', '{\"ar\":\"أرمينيا\",\"en\":\"Armenia\"}', 'ARM', '51', '374', NULL, NULL),
(25, 'AW', 'ARUBA', '{\"ar\":\"أروبه\",\"en\":\"Aruba\"}', 'ABW', '533', '297', NULL, NULL),
(26, 'AU', 'AUSTRALIA', '{\"ar\":\"أستراليا\",\"en\":\"Australia\"}', 'AUS', '36', '61', NULL, NULL),
(27, 'AT', 'AUSTRIA', '{\"ar\":\"أستراليا\",\"en\":\"Austria\"}', 'AUT', '40', '43', NULL, NULL),
(28, 'AZ', 'AZERBAIJAN', '{\"ar\":\"أذربيجان\",\"en\":\"Azerbaijan\"}', 'AZE', '31', '994', NULL, NULL),
(29, 'BS', 'BAHAMAS', '{\"ar\":\"الباهاماس\",\"en\":\"Bahamas\"}', 'BHS', '44', '1242', NULL, NULL),
(30, 'BH', 'BAHRAIN', '{\"ar\":\"البحرين\",\"en\":\"Bahrain\"}', 'BHR', '48', '973', NULL, NULL),
(31, 'BD', 'BANGLADESH', '{\"ar\":\"بنغلاديش\",\"en\":\"Bangladesh\"}', 'BGD', '50', '880', NULL, NULL),
(32, 'BB', 'BARBADOS', '{\"ar\":\"بربادوس\",\"en\":\"Barbados\"}', 'BRB', '52', '1246', NULL, NULL),
(33, 'BY', 'BELARUS', '{\"ar\":\"روسيا البيضاء\",\"en\":\"Belarus\"}', 'BLR', '112', '375', NULL, NULL),
(34, 'BE', 'BELGIUM', '{\"ar\":\"بلجيكا\",\"en\":\"Belgium\"}', 'BEL', '56', '32', NULL, NULL),
(35, 'BZ', 'BELIZE', '{\"ar\":\"بيليز\",\"en\":\"Belize\"}', 'BLZ', '84', '501', NULL, NULL),
(36, 'BJ', 'BENIN', '{\"ar\":\"بنين\",\"en\":\"Benin\"}', 'BEN', '204', '229', NULL, NULL),
(37, 'BM', 'BERMUDA', '{\"ar\":\"جزر برمودا\",\"en\":\"Bermuda\"}', 'BMU', '60', '1441', NULL, NULL),
(38, 'BT', 'BHUTAN', '{\"ar\":\"بوتان\",\"en\":\"Bhutan\"}', 'BTN', '64', '975', NULL, NULL),
(39, 'BO', 'BOLIVIA', '{\"ar\":\"بوليفيا\",\"en\":\"Bolivia\"}', 'BOL', '68', '591', NULL, NULL),
(40, 'BA', 'BOSNIA AND HERZEGOVINA', '{\"ar\":\"البوسنة و الهرسك\",\"en\":\"Bosnia and Herzegovina\"}', 'BIH', '70', '387', NULL, NULL),
(41, 'BW', 'BOTSWANA', '{\"ar\":\"بوتسوانا\",\"en\":\"Botswana\"}', 'BWA', '72', '267', NULL, NULL),
(42, 'BV', 'BOUVET ISLAND', '{\"ar\":\"بوتسوانا\",\"en\":\"Bouvet Island\"}', NULL, NULL, '0', NULL, NULL),
(43, 'BR', 'BRAZIL', '{\"ar\":\"البرازيل\",\"en\":\"Brazil\"}', 'BRA', '76', '55', NULL, NULL),
(44, 'IO', 'BRITISH INDIAN OCEAN TERRITORY', '{\"ar\":\"إقليم المحيط الهندي البريطاني\",\"en\":\"British Indian Ocean Territory\"}', NULL, NULL, '246', NULL, NULL),
(45, 'BN', 'BRUNEI DARUSSALAM', '{\"ar\":\"بروني\",\"en\":\"Brunei Darussalam\"}', 'BRN', '96', '673', NULL, NULL),
(46, 'BG', 'BULGARIA', '{\"ar\":\"بلغاريا\",\"en\":\"Bulgaria\"}', 'BGR', '100', '359', NULL, NULL),
(47, 'BF', 'BURKINA FASO', '{\"ar\":\"وركينا فاسو\",\"en\":\"Burkina Faso\"}', 'BFA', '854', '226', NULL, NULL),
(48, 'BI', 'BURUNDI', '{\"ar\":\"بوروندي\",\"en\":\"Burundi\"}', 'BDI', '108', '257', NULL, NULL),
(49, 'KH', 'CAMBODIA', '{\"ar\":\"كمبوديا\",\"en\":\"Cambodia\"}', 'KHM', '116', '855', NULL, NULL),
(50, 'CM', 'CAMEROON', '{\"ar\":\"كاميرون\",\"en\":\"Cameroon\"}', 'CMR', '120', '237', NULL, NULL),
(51, 'CA', 'CANADA', '{\"ar\":\"كندا\",\"en\":\"Canada\"}', 'CAN', '124', '1', NULL, NULL),
(52, 'CV', 'CAPE VERDE', '{\"ar\":\"الرأس الأخضر\",\"en\":\"Cape Verde\"}', 'CPV', '132', '238', NULL, NULL),
(53, 'KY', 'CAYMAN ISLANDS', '{\"ar\":\"جزر كايمان\",\"en\":\"Cayman Islands\"}', 'CYM', '136', '1345', NULL, NULL),
(54, 'CF', 'CENTRAL AFRICAN REPUBLIC', '{\"ar\":\"جمهورية أفريقيا الوسطى\",\"en\":\"Central African Republic\"}', 'CAF', '140', '236', NULL, NULL),
(55, 'TD', 'CHAD', '{\"ar\":\"تشاد\",\"en\":\"Chad\"}', 'TCD', '148', '235', NULL, NULL),
(56, 'CL', 'CHILE', '{\"ar\":\"شيلي\",\"en\":\"Chile\"}', 'CHL', '152', '56', NULL, NULL),
(57, 'CN', 'CHINA', '{\"ar\":\"الصين\",\"en\":\"China\"}', 'CHN', '156', '86', NULL, NULL),
(58, 'CX', '', '{\"ar\":\"جزيرة عيد الميلاد\",\"en\":\"CHRISTMAS ISLAND\"}', NULL, NULL, '61', NULL, NULL),
(59, 'CC', 'COCOS (KEELING) ISLANDS', '{\"ar\":\"جزر كوكوس\",\"en\":\"Cocos (Keeling) Islands\"}', NULL, NULL, '672', NULL, NULL),
(60, 'CO', 'COLOMBIA', '{\"ar\":\"كولومبيا\",\"en\":\"Colombia\"}', 'COL', '170', '57', NULL, NULL),
(61, 'KM', 'COMOROS', '{\"ar\":\"جزر القمر\",\"en\":\"Comoros\"}', 'COM', '174', '269', NULL, NULL),
(62, 'CG', 'CONGO', '{\"ar\":\"الكونغو\",\"en\":\"Congo\"}', 'COG', '178', '242', NULL, NULL),
(63, 'CK', 'COOK ISLANDS', '{\"ar\":\"جزر كوك\",\"en\":\"Cook Islands\"}', 'COK', '184', '682', NULL, NULL),
(64, 'CR', 'COSTA RICA', '{\"ar\":\"كوستاريكا\",\"en\":\"Costa Rica\"}', 'CRI', '188', '506', NULL, NULL),
(65, 'HR', 'CROATIA', '{\"ar\":\"كرواتيا\",\"en\":\"Croatia\"}', 'HRV', '191', '385', NULL, NULL),
(66, 'CU', 'CUBA', '{\"ar\":\"كوبا\",\"en\":\"Cuba\"}', 'CUB', '192', '53', NULL, NULL),
(67, 'CY', 'CYPRUS', '{\"ar\":\"قبرص\",\"en\":\"Cyprus\"}', 'CYP', '196', '357', NULL, NULL),
(68, 'CZ', 'CZECH REPUBLIC', '{\"ar\":\"الجمهورية التشيكية\",\"en\":\"Czech Republic\"}', 'CZE', '203', '420', NULL, NULL),
(69, 'DK', 'DENMARK', '{\"ar\":\"الدانمارك\",\"en\":\"Denmark\"}', 'DNK', '208', '45', NULL, NULL),
(70, 'DJ', 'DJIBOUTI', '{\"ar\":\"جيبوتي\",\"en\":\"Djibouti\"}', 'DJI', '262', '253', NULL, NULL),
(71, 'DM', 'DOMINICA', '{\"ar\":\"دومينيكا\",\"en\":\"Dominica\"}', 'DMA', '212', '1767', NULL, NULL),
(72, 'DO', 'DOMINICAN REPUBLIC', '{\"ar\":\"لجمهورية الدومينيكية\",\"en\":\"Dominican Republic\"}', 'DOM', '214', '1809', NULL, NULL),
(73, 'EC', 'ECUADOR', '{\"ar\":\"إكوادور\",\"en\":\"Ecuador\"}', 'ECU', '218', '593', NULL, NULL),
(74, 'EG', 'EGYPT', '{\"ar\":\"مصر\",\"en\":\"Egypt\"}', 'EGY', '818', '20', NULL, NULL),
(75, 'SV', 'EL SALVADOR', '{\"ar\":\"إلسلفادور\",\"en\":\"El Salvador\"}', 'SLV', '222', '503', NULL, NULL),
(76, 'GQ', 'EQUATORIAL GUINEA', '{\"ar\":\"غينيا الاستوائي\",\"en\":\"Equatorial Guinea\"}', 'GNQ', '226', '240', NULL, NULL),
(77, 'ER', 'ERITREA', '{\"ar\":\"إريتريا\",\"en\":\"Eritrea\"}', 'ERI', '232', '291', NULL, NULL),
(78, 'EE', 'ESTONIA', '{\"ar\":\"استونيا\",\"en\":\"Estonia\"}', 'EST', '233', '372', NULL, NULL),
(79, 'ET', 'ETHIOPIA', '{\"ar\":\"أثيوبيا\",\"en\":\"Ethiopia\"}', 'ETH', '231', '251', NULL, NULL),
(80, 'FK', 'FALKLAND ISLANDS (MALVINAS)', '{\"ar\":\"جزر فوكلاند\",\"en\":\"Falkland Islands (Malvinas)\"}', 'FLK', '238', '500', NULL, NULL),
(81, 'FO', 'FAROE ISLANDS', '{\"ar\":\"جزر فارو\",\"en\":\"Faroe Islands\"}', 'FRO', '234', '298', NULL, NULL),
(82, 'FJ', 'FIJI', '{\"ar\":\"فيجي\",\"en\":\"Fiji\"}', 'FJI', '242', '679', NULL, NULL),
(83, 'FI', 'FINLAND', '{\"ar\":\"فنلندا\",\"en\":\"Finland\"}', 'FIN', '246', '358', NULL, NULL),
(84, 'GF', 'FRENCH GUIANA', '{\"ar\":\"غويانا الفرنسية\",\"en\":\"French Guiana\"}', 'GUF', '254', '594', NULL, NULL),
(85, 'PF', 'FRENCH POLYNESIA', '{\"ar\":\"بولينيزيا الفرنسية\",\"en\":\"French Polynesia\"}', 'PYF', '258', '689', NULL, NULL),
(86, 'GA', 'GABON', '{\"ar\":\"الغابون\",\"en\":\"Gabon\"}', 'GAB', '266', '241', NULL, NULL),
(87, 'GM', 'GAMBIA', '{\"ar\":\"غامبيا\",\"en\":\"Gambia\"}', 'GMB', '270', '220', NULL, NULL),
(88, 'GE', 'GEORGIA', '{\"ar\":\"جيورجيا\",\"en\":\"Georgia\"}', 'GEO', '268', '995', NULL, NULL),
(89, 'DE', 'GERMANY', '{\"ar\":\"ألمانيا\",\"en\":\"Germany\"}', 'DEU', '276', '49', NULL, NULL),
(90, 'GH', 'GHANA', '{\"ar\":\"غانا\",\"en\":\"Ghana\"}', 'GHA', '288', '233', NULL, NULL),
(91, 'GI', 'GIBRALTAR', '{\"ar\":\"جبل طارق\",\"en\":\"Gibraltar\"}', 'GIB', '292', '350', NULL, NULL),
(92, 'GR', 'GREECE', '{\"ar\":\"اليونان\",\"en\":\"Greece\"}', 'GRC', '300', '30', NULL, NULL),
(93, 'GL', 'GREENLAND', '{\"ar\":\"جرينلاند\",\"en\":\"Greenland\"}', 'GRL', '304', '299', NULL, NULL),
(94, 'GD', 'GRENADA', '{\"ar\":\"غرينادا\",\"en\":\"Grenada\"}', 'GRD', '308', '1473', NULL, NULL),
(95, 'GP', 'GUADELOUPE', '{\"ar\":\"جزر جوادلوب\",\"en\":\"Guadeloupe\"}', 'GLP', '312', '590', NULL, NULL),
(96, 'GU', 'GUAM', '{\"ar\":\"جوام\",\"en\":\"Guam\"}', 'GUM', '316', '1671', NULL, NULL),
(97, 'GT', 'GUATEMALA', '{\"ar\":\"غواتيمال\",\"en\":\"Guatemala\"}', 'GTM', '320', '502', NULL, NULL),
(98, 'GN', 'GUINEA', '{\"ar\":\"غينيا\",\"en\":\"Guinea\"}', 'GIN', '324', '224', NULL, NULL),
(99, 'GW', 'GUINEA-BISSAU', '{\"ar\":\"غينيا-بيساو\",\"en\":\"Guinea-Bissau\"}', 'GNB', '624', '245', NULL, NULL),
(100, 'GY', 'GUYANA', '{\"ar\":\"غيانا\",\"en\":\"Guyana\"}', 'GUY', '328', '592', NULL, NULL),
(101, 'HT', 'HAITI', '{\"ar\":\"هايتي\",\"en\":\"Haiti\"}', 'HTI', '332', '509', NULL, NULL),
(102, 'HM', 'HEARD ISLAND AND MCDONALD ISLANDS', '{\"ar\":\"جزيرة هيرد وجزر ماكدونالد\",\"en\":\"Heard Island and Mcdonald Islands\"}', NULL, NULL, '0', NULL, NULL),
(103, 'HN', 'HONDURAS', '{\"ar\":\"هندوراس\",\"en\":\"Honduras\"}', 'HND', '340', '504', NULL, NULL),
(104, 'HK', 'HONG KONG', '{\"ar\":\"هونغ كونغ\",\"en\":\"Hong Kong\"}', 'HKG', '344', '852', NULL, NULL),
(105, 'HU', 'HUNGARY', '{\"ar\":\"المجر\",\"en\":\"Hungary\"}', 'HUN', '348', '36', NULL, NULL),
(106, 'IS', 'ICELAND', '{\"ar\":\"آيسلندا\",\"en\":\"Iceland\"}', 'ISL', '352', '354', NULL, NULL),
(107, 'IN', 'INDIA', '{\"ar\":\"الهند\",\"en\":\"India\"}', 'IND', '356', '91', NULL, NULL),
(108, 'ID', 'INDONESIA', '{\"ar\":\"أندونيسيا\",\"en\":\"Indonesia\"}', 'IDN', '360', '62', NULL, NULL),
(109, 'IQ', 'IRAQ', '{\"ar\":\"العراق\",\"en\":\"Iraq\"}', 'IRQ', '368', '964', NULL, NULL),
(110, 'IE', 'IRELAND', '{\"ar\":\"إيرلندا\",\"en\":\"Ireland\"}', 'IRL', '372', '353', NULL, NULL),
(111, 'IT', 'ITALY', '{\"ar\":\"إيطاليا\",\"en\":\"Italy\"}', 'ITA', '380', '39', NULL, NULL),
(112, 'JM', 'JAMAICA', '{\"ar\":\"جمايكا\",\"en\":\"Jamaica\"}', 'JAM', '388', '1876', NULL, NULL),
(113, 'JP', 'JAPAN', '{\"ar\":\"اليابان\",\"en\":\"Japan\"}', 'JPN', '392', '81', NULL, NULL),
(114, 'JO', 'JORDAN', '{\"ar\":\"الأردن\",\"en\":\"Jordan\"}', 'JOR', '400', '962', NULL, NULL),
(115, 'KZ', 'KAZAKHSTAN', '{\"ar\":\"كازاخستان\",\"en\":\"Kazakhstan\"}', 'KAZ', '398', '7', NULL, NULL),
(116, 'KE', 'KENYA', '{\"ar\":\"كينيا\",\"en\":\"Kenya\"}', 'KEN', '404', '254', NULL, NULL),
(117, 'KI', 'KIRIBATI', '{\"ar\":\"كيريباتي\",\"en\":\"Kiribati\"}', 'KIR', '296', '686', NULL, NULL),
(118, 'KP', 'KOREA, DEMOCRATIC PEOPLE\'S REPUBLIC OF', '{\"ar\":\"كوريا الشمالية\",\"en\":\"Korea(North Korea)\"}', 'PRK', '408', '850', NULL, NULL),
(119, 'KR', 'KOREA, REPUBLIC OF', '{\"ar\":\"كوريا الجنوبية\",\"en\":\"Korea(South Korea)\"}', 'KOR', '410', '82', NULL, NULL),
(120, 'KW', 'KUWAIT', '{\"ar\":\"الكويت\",\"en\":\"Kuwait\"}', 'KWT', '414', '965', NULL, NULL),
(121, 'KG', 'KYRGYZSTAN', '{\"ar\":\"قيرغيزستان\",\"en\":\"Kyrgyzstan\"}', 'KGZ', '417', '996', NULL, NULL),
(122, 'LA', 'LAO PEOPLE\'S DEMOCRATIC REPUBLIC', '{\"ar\":\"جمهورية أفريقيا الوسطى\",\"en\":\"Republic\"}', 'LAO', '418', '856', NULL, NULL),
(123, 'LV', 'LATVIA', '{\"ar\":\"لاتفيا\",\"en\":\"Latvia\"}', 'LVA', '428', '371', NULL, NULL),
(124, 'LB', 'LEBANON', '{\"ar\":\"لبنان\",\"en\":\"Lebanon\"}', 'LBN', '422', '961', NULL, NULL),
(125, 'LS', 'LESOTHO', '{\"ar\":\"ليسوتو\",\"en\":\"Lesotho\"}', 'LSO', '426', '266', NULL, NULL),
(126, 'LR', 'LIBERIA', '{\"ar\":\"ليبيريا\",\"en\":\"Liberia\"}', 'LBR', '430', '231', NULL, NULL),
(127, 'LY', 'LIBYAN ARAB JAMAHIRIYA', '{\"ar\":\"ليبيا\",\"en\":\"Libyan\"}', 'LBY', '434', '218', NULL, NULL),
(128, 'LI', 'LIECHTENSTEIN', '{\"ar\":\"ليختنشتين\",\"en\":\"Liechtenstein\"}', 'LIE', '438', '423', NULL, NULL),
(129, 'LT', 'LITHUANIA', '{\"ar\":\"لتوانيا\",\"en\":\"Lithuania\"}', 'LTU', '440', '370', NULL, NULL),
(130, 'LU', 'LUXEMBOURG', '{\"ar\":\"لوكسمبورغ\",\"en\":\"Luxembourg\"}', 'LUX', '442', '352', NULL, NULL),
(131, 'MO', 'MACAO', '{\"ar\":\"ماكاو\",\"en\":\"Macao\"}', 'MAC', '446', '853', NULL, NULL),
(132, 'MG', 'MADAGASCAR', '{\"ar\":\"مدغشقر\",\"en\":\"Madagascar\"}', 'MDG', '450', '261', NULL, NULL),
(133, 'MW', 'MALAWI', '{\"ar\":\"مالاوي\",\"en\":\"Malawi\"}', 'MWI', '454', '265', NULL, NULL),
(134, 'MY', 'MALAYSIA', '{\"ar\":\"ماليزيا\",\"en\":\"Malaysia\"}', 'MYS', '458', '60', NULL, NULL),
(135, 'MV', 'MALDIVES', '{\"ar\":\"المالديف\",\"en\":\"Maldives\"}', 'MDV', '462', '960', NULL, NULL),
(136, 'ML', 'MALI', '{\"ar\":\"مالي\",\"en\":\"Mali\"}', 'MLI', '466', '223', NULL, NULL),
(137, 'MT', 'MALTA', '{\"ar\":\"مالطا\",\"en\":\"Malta\"}', 'MLT', '470', '356', NULL, NULL),
(138, 'MH', 'MARSHALL ISLANDS', '{\"ar\":\"جزر مارشال\",\"en\":\"Marshall Islands\"}', 'MHL', '584', '692', NULL, NULL),
(139, 'MQ', 'MARTINIQUE', '{\"ar\":\"مارتينيك\",\"en\":\"Martinique\"}', 'MTQ', '474', '596', NULL, NULL),
(140, 'MR', 'MAURITANIA', '{\"ar\":\"موريتانيا\",\"en\":\"Mauritania\"}', 'MRT', '478', '222', NULL, NULL),
(141, 'MU', 'MAURITIUS', '{\"ar\":\"موريتانيا\",\"en\":\"Mauritius\"}', 'MUS', '480', '230', NULL, NULL),
(142, 'YT', 'MAYOTTE', '{\"ar\":\"مايوت\",\"en\":\"Mayotte\"}', NULL, NULL, '269', NULL, NULL),
(143, 'MX', 'MEXICO', '{\"ar\":\"المكسيك\",\"en\":\"Mexico\"}', 'MEX', '484', '52', NULL, NULL),
(144, 'FM', 'MICRONESIA, FEDERATED STATES OF', '{\"ar\":\"مايكرونيزيا\",\"en\":\"Micronesia\"}', 'FSM', '583', '691', NULL, NULL),
(145, 'MD', 'MOLDOVA, REPUBLIC OF', '{\"ar\":\"مولدافيا\",\"en\":\"Moldova\"}', 'MDA', '498', '373', NULL, NULL),
(146, 'MC', 'MONACO', '{\"ar\":\"موناكو\",\"en\":\"Monaco\"}', 'MCO', '492', '377', NULL, NULL),
(147, 'MN', 'MONGOLIA', '{\"ar\":\"منغوليا\",\"en\":\"Mongolia\"}', 'MNG', '496', '976', NULL, NULL),
(148, 'MS', 'MONTSERRAT', '{\"ar\":\"مونتسيرات\",\"en\":\"Montserrat\"}', 'MSR', '500', '1664', NULL, NULL),
(149, 'MA', 'MOROCCO', '{\"ar\":\"المغرب\",\"en\":\"Morocco\"}', 'MAR', '504', '212', NULL, NULL),
(150, 'MZ', 'MOZAMBIQUE', '{\"ar\":\"موزمبيق\",\"en\":\"Mozambique\"}', 'MOZ', '508', '258', NULL, NULL),
(151, 'MM', 'MYANMAR', '{\"ar\":\"ميانمار\",\"en\":\"Myanmar\"}', 'MMR', '104', '95', NULL, NULL),
(152, 'NA', 'NAMIBIA', '{\"ar\":\"ناميبيا\",\"en\":\"Namibia\"}', 'NAM', '516', '264', NULL, NULL),
(153, 'NR', 'NAURU', '{\"ar\":\"نورو\",\"en\":\"Nauru\"}', 'NRU', '520', '674', NULL, NULL),
(154, 'NP', 'NEPAL', '{\"ar\":\"نيبال\",\"en\":\"Nepal\"}', 'NPL', '524', '977', NULL, NULL),
(155, 'NL', 'NETHERLANDS', '{\"ar\":\"هولندا\",\"en\":\"Netherlands\"}', 'NLD', '528', '31', NULL, NULL),
(156, 'AN', 'NETHERLANDS ANTILLES', '{\"ar\":\"جزر الأنتيل الهولندي\",\"en\":\"Netherlands Antilles\"}', 'ANT', '530', '599', NULL, NULL),
(157, 'NC', 'NEW CALEDONIA', '{\"ar\":\"كاليدونيا الجديدة\",\"en\":\"New Caledonia\"}', 'NCL', '540', '687', NULL, NULL),
(158, 'NZ', 'NEW ZEALAND', '{\"ar\":\"نيوزيلندا\",\"en\":\"New Zealand\"}', 'NZL', '554', '64', NULL, NULL),
(159, 'NI', 'NICARAGUA', '{\"ar\":\"نيكاراجوا\",\"en\":\"Nicaragua\"}', 'NIC', '558', '505', NULL, NULL),
(160, 'NE', 'NIGER', '{\"ar\":\"النيجر\",\"en\":\"Niger\"}', 'NER', '562', '227', NULL, NULL),
(161, 'NG', 'NIGERIA', '{\"ar\":\"نيجيريا\",\"en\":\"Nigeria\"}', 'NGA', '566', '234', NULL, NULL),
(162, 'NU', 'NIUE', '{\"ar\":\"ني\",\"en\":\"Niue\"}', 'NIU', '570', '683', NULL, NULL),
(163, 'NF', 'NORFOLK ISLAND', '{\"ar\":\"جزيرة نورفولك\",\"en\":\"Norfolk Island\"}', 'NFK', '574', '672', NULL, NULL),
(164, 'MP', 'NORTHERN MARIANA ISLANDS', '{\"ar\":\"جزر ماريانا الشمالية\",\"en\":\"Northern Mariana Islands\"}', 'MNP', '580', '1670', NULL, NULL),
(165, 'NO', 'NORWAY', '{\"ar\":\"النرويج\",\"en\":\"Norway\"}', 'NOR', '578', '47', NULL, NULL),
(166, 'OM', 'OMAN', '{\"ar\":\"عمان\",\"en\":\"Oman\"}', 'OMN', '512', '968', NULL, NULL),
(167, 'PK', 'PAKISTAN', '{\"ar\":\"باكستان\",\"en\":\"Pakistan\"}', 'PAK', '586', '92', NULL, NULL),
(168, 'PW', 'PALAU', '{\"ar\":\"بالاو\",\"en\":\"Palau\"}', 'PLW', '585', '680', NULL, NULL),
(169, 'PS', 'PALESTINIAN TERRITORY, OCCUPIED', '{\"ar\":\"فلسطين\",\"en\":\"Palestinian \"}', NULL, NULL, '970', NULL, NULL),
(170, 'PA', 'PANAMA', '{\"ar\":\"بنما\",\"en\":\"Panama\"}', 'PAN', '591', '507', NULL, NULL),
(171, 'PG', 'PAPUA NEW GUINEA', '{\"ar\":\"بابوا غينيا الجديدة\",\"en\":\"Papua New Guinea\"}', 'PNG', '598', '675', NULL, NULL),
(172, 'PY', 'PARAGUAY', '{\"ar\":\"باراغواي\",\"en\":\"Paraguay\"}', 'PRY', '600', '595', NULL, NULL),
(173, 'PE', 'PERU', '{\"ar\":\"بيرو\",\"en\":\"Peru\"}', 'PER', '604', '51', NULL, NULL),
(174, 'PH', 'PHILIPPINES', '{\"ar\":\"الفليبين\",\"en\":\"Philippines\"}', 'PHL', '608', '63', NULL, NULL),
(175, 'PN', 'PITCAIRN', '{\"ar\":\"بيتكيرن\",\"en\":\"Pitcairn\"}', 'PCN', '612', '0', NULL, NULL),
(176, 'PL', 'POLAND', '{\"ar\":\"بولندا\",\"en\":\"Poland\"}', 'POL', '616', '48', NULL, NULL),
(177, 'PT', 'PORTUGAL', '{\"ar\":\"البرتغال\",\"en\":\"Portugal\"}', 'PRT', '620', '351', NULL, NULL),
(178, 'PR', 'PUERTO RICO', '{\"ar\":\"بورتو ريكو\",\"en\":\"Puerto Rico\"}', 'PRI', '630', '1787', NULL, NULL),
(179, 'QA', 'QATAR', '{\"ar\":\"مصر\",\"en\":\"Qatar\"}', 'QAT', '634', '974', NULL, NULL),
(180, 'RE', 'REUNION', '{\"ar\":\"ريونيون\",\"en\":\"Reunion\"}', 'REU', '638', '262', NULL, NULL),
(181, 'RO', 'ROMANIA', '{\"ar\":\"رومانيا\",\"en\":\"Romania\"}', 'ROM', '642', '40', NULL, NULL),
(182, 'RU', 'RUSSIAN FEDERATION', '{\"ar\":\"روسيا\",\"en\":\"Russian\"}', 'RUS', '643', '70', NULL, NULL),
(183, 'RW', 'RWANDA', '{\"ar\":\"رواندا\",\"en\":\"Rwanda\"}', 'RWA', '646', '250', NULL, NULL),
(184, 'WS', 'SAMOA', '{\"ar\":\"ساموا-الأمريكي\",\"en\":\"Samoa\"}', 'WSM', '882', '684', NULL, NULL),
(185, 'SA', 'SAUDI ARABIA', '{\"ar\":\" السعودية\",\"en\":\"Saudi Arabia\"}', 'SAU', '682', '966', NULL, NULL),
(186, 'SN', 'SENEGAL', '{\"ar\":\"السنغال\",\"en\":\"Senegal\"}', 'SEN', '686', '221', NULL, NULL),
(187, 'CS', 'SERBIA AND MONTENEGRO', '{\"ar\":\"صربيا\",\"en\":\"Serbia\"}', NULL, NULL, '381', NULL, NULL),
(188, 'SC', 'SEYCHELLES', '{\"ar\":\"سيشيل\",\"en\":\"Seychelles\"}', 'SYC', '690', '248', NULL, NULL),
(189, 'SL', 'SIERRA LEONE', '{\"ar\":\"سيراليون\",\"en\":\"Sierra Leone\"}', 'SLE', '694', '232', NULL, NULL),
(190, 'SG', 'SINGAPORE', '{\"ar\":\"سنغافورة\",\"en\":\"Singapore\"}', 'SGP', '702', '65', NULL, NULL),
(191, 'SK', 'SLOVAKIA', '{\"ar\":\"سلوفاكيا\",\"en\":\"Slovakia\"}', 'SVK', '703', '421', NULL, NULL),
(192, 'SI', 'SLOVENIA', '{\"ar\":\"سلوفينيا\",\"en\":\"Slovenia\"}', 'SVN', '705', '386', NULL, NULL),
(193, 'SO', 'SOMALIA', '{\"ar\":\"الصومال\",\"en\":\"Somalia\"}', 'SOM', '706', '252', NULL, NULL),
(194, 'ZA', 'SOUTH AFRICA', '{\"ar\":\"مصر\",\"en\":\"جنوب أفريقيا\"}', 'ZAF', '710', '27', NULL, NULL),
(195, 'ES', 'SPAIN', '{\"ar\":\"إسبانيا\",\"en\":\"Spain\"}', 'ESP', '724', '34', NULL, NULL),
(196, 'LK', 'SRI LANKA', '{\"ar\":\"سانت هيلانة\",\"en\":\"Sri Lanka\"}', 'LKA', '144', '94', NULL, NULL),
(197, 'SD', 'SUDAN', '{\"ar\":\"السودان\",\"en\":\"Sudan\"}', 'SDN', '736', '249', NULL, NULL),
(198, 'SZ', 'SWAZILAND', '{\"ar\":\"سوازيلند\",\"en\":\"Swaziland\"}', 'SWZ', '748', '268', NULL, NULL),
(199, 'SE', 'SWEDEN', '{\"ar\":\"السويد\",\"en\":\"Sweden\"}', 'SWE', '752', '46', NULL, NULL),
(200, 'CH', 'SWITZERLAND', '{\"ar\":\"سويسرا\",\"en\":\"Switzerland\"}', 'CHE', '756', '41', NULL, NULL),
(201, 'SY', 'SYRIAN ARAB REPUBLIC', '{\"ar\":\"مصر\",\"en\":\"Syrian\"}', 'SYR', '760', '963', NULL, NULL),
(202, 'TW', 'TAIWAN, PROVINCE OF CHINA', '{\"ar\":\"تايوان\",\"en\":\"Taiwan\"}', 'TWN', '158', '886', NULL, NULL),
(203, 'TJ', 'TAJIKISTAN', '{\"ar\":\"طاجيكستان\",\"en\":\"Tajikistan\"}', 'TJK', '762', '992', NULL, NULL),
(204, 'TZ', 'TANZANIA, UNITED REPUBLIC OF', '{\"ar\":\"تنزانيا\",\"en\":\"Tanzania\"}', 'TZA', '834', '255', NULL, NULL),
(205, 'TH', 'THAILAND', '{\"ar\":\"تايلندا\",\"en\":\"Thailand\"}', 'THA', '764', '66', NULL, NULL),
(206, 'TN', 'TUNISIA', '{\"ar\":\"تونس\",\"en\":\"Tunisia\"}', 'TUN', '788', '216', NULL, NULL),
(207, 'TR', 'TURKEY', '{\"ar\":\"تركيا\",\"en\":\"Turkey\"}', 'TUR', '792', '90', NULL, NULL),
(208, 'TM', 'TURKMENISTAN', '{\"ar\":\"تركمانستان\",\"en\":\"Turkmenistan\"}', 'TKM', '795', '7370', NULL, NULL),
(209, 'UG', 'UGANDA', '{\"ar\":\"أوغندا\",\"en\":\"Uganda\"}', 'UGA', '800', '256', NULL, NULL),
(210, 'UA', 'UKRAINE', '{\"ar\":\"أوكرانيا\",\"en\":\"Ukraine\"}', 'UKR', '804', '380', NULL, NULL),
(211, 'AE', 'UNITED ARAB EMIRATES', '{\"ar\":\"الإمارات\",\"en\":\"Emirates\"}', 'ARE', '784', '971', NULL, NULL),
(212, 'GB', 'UNITED KINGDOM', '{\"ar\":\"المملكة المتحدة\",\"en\":\"United Kingdom\"}', 'GBR', '826', '44', NULL, NULL),
(213, 'US', 'UNITED STATES', '{\"ar\":\"الولايات المتحدة\",\"en\":\"United States\"}', 'USA', '840', '1', NULL, NULL),
(214, 'UY', 'URUGUAY', '{\"ar\":\"أورغواي\",\"en\":\"Uruguay\"}', 'URY', '858', '598', NULL, NULL),
(215, 'UZ', 'UZBEKISTAN', '{\"ar\":\"أوزباكستان\",\"en\":\"Uzbekistan\"}', 'UZB', '860', '998', NULL, NULL),
(216, 'VE', 'VENEZUELA', '{\"ar\":\"فنزويلا\",\"en\":\"Venezuela\"}', 'VEN', '862', '58', NULL, NULL),
(217, 'VN', 'VIET NAM', '{\"ar\":\"فيتنام\",\"en\":\"Viet Nam\"}', 'VNM', '704', '84', NULL, NULL),
(218, 'YE', 'YEMEN', '{\"ar\":\"اليمن\",\"en\":\"Yemen\"}', 'YEM', '887', '967', NULL, NULL),
(219, 'ZM', 'ZAMBIA', '{\"ar\":\"زامبيا\",\"en\":\"Zambia\"}', 'ZMB', '894', '260', NULL, NULL),
(220, 'ZW', 'ZIMBABWE', '{\"ar\":\"زمبابوي\",\"en\":\"Zimbabwe\"}', 'ZWE', '716', '263', NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `coupons`
--

CREATE TABLE `coupons` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `courses`
--

CREATE TABLE `courses` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `userId` bigint(20) UNSIGNED NOT NULL,
  `categoryId` int(11) NOT NULL,
  `subCategoryId` int(11) NOT NULL,
  `childCategoryId` int(11) NOT NULL,
  `languageId` int(11) DEFAULT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `level` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `short_detail` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `detail` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `requirement` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `price` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `discount_price` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `date` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `image` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `slug` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `status` int(11) NOT NULL DEFAULT 0,
  `duration` int(11) DEFAULT NULL,
  `meta_key` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `meta_desc` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `courses`
--

INSERT INTO `courses` (`id`, `userId`, `categoryId`, `subCategoryId`, `childCategoryId`, `languageId`, `title`, `level`, `short_detail`, `detail`, `requirement`, `price`, `discount_price`, `date`, `image`, `slug`, `status`, `duration`, `meta_key`, `meta_desc`, `created_at`, `updated_at`) VALUES
(1, 14, 1, 1, 1, NULL, 'The Business Intelligence Analyst Course 2021', 'مستوي متقدم', 'The Business Intelligence Analyst Course 2021', 'The Business Intelligence Analyst Course 2021 The Business Intelligence Analyst Course 2021 The Business Intelligence Analyst Course 2021', 'The Business Intelligence Analyst Course 2021 The Business Intelligence Analyst Course 2021', '33', NULL, '2021-08-13', '1625830591.jpeg', 'the-business-intelligence-analyst-course-2021', 0, 150, 'The Business Intelligence Analyst Course 2021\r\n The Business Intelligence Analyst Course 2021', 'The Business Intelligence Analyst Course 2021\r\n The Business Intelligence Analyst Course 2021', '2021-08-13 04:01:27', '2021-08-13 04:01:27'),
(2, 14, 1, 1, 1, NULL, 'The Business Intelligence Analyst Course 2021', 'مستوي متقدم', 'The Business Intelligence Analyst Course 2021', 'The Business Intelligence Analyst Course 2021 The Business Intelligence Analyst Course 2021 The Business Intelligence Analyst Course 2021', 'The Business Intelligence Analyst Course 2021 The Business Intelligence Analyst Course 2021', '33', NULL, '2021-08-13', '1625830591.jpeg', 'the-business-intelligence-analyst-course-2021', 0, 150, 'The Business Intelligence Analyst Course 2021\r\n The Business Intelligence Analyst Course 2021', 'The Business Intelligence Analyst Course 2021\r\n The Business Intelligence Analyst Course 2021', '2021-08-13 04:01:27', '2021-08-13 04:01:27'),
(3, 14, 1, 1, 1, NULL, 'The Business Intelligence Analyst Course 2021', 'مستوي متقدم', 'The Business Intelligence Analyst Course 2021', 'The Business Intelligence Analyst Course 2021 The Business Intelligence Analyst Course 2021 The Business Intelligence Analyst Course 2021', 'The Business Intelligence Analyst Course 2021 The Business Intelligence Analyst Course 2021', '33', NULL, '2021-08-13', '1625830591.jpeg', 'the-business-intelligence-analyst-course-2021', 0, 150, 'The Business Intelligence Analyst Course 2021\r\n The Business Intelligence Analyst Course 2021', 'The Business Intelligence Analyst Course 2021\r\n The Business Intelligence Analyst Course 2021', '2021-08-13 04:01:27', '2021-08-13 04:01:27'),
(4, 14, 1, 1, 1, NULL, 'The Business Intelligence Analyst Course 2021', 'مستوي متقدم', 'The Business Intelligence Analyst Course 2021', 'The Business Intelligence Analyst Course 2021 The Business Intelligence Analyst Course 2021 The Business Intelligence Analyst Course 2021', 'The Business Intelligence Analyst Course 2021 The Business Intelligence Analyst Course 2021', '33', NULL, '2021-08-13', '1625830591.jpeg', 'the-business-intelligence-analyst-course-2021', 0, 150, 'The Business Intelligence Analyst Course 2021\r\n The Business Intelligence Analyst Course 2021', 'The Business Intelligence Analyst Course 2021\r\n The Business Intelligence Analyst Course 2021', '2021-08-13 04:01:27', '2021-08-13 04:01:27'),
(5, 14, 1, 1, 1, NULL, 'The Business Intelligence Analyst Course 2021', 'مستوي متقدم', 'The Business Intelligence Analyst Course 2021', 'The Business Intelligence Analyst Course 2021 The Business Intelligence Analyst Course 2021 The Business Intelligence Analyst Course 2021', 'The Business Intelligence Analyst Course 2021 The Business Intelligence Analyst Course 2021', '33', NULL, '2021-08-13', '1625830591.jpeg', 'the-business-intelligence-analyst-course-2021', 0, 150, 'The Business Intelligence Analyst Course 2021\r\n The Business Intelligence Analyst Course 2021', 'The Business Intelligence Analyst Course 2021\r\n The Business Intelligence Analyst Course 2021', '2021-08-13 04:01:27', '2021-08-13 04:01:27');

-- --------------------------------------------------------

--
-- Table structure for table `degrees`
--

CREATE TABLE `degrees` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `courseId` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `documents`
--

CREATE TABLE `documents` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `description` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `file` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `connection` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `queue` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `exception` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `instructors`
--

CREATE TABLE `instructors` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `countryId` int(11) DEFAULT NULL,
  `cityId` int(11) DEFAULT NULL,
  `stateID` int(11) DEFAULT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `dateOfBirth` date DEFAULT NULL,
  `mobile` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `address` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `photo` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `gender` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `detail` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `rate` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `status` int(11) NOT NULL DEFAULT 1,
  `type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'student',
  `is_activated` tinyint(4) NOT NULL DEFAULT 0,
  `token` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `device_token` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `instructors`
--

INSERT INTO `instructors` (`id`, `countryId`, `cityId`, `stateID`, `name`, `email`, `password`, `dateOfBirth`, `mobile`, `address`, `photo`, `gender`, `detail`, `rate`, `status`, `type`, `is_activated`, `token`, `device_token`, `created_at`, `updated_at`) VALUES
(13, 16, NULL, NULL, 'student', 'hamadaali889900@gmail.com', '$2y$10$QZsZMq.USo9/r.8rEuXj4O3snLoTs.gKIQgFAzxrJ0iK964YfNop.', '2021-08-10', '34567856789', '4567uuuu', '1629013833.png', 'cytrdyr', 'rwfgrwg', '4', 1, 'student', 1, NULL, NULL, '2021-08-12 12:13:30', '2021-08-21 10:02:12'),
(14, 16, NULL, NULL, 'instructorsss', 'hamadaali221133@gmail.com', '$2y$10$QZsZMq.USo9/r.8rEuXj4O3snLoTs.gKIQgFAzxrJ0iK964YfNop.', NULL, '34567890', NULL, '1631001126.jpeg', NULL, NULL, NULL, 1, 'instructor', 1, NULL, NULL, '2021-08-12 12:40:58', '2021-09-07 07:52:06'),
(15, 1, 1, NULL, 'zenhom alslehdar', 'zeyad.zean@yahoo.com	', '$2y$10$zQZ4ww.pEQKI4JdGeAxVru6zQANtD6hLWAHeCYuoppx8ttPN6rk5O', '2021-08-11', '+20 +201111654585', 'Egypt, Al Qahirah	', '1625932279.jpg', NULL, 'كاتب ويوتيوبرز	', NULL, 1, 'instructor', 1, NULL, NULL, NULL, NULL),
(16, 1, 1, NULL, 'د نبيل حميدة	', 'naylornabil03@gmail.com', '$2y$10$zQZ4ww.pEQKI4JdGeAxVru6zQANtD6hLWAHeCYuoppx8ttPN6rk5O', NULL, '+213 +2130774921300', 'Algeria, Skikda	', '1625932279.jpg', NULL, 'نبيل حميدة أستاذ باحث في جامعة العلوم الأدبية في سكيكدة / الجزائر مؤلف روايات لاقت إقبلا معتبرا في المشرق العربي خلصة روايتي (أمية الشفتين وقبلة العقرب) و(أنا وسلوى كما له العديد العديد من دواوين الخواطر الغزلية ولم ينضب يراعه عن ذاك فقط بل نجحت له عدة عناوين في التنمية البشرية والنجاح والتحفيز الذاتي وتربية النشئ	', NULL, 1, 'instructor', 1, NULL, NULL, NULL, NULL),
(17, 1, 1, NULL, 'إيّاد الريموني	', 'alramounieyad@gmail.com	', '$2y$10$zQZ4ww.pEQKI4JdGeAxVru6zQANtD6hLWAHeCYuoppx8ttPN6rk5O', NULL, '+962 +962779007878	', 'Jordan, Al Balqa	', '1625932279.jpg', NULL, 'مخرج مسرحي للعديد من الأعمال ممثل مسرحي للعديد من الأعمال كاتب مسرحي للعديد من الأعمال كاتب قصصي وشاعر في قصائد الهايكو عضو نقابة الفنانين الأردنيين حاصل على العديد من الجوائز المسرحية	', NULL, 1, 'instructor', 1, NULL, NULL, NULL, NULL),
(18, 1, 1, NULL, 'Ravi	', 'rafikravi120@gmail.com	', '$2y$10$zQZ4ww.pEQKI4JdGeAxVru6zQANtD6hLWAHeCYuoppx8ttPN6rk5O', NULL, '+213 +2130659036378	', 'Algeria, Blida	', '1625932279.jpg', NULL, 'طالب جامعي و صحفي في قناة خاصة	', NULL, 1, 'instructor', 1, NULL, NULL, NULL, NULL),
(19, 1, 1, NULL, 'محمدثامر		', 'mohammadthamer66@gmail.com', '$2y$10$zQZ4ww.pEQKI4JdGeAxVru6zQANtD6hLWAHeCYuoppx8ttPN6rk5O', NULL, '+962 +96200962798086260', 'Jordan, Amman	', '1625932279.jpg', NULL, 'كتاب ابتسم للحياةهو حروف لا بل كلمات ترجمت من الواقع لهذا الكتاب تشعر وانت تقرأ أنك تسافر في صفحات هذا الكتاب إلى عالم اخر الكتاب عبارة عن مجموعة قصصيةمكون من خمسة قصص حقيقيةمر بها الكاتب في حياته	', NULL, 1, 'instructor', 1, NULL, NULL, NULL, NULL),
(20, NULL, NULL, NULL, 'عادل إبراهيم علي	', 'hanzouliadel9@gmail.com	', '$2y$10$zQZ4ww.pEQKI4JdGeAxVru6zQANtD6hLWAHeCYuoppx8ttPN6rk5O', NULL, '+216 +21693262968	', 'Tunisia, Sidi Bou Zid (Sidi Bu Zayd)	', '1625932279.jpg', NULL, 'روائي وقاص وكاتب مسرحي من تونس، صدر له تكهنات لا تخطئ، مجموعة قصصية عن دار القلم التونسية، كما صدرت له رواية هذيان هامشي عن نفس الدار، تصدر له قريبا مسرحية العجوز عن دار راشد للنشر بالفجيرة . قدم للمسرح التونسي عديد المسرحيات التي أُخرجت في شكل عروض، دخل القائمة القصيرة لجائزة راشد بن حمد الشرقي سنة 2020، والقائمة القصيرة لجائزة الدولة لأدب الطفل 2020.	', NULL, 1, 'instructor', 1, NULL, NULL, NULL, NULL),
(21, NULL, NULL, NULL, 'Ali Rstom', 'ali.n.rstom3@gmail.com', '$2y$10$T7rNnTLCtRwzGggSTB29heg5TtWcXl47O6okHt7Od98ruxUXLv9t2', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 1, 'instructor', 1, NULL, NULL, '2021-08-26 11:33:42', '2021-08-26 11:33:42'),
(22, NULL, NULL, NULL, 'أشرف محمد المهندس', 'mr.ashraf.elmohands@gmail.com', '$2y$10$l3jlyWYZpVkIozbrLSbLlON9NEywUrN5f22LALrVFM0etgNcqxk.S', NULL, '+20 +201284820029', 'Egypt, Al Iskandariyah', NULL, NULL, 'كانب صحفى ورائى وسنارسيت من مصر	', NULL, 1, 'instructor', 1, NULL, NULL, '2021-08-26 11:33:42', '2021-09-03 17:07:54'),
(23, NULL, NULL, NULL, 'مجدي حجاج', 'magdyhagagmm@gmail.com', '$2y$10$pMyf2cKYhzU04Yig79Jgw.4envUxfw7a.cizlZ.Ng2owoxddY0WfC', NULL, '+20 +2001287272106', 'Egypt, Al Buhayrah', NULL, NULL, 'أستاذ اللغة العربية والخط العربي. شاعر فصحى. مدقق لغوي. صاحب صفحة مجدي حجاج على فيسبوك. والصفحة العامة الملخص في النحو والصرف. صاحب قناة يوتيوب باسم أ. مجدي حجاج	', NULL, 1, 'instructor', 1, NULL, NULL, '2021-08-26 11:33:42', '2021-08-26 11:33:42'),
(24, NULL, NULL, NULL, 'حمزه لعريبي', 'hamzalaribi1987@gmail.com', '$2y$10$hctdRUeHwfUMuuSmN8igNeuF6WDN6qqkklXCcUK72IWfvvy1Zc58C', NULL, '+213 +2130660492733', 'Algeria, Batna', NULL, NULL, 'كاتب وصحفي جزائري	', NULL, 1, 'instructor', 1, NULL, NULL, '2021-08-26 11:33:42', '2021-08-26 11:33:42'),
(26, NULL, NULL, NULL, 'عزة دياب', 'a_diabe11@yahoo.com', '$2y$10$XiBLIq06SzWY4hMnDY82eOMhqiXJ5EdBS15OGaSkHPqILW94lViZ6', NULL, '+2001229810846	', 'Egypt, Al Buhayrah', NULL, NULL, 'كاتبة قصة ورواية لي عدة مجموعات قصصية وثلاث روايات فازت روايتي الثالثة حارسة الموتى بجائزة راشد بن حمد الشرقي للإبداع فرع الرواية كبار المركز الأول في 2019‘وفازت مجموعتي القصصية المخطوطة الثلث الأخير من الليل بجائزة اتيليه العرب المركز الأول في2020.	', NULL, 1, 'instructor', 1, NULL, NULL, '2021-08-26 11:33:42', '2021-08-26 11:33:42'),
(27, NULL, NULL, NULL, 'د الياس لويس بيش', 'eliaspech204@gmail.com', '$2y$10$9rJD4bZoPp0wpjdKGAQFkuGMvMLZWiD45O4pzLSSezJRpTToYRwxm', NULL, '00211924675252', 'Egypt, Al Buhayrah', NULL, NULL, 'طبيب وكاتب رواءي من. جمهورية السودان الجنوبي	', NULL, 1, 'instructor', 1, NULL, NULL, '2021-08-26 11:33:42', '2021-08-26 11:33:42'),
(28, NULL, NULL, NULL, 'Shaban moneer', 'shabansalhaf@gmail.com', '$2y$10$wxh9GQ0CsYQeNLzAYhKq7uAp285wUGTUzi599g3VDTyHvq4DbNvb2', NULL, '+2001146266767	', 'Egypt, Al Qahirah', NULL, NULL, 'روائي وكاتب قصة قصيرة لي العديد من المؤلفات الورقية والألكترونية منها : وإن كانت لا تراني- ريو دي جانيرو- سيزيف- طراد النيل- الوتين النازف- فن التدقيق اللغوي.	', NULL, 1, 'student', 1, NULL, NULL, '2021-08-26 11:33:42', '2021-09-03 13:06:32'),
(29, NULL, NULL, NULL, 'بلغنامي عبدالرحيم', 'belghanamiabderrahim@gmail.com', '$2y$10$kTptO6/ZOeTdTDmKGgUpUupDsCGF6JNb3VZaQ10RpSEX.tLyTAcSm', NULL, '+213793949779	', 'Algeria, Bechar	', NULL, NULL, 'شاعر وروائي', NULL, 1, 'instructor', 1, NULL, NULL, '2021-08-26 11:33:42', '2021-08-26 11:33:42'),
(47, 3, NULL, NULL, 'رضا الحسيني', 'yuolyuo@gmail.com', '$2y$10$vQ.ETINrmtJfg6PpfqqZ0.emWwekUWg8bqvPPewoiRsGS5vVlGYcO', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 1, 'instructor', 1, NULL, NULL, '2021-09-03 21:34:19', '2021-09-03 21:34:19'),
(48, 3, NULL, NULL, 'د. حسني المستريحي', 'Dr.husni777@gmail.com', '$2y$10$z54DOcWUbz9qaD8tqvfO6e29RDi.dWLSAncFloCLQAe0Y6g.WFRUu', NULL, '+9660580981640	', 'Saudi Arabia, Al Madinah	', NULL, NULL, 'الدكتور حسني حمد المستريحي أردني الجنسية من مواليد 1971. من خلال تخصصة وخبرته، قد جمع المؤلف بين علوم الإدارة والتنمية البشرية من جهة، وعلوم الحاسب الآلي من جهة أخرى بسبب الإرتباط الوثيق بين التخصصين. حاصل على درجة الدكتوراه في علوم الحاسب، وشهادات تدريبية دولية عديدة في الإدارة والتنمية البشرية، شهادة برنامج تدريبي دبلومة في الصحة النفسية، مدرب معتمد في التنمية البشرية وإدارة الذات والوعي الذاتي ومهارات الحياة، ومدرب معتمد في البرمجة اللغوية العصبية والصحة النفسية. قام بتأسيس عدة شركات وبتقديم مئات البرامج التدريبية و ورش العمل في عدة دول وباللغتين العربية والإنجليزية في مجال الإدارة والتنمية البشرية ومهارات الحياة. وقد شغل عدة مناصب خلال مسيرته المهنية: استاذ جامعي بعدة جامعات، مدرب معتمد من عدة جهات، رئيس هيئة مديرين، مدير عام، مدير البرامج الأكاديمية، باحث ومؤلف.	', NULL, 1, 'instructor', 1, NULL, NULL, '2021-09-03 21:34:19', '2021-09-07 07:09:22'),
(50, 3, NULL, NULL, 'hamada', 'zagellshoop221133@gmail.com', '$2y$10$xSDYyHcdPEPwF7An2b42quOIHLeGKHxj/lghmeX3qyzeolGGCCRXm', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 1, 'student', 1, NULL, NULL, '2021-09-05 11:23:25', '2021-09-05 11:30:32'),
(51, NULL, NULL, NULL, 'Chol Deng', 'abramdeng07@gmail.com', '$2y$10$YIiaawFzzstXt4iGth2GN.9Ppo7E/h4pji67/H7xCSkG83sYMXrj.', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 1, 'student', 0, NULL, NULL, '2021-09-10 20:36:57', '2021-09-10 20:41:47'),
(52, NULL, NULL, NULL, 'أحمد ثروت', '304ahmedtharwat@gmail.com', '$2y$10$Ry8YA078mMl3QsRN9NlIDOS1tItqzCf6KbqC/SuDLo9vQgj2MwE1y	', NULL, '+20 +201096235976', 'Egypt, Ad Daqahliyah	', NULL, NULL, 'الاسم : أحمد ثروت عبد السميع الجابري اسم الشهرة : أحمد ثروت هاتف : 01096235976 مواليد 10/7/1977 الدولة: جمهورية مصر العربية الإيميل: ahmedtharwat304@yahoo.com 304ahmedtharwat@gmail.com المؤهلات: ليسانس الآداب- قسم اللغة الانجليزية – جامعة المنصورة 2000 ليسانس الحقوق – جامعة المنصورة 2009 النشر: 1- المجموعة القصصية \" نباتات الأسفلت\" 2018 . 2- العديد من النصوص في مجلة الثقافة الجديدة وجريدة الدستور ومجلة أوراق ثقافية وموقع الكتابة الالكتروني وغيرها من الجرائد والمجلات. 3- تحت الطبع: 1- مجموعة قصصية بعنوان \"الحكايات الستة عن ريحانة\"، عن دار روافد، 2021. 2- مجموعة قصصية للأطفال بعنوان \"آدم والحكايات الستة\"، عن دار واو، 2021. 3- مجموعة قصصية للأطفال بعنوان \"قصص من التراث للأطفال \"إعداد\". الجوائز: جائزة \"هبة بنداري\" المركز الثالث، عن المجموعة القصصية للأطفال \"آدم والحكايات الستة\" 2020 جائزة صلاح هلال الأدبية للقصة، المركز الثاني 2020 \"قصة جنون المدن\" جائزة المسابقة الأدبية المركزية لإقليم شرق الدلتا الثقافي، المركز الأول 2020 فرع قصة الأطفال \" قصة آدم والتابلت\" جائزة المسابقة الأدبية المركزية لإقليم شرق الدلتا الثقافي، المركز الأول 2019 فرع القصة القصيرة \"قصة نوستالجيا الزبادي\" جائزة ربيع مفتاح 2018 فرع القصة المركز الثاني \"قصة التروسيكل\" جائزة عماد قطري للإصدار الأول فرع القصة، سنة 2017 عن المجموعة القصصية\" نباتات الأسفلت\". - رئيس نادي للقصة بالمنصورة.	', NULL, 1, 'instructor', 1, NULL, NULL, '2021-08-26 11:33:42', '2021-08-26 11:33:42'),
(53, NULL, NULL, NULL, 'dsfvsdfv', 'hamadaalisdfdsf221133@gmail.com', '$2y$10$gs3TDRjCc4owcyuNg5uEiOWVuhLGGQpUe3dwj01CSSVbSN/SwkGM2', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 1, 'student', 0, NULL, NULL, '2021-09-15 15:10:13', '2021-09-15 15:10:13');

-- --------------------------------------------------------

--
-- Table structure for table `jobs`
--

CREATE TABLE `jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `queue` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `attempts` tinyint(3) UNSIGNED NOT NULL,
  `reserved_at` int(10) UNSIGNED DEFAULT NULL,
  `available_at` int(10) UNSIGNED NOT NULL,
  `created_at` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `languagess`
--

CREATE TABLE `languagess` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `local` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2014_10_12_000000_create_users_table', 1),
(2, '2014_10_12_100000_create_password_resets_table', 1),
(3, '2019_08_19_000000_create_failed_jobs_table', 1),
(4, '2021_05_27_054719_create_categories_table', 1),
(5, '2021_05_27_054745_create_sub_categories_table', 1),
(6, '2021_05_27_054758_create_child_categories_table', 1),
(7, '2021_05_27_054810_create_countries_table', 1),
(8, '2021_05_27_054823_create_cities_table', 1),
(9, '2021_05_27_054837_create_states_table', 1),
(10, '2021_05_27_054850_create_languagess_table', 1),
(11, '2021_05_27_054903_create_instructors_table', 1),
(12, '2021_05_27_054916_create_courses_table', 1),
(13, '2021_05_27_054930_create_chapters_table', 1),
(14, '2021_05_27_054942_create_videos_table', 1),
(15, '2021_05_27_054955_create_socials_table', 1),
(16, '2021_05_27_055008_create_students_table', 1),
(17, '2021_05_27_055022_create_wishlists_table', 1),
(18, '2021_05_27_055036_create_carts_table', 1),
(19, '2021_05_27_055050_create_orders_table', 1),
(20, '2021_05_27_055107_create_payments_table', 1),
(21, '2021_05_27_055122_create_quizes_table', 1),
(22, '2021_05_27_055136_create_questions_table', 1),
(23, '2021_05_27_055152_create_topics_table', 1),
(24, '2021_05_27_055226_create_answers_table', 1),
(25, '2021_05_27_055237_create_banks_table', 1),
(26, '2021_05_27_055308_create_reviews_table', 1),
(27, '2021_05_27_055329_create_coupons_table', 1),
(28, '2021_05_27_055400_create_abouts_table', 1),
(29, '2021_05_27_055414_create_contacts_table', 1),
(30, '2021_05_27_055446_create_sliders_table', 1),
(31, '2021_05_27_055552_create_testimonials_table', 1),
(32, '2021_05_27_055606_create_settings_table', 1),
(33, '2021_05_27_055634_create_privacies_table', 1),
(34, '2021_05_27_070852_create_degrees_table', 1),
(35, '2021_05_27_071709_create_certificates_table', 1),
(36, '2021_06_04_082141_create_books_table', 1),
(37, '2021_06_05_112127_create_documents_table', 1),
(38, '2021_06_06_104845_create_jobs_table', 1);

-- --------------------------------------------------------

--
-- Table structure for table `model_has_permissions`
--

CREATE TABLE `model_has_permissions` (
  `permission_id` bigint(20) UNSIGNED NOT NULL,
  `model_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `model_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `model_has_roles`
--

CREATE TABLE `model_has_roles` (
  `role_id` bigint(20) UNSIGNED NOT NULL,
  `model_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `model_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `model_has_roles`
--

INSERT INTO `model_has_roles` (`role_id`, `model_type`, `model_id`) VALUES
(1, 'App\\User', 1),
(4, 'App\\User', 2),
(1, 'App\\User', 3),
(1, 'App\\User', 4);

-- --------------------------------------------------------

--
-- Table structure for table `orders`
--

CREATE TABLE `orders` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `courseId` bigint(20) UNSIGNED NOT NULL,
  `userId` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `password_resets`
--

CREATE TABLE `password_resets` (
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `password_resets`
--

INSERT INTO `password_resets` (`email`, `token`, `created_at`) VALUES
('hamadaali221133@gmail.com', 'kO1W8vw0FG7e5WiHijC1rDtSwYGhVw9XL2G4YFoSQQZMKelzypWUOYbsgadUgB7N', '2021-09-18 05:55:48'),
('hamadaali221133@gmail.com', 'hKCZyp9McAWiSWgVegiBhFZGHoz8wBWy8lf87pjqCeVQGBVGNg70SUlyWDTJfgp9', '2021-09-18 05:56:33'),
('hamadaali889900@gmail.com', 'JVcnoMXGVVa35w2gvAesVPkPNHYiaL5Cw3lJavSJGNtFPIgQlaKQsucm1YRtjBYt', '2021-09-18 06:09:18'),
('hamadaali889900@gmail.com', 'kSCUJsGciSysXfLtdnfzsm57A1jPoktWeUnoGJaB6CY3mVB72l0VYrZ7Mksx4Mi3', '2021-09-18 06:11:20'),
('hamadaali889900@gmail.com', 'k8zLzsHVtSGvjPLAgH6lnmxID5IbhREnkw2gHZcIDcwOcCNKxe8pZQY6keq0sglT', '2021-09-18 06:13:46'),
('hamadaali889900@gmail.com', 'qR83GEA4EtiqCNgc8dLlbDfVCSImi6dW3pUmpkhk0WWs2qu0LqOjb3xTbhyA84gD', '2021-09-18 06:14:00'),
('hamadaali889900@gmail.com', 'OWU8aPhju0tPBrzFxJZ1ey4S95SaDIVKMsJjSkwzSHBzG5CJ6sKxVCyQ7RfZ0abL', '2021-09-18 07:17:44');

-- --------------------------------------------------------

--
-- Table structure for table `payments`
--

CREATE TABLE `payments` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `courseId` bigint(20) UNSIGNED NOT NULL,
  `userId` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `permissions`
--

CREATE TABLE `permissions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `guard_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `permissions`
--

INSERT INTO `permissions` (`id`, `name`, `guard_name`, `created_at`, `updated_at`) VALUES
(1, 'الفواتير', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(2, 'قائمة الفواتير', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(3, 'الفواتير المدفوعة', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(4, 'الفواتير المدفوعة جزئيا', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(5, 'الفواتير الغير مدفوعة', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(6, 'ارشيف الفواتير', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(7, 'التقارير', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(8, 'تقرير الفواتير', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(9, 'تقرير العملاء', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(10, 'المستخدمين', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(11, 'قائمة المستخدمين', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(12, 'صلاحيات المستخدمين', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(13, 'الاعدادات', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(14, 'المنتجات', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(15, 'الاقسام', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(16, 'اضافة فاتورة', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(17, 'حذف الفاتورة', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(18, 'تصدير EXCEL', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(19, 'تغير حالة الدفع', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(20, 'تعديل الفاتورة', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(21, 'ارشفة الفاتورة', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(22, 'طباعةالفاتورة', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(23, 'اضافة مرفق', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(24, 'حذف المرفق', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(25, 'اضافة مستخدم', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(26, 'تعديل مستخدم', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(27, 'حذف مستخدم', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(28, 'عرض صلاحية', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(29, 'اضافة صلاحية', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(30, 'تعديل صلاحية', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(31, 'حذف صلاحية', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(32, 'اضافة منتج', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(33, 'تعديل منتج', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(34, 'حذف منتج', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(35, 'اضافة قسم', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(36, 'تعديل قسم', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(37, 'حذف قسم', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06'),
(38, 'الاشعارات', 'web', '2021-07-08 06:35:06', '2021-07-08 06:35:06');

-- --------------------------------------------------------

--
-- Table structure for table `privacies`
--

CREATE TABLE `privacies` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `questions`
--

CREATE TABLE `questions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `courseId` bigint(20) UNSIGNED NOT NULL,
  `userId` bigint(20) UNSIGNED NOT NULL,
  `question` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `mark` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `status` int(11) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `quizes`
--

CREATE TABLE `quizes` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `courseId` int(11) NOT NULL,
  `instructorId` int(11) NOT NULL,
  `studentId` int(11) NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `date` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `timer` int(11) DEFAULT NULL,
  `status` int(11) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `reviews`
--

CREATE TABLE `reviews` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `courseId` bigint(20) UNSIGNED NOT NULL,
  `comment` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `rate` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `date` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `roles`
--

CREATE TABLE `roles` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `guard_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `roles`
--

INSERT INTO `roles` (`id`, `name`, `guard_name`, `created_at`, `updated_at`) VALUES
(1, 'Admin', 'web', '2021-01-03 03:43:48', '2021-01-03 03:43:48'),
(2, 'editor', 'web', '2021-07-20 03:56:23', '2021-07-14 03:56:23');

-- --------------------------------------------------------

--
-- Table structure for table `role_has_permissions`
--

CREATE TABLE `role_has_permissions` (
  `permission_id` bigint(20) UNSIGNED NOT NULL,
  `role_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `role_has_permissions`
--

INSERT INTO `role_has_permissions` (`permission_id`, `role_id`) VALUES
(1, 1),
(1, 4),
(2, 1),
(2, 4),
(3, 1),
(4, 1),
(5, 1),
(6, 1),
(7, 1),
(8, 1),
(9, 1),
(10, 1),
(11, 1),
(12, 1),
(13, 1),
(14, 1),
(15, 1),
(16, 1),
(17, 1),
(18, 1),
(19, 1),
(20, 1),
(21, 1),
(22, 1),
(23, 1),
(24, 1),
(25, 1),
(26, 1),
(27, 1),
(28, 1),
(29, 1),
(30, 1),
(31, 1),
(32, 1),
(33, 1),
(34, 1),
(35, 1),
(36, 1),
(37, 1),
(38, 1),
(1, 2),
(2, 2),
(37, 2);

-- --------------------------------------------------------

--
-- Table structure for table `settings`
--

CREATE TABLE `settings` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `sliders`
--

CREATE TABLE `sliders` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `image` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `sliders`
--

INSERT INTO `sliders` (`id`, `title`, `description`, `image`, `created_at`, `updated_at`) VALUES
(1, '{\"ar\":\"\\u062a\\u0639\\u0644\\u0645 \\u0641\\u064a \\u0623\\u064a \\u0648\\u0642\\u062a\",\"en\":\"Learn Anytime\"}', '{\"ar\":\"\\u0644\\u0648\\u0631\\u064a\\u0645 \\u0625\\u064a\\u0628\\u0633\\u0648\\u0645 \\u0647\\u0648 \\u0628\\u0628\\u0633\\u0627\\u0637\\u0629 \\u0646\\u0635 \\u0634\\u0643\\u0644\\u064a \\u064a\\u0633\\u062a\\u062e\\u062f\\u0645 \\u0641\\u064a \\u0635\\u0646\\u0627\\u0639\\u0629 \\u0627\\u0644\\u0637\\u0628\\u0627\\u0639\\u0629 \\u0648\\u0627\\u0644\\u062a\\u0646\\u0636\\u064a\\u062f.\",\"en\":\"Lorem Ipsum is simply dummy text of the printing and typesetting industry.\"}', '1631175272.jpeg', NULL, '2021-09-09 08:14:32'),
(2, '{\"ar\":\"\\u062f\\u0631\\u0648\\u0633 \\u0645\\u0628\\u0627\\u0634\\u0631\\u0629 \\u0639\\u0644\\u0649 \\u0627\\u0644\\u0625\\u0646\\u062a\\u0631\\u0646\\u062a\",\"en\":\"Online Courses\"}', '{\"ar\":\"\\u0644\\u0648\\u0631\\u064a\\u0645 \\u0625\\u064a\\u0628\\u0633\\u0648\\u0645 \\u0647\\u0648 \\u0628\\u0628\\u0633\\u0627\\u0637\\u0629 \\u0646\\u0635 \\u0634\\u0643\\u0644\\u064a \\u064a\\u0633\\u062a\\u062e\\u062f\\u0645 \\u0641\\u064a \\u0635\\u0646\\u0627\\u0639\\u0629 \\u0627\\u0644\\u0637\\u0628\\u0627\\u0639\\u0629 \\u0648\\u0627\\u0644\\u062a\\u0646\\u0636\\u064a\\u062f.\",\"en\":\"Lorem Ipsum is simply dummy text of the printing and typesetting industry.\"}', '1631175281.jpeg', NULL, '2021-09-09 08:14:41');

-- --------------------------------------------------------

--
-- Table structure for table `socials`
--

CREATE TABLE `socials` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `userId` bigint(20) UNSIGNED NOT NULL,
  `face` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `twitter` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `linkedin` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `states`
--

CREATE TABLE `states` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `countryId` int(11) NOT NULL,
  `cityId` int(11) NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `students`
--

CREATE TABLE `students` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `dateOfBirth` date DEFAULT NULL,
  `mobile` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `photo` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `gender` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `status` int(11) NOT NULL DEFAULT 1,
  `token` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `device_token` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `sub_categories`
--

CREATE TABLE `sub_categories` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `categoryId` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `icon` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `slug` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `status` int(11) NOT NULL DEFAULT 0,
  `top` int(11) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `sub_categories`
--

INSERT INTO `sub_categories` (`id`, `categoryId`, `title`, `icon`, `image`, `slug`, `status`, `top`, `created_at`, `updated_at`) VALUES
(1, 1, 'style2', 'wrwf', 'wfwr', 'style2', 1, 0, NULL, NULL),
(2, 2, 'style2', 'wrwf', 'wfwr', 'style2', 1, 0, NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `testimonials`
--

CREATE TABLE `testimonials` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `topics`
--

CREATE TABLE `topics` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `courseId` bigint(20) UNSIGNED NOT NULL,
  `questionId` bigint(20) UNSIGNED NOT NULL,
  `a` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `b` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `c` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `d` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `answer` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `transactions`
--

CREATE TABLE `transactions` (
  `id` int(11) NOT NULL,
  `walletId` int(11) NOT NULL,
  `transferFrom` int(11) DEFAULT NULL,
  `transferTo` varchar(50) CHARACTER SET utf8 DEFAULT NULL,
  `type` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `value` float DEFAULT NULL,
  `report` text DEFAULT NULL,
  `date` int(11) DEFAULT NULL,
  `time` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `oldValue` float DEFAULT NULL,
  `newValue` float DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `transactions`
--

INSERT INTO `transactions` (`id`, `walletId`, `transferFrom`, `transferTo`, `type`, `value`, `report`, `date`, `time`, `created_at`, `updated_at`, `oldValue`, `newValue`) VALUES
(36, 1, 1, 'total health', 'received', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(37, 1, 1, 'total health', 'payed', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(65, 2, 1, 'total health', 'received', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(66, 2, 1, 'total health', 'payed', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(67, 3, 1, 'total health', 'received', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(68, 3, 1, 'total health', 'payed', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(69, 4, 1, 'total health', 'received', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(70, 4, 1, 'total health', 'payed', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(71, 5, 1, 'total health', 'received', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(72, 5, 1, 'total health', 'payed', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(73, 6, 1, 'total health', 'received', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(74, 6, 1, 'total health', 'payed', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(75, 7, 1, 'total health', 'received', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(76, 7, 1, 'total health', 'payed', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(77, 8, 1, 'total health', 'received', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(78, 8, 1, 'total health', 'payed', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(79, 9, 1, 'total health', 'received', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(80, 9, 1, 'total health', 'payed', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(81, 10, 1, 'total health', 'received', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(82, 10, 1, 'total health', 'payed', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(83, 11, 1, 'total health', 'received', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(84, 11, 1, 'total health', 'payed', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(85, 12, 1, 'total health', 'received', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(86, 12, 1, 'total health', 'payed', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(87, 13, 1, 'total health', 'received', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(88, 13, 1, 'total health', 'payed', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(89, 14, 1, 'total health', 'received', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(90, 14, 1, 'total health', 'payed', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(91, 15, 1, 'total health', 'received', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(92, 15, 1, 'total health', 'payed', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(93, 16, 1, 'total health', 'received', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(94, 16, 1, 'total health', 'payed', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(95, 17, 1, 'total health', 'received', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(96, 17, 1, 'total health', 'payed', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(97, 18, 1, 'total health', 'received', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(98, 18, 1, 'total health', 'payed', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(99, 19, 1, 'total health', 'received', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(100, 19, 1, 'total health', 'payed', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(101, 20, 1, 'total health', 'received', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(102, 20, 1, 'total health', 'payed', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(103, 21, 1, 'total health', 'received', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(104, 21, 1, 'total health', 'payed', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(105, 22, 1, 'total health', 'received', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL),
(106, 22, 1, 'total health', 'payed', 20, NULL, NULL, NULL, '2021-09-13 15:46:30', '2021-09-13 15:46:30', NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `dateOfBirth` date DEFAULT NULL,
  `mobile` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `address` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `photo` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'admin',
  `roles_name` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `Status` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `expire` tinyint(1) NOT NULL DEFAULT 0 COMMENT '0=>active 1=>expire',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `password`, `dateOfBirth`, `mobile`, `address`, `photo`, `type`, `roles_name`, `Status`, `remember_token`, `expire`, `created_at`, `updated_at`) VALUES
(1, 'John', 'admin@admin.com', '$2y$10$v8B8idYHemGAR9EflO7MhebBTSKNWhvmQuqpxrQm0lCUFrRRIcm2m', NULL, '023454', 'القاهره', '1631863693.jpeg', 'admin', '[\"owner\"]', 'مفعل', NULL, 1, '2021-01-03 03:43:48', '2021-09-17 07:28:13'),
(2, 'hamada', 'hamada@hamada.com', '$2y$10$bOrXfCIhO5mCFWHeNoPNKuPHfpNxduJn4QDKGuZsnj72RPzSOTZK2', NULL, NULL, NULL, NULL, 'admin', '[\"employee\"]', 'مفعل', NULL, 1, '2021-01-03 07:02:34', '2021-06-29 05:10:02'),
(3, 'Diaa', 'diaa@gmail.com', '$2y$10$Yc7zKvx/Tf9Cc1jb3qhxre9V9KUOV3ntaWRq3J140n8zA.fSpmzeu', '2021-04-18', '0568645742', 'hail', '1618695044.png', 'admin', '[\"Admin\"]', 'مفعل', NULL, 1, '2021-04-17 19:30:44', '2021-06-29 05:10:02'),
(4, 'khalid', 'khalid@gmail.com', '$2y$10$cMTJJhsHX/NiuB/XH5wI8OaGjCi1dOXP0pnMXbU4EvAz8czIt.Yqq', NULL, '0568645742', 'alazeezia', '1625121236.jpg', 'admin', '[\"Admin\"]', 'مفعل', NULL, 1, '2021-07-01 06:33:56', '2021-07-01 06:48:58');

-- --------------------------------------------------------

--
-- Table structure for table `user_activations`
--

CREATE TABLE `user_activations` (
  `id` int(10) UNSIGNED NOT NULL,
  `id_user` int(10) UNSIGNED NOT NULL,
  `token` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `user_activations`
--

INSERT INTO `user_activations` (`id`, `id_user`, `token`, `created_at`) VALUES
(35, 30, 'S2ryMimijUMi1VlwB1vQjs56nMEOgo', '2021-06-17 11:34:57'),
(36, 31, 'KQkxFltPbRrNbswfBfCBx6uyHPGutd', '2021-06-17 15:28:01'),
(37, 2, 'cYtZgVtXv43ZegiTuQSMipIiTsWJKW', '2021-06-19 06:41:59'),
(38, 3, 'bdmfkDqSkxP9trimfrkmqxVBoVicld', '2021-07-10 06:31:55'),
(39, 4, '0S9cqTRhCeokupDZ4zW6Za21rQPUAS', '2021-07-10 06:34:13'),
(40, 5, 'nPxOXSzkW6NExQpq6wKAFhbOSKHQgh', '2021-07-10 08:58:55'),
(41, 6, 'WbOVmNYRgfzWenpCBpzZuGCBthkbUI', '2021-07-10 08:59:53'),
(42, 7, 'ayZ8RppamnuAWDU7vBoIRgF5CfVk2d', '2021-07-10 09:02:41'),
(43, 32, 'cLjbv4UqdjklMpNaKP4SB9M25OSzAN', '2021-07-10 15:51:20'),
(44, 2, '8taRYZikVYAvvTBfUdq1LTX0xKQDoC', '2021-08-12 13:20:44'),
(45, 3, 'FTPllZEGS1WVsFMA5rcUYHCvouLjHi', '2021-08-12 13:30:26'),
(46, 4, '5X6hqkzJaOdptWrRcDvhYwCtHknEH6', '2021-08-12 13:31:50'),
(47, 5, 'rl9B49qICR0pvvNluasLYwrLnWxBMx', '2021-08-12 13:33:03'),
(48, 6, 'I1kmwdE1aWvutlJ4OeZQYXFuw1ZQw2', '2021-08-12 13:37:31'),
(49, 7, 'yt0jDsKDIyKVnKPsYM5EeRgv6gvO4d', '2021-08-12 13:45:44'),
(50, 8, 'my5cQmYOqHG1Kf2EKuySevOwW6dgTG', '2021-08-12 13:49:52'),
(51, 9, 'Ur6VXeQfKpEsCgNeFIDKvQwemWI09M', '2021-08-12 13:58:40'),
(57, 33, 'ZXz3K8e9gpNqAgLQ9GstEjuayWtt07', '2021-09-01 12:30:26'),
(58, 34, 'eJoG8Dxw8B2Dw8KSwvkALXiqpjnWFk', '2021-09-01 12:55:16'),
(59, 35, 'FQnQ1rLw8Fv2uU9ec47wJj1S7dyCTd', '2021-09-01 12:57:15'),
(60, 36, 'M1zzTwHmFgQsLENph6aeT08j3PdG72', '2021-09-01 13:01:15'),
(61, 37, '2GyvaoIUb8M2Lu4xbdsucotTXRAtFE', '2021-09-01 13:45:50'),
(62, 38, 'e5C7XHCKE6N9S50iS0pFF6bDczOjqK', '2021-09-01 13:47:04'),
(63, 39, 'YzZ9N0HrUCr3CI9gHNrcAuR7eIs7aD', '2021-09-01 13:47:51'),
(64, 40, 'r4Mq7ldlCg6AJX6tuBrvWu4wVJl7eb', '2021-09-02 21:45:17'),
(65, 41, 'krA7lMAmOW6rl04LMGmpSw8muqJMhY', '2021-09-03 05:54:29'),
(66, 42, 'Qwa4rCuFD2s6MG8dVhURPQHUhXudMy', '2021-09-03 05:55:12'),
(67, 43, 'XzEgjFUb0S0vw9wfX8hLRF97vh5PfZ', '2021-09-03 06:08:09'),
(68, 44, '1GbserqHMRau6AqP5Tme8n7PBALnue', '2021-09-03 06:09:15'),
(69, 45, 'YVTIKn2tQvHzobGTXqloH7HMySwM2i', '2021-09-03 06:10:27'),
(70, 46, 'NheXSyXmHbtiYFrE0YdrIbmMytrKs5', '2021-09-03 14:42:04'),
(71, 47, 'DAatUGDFVGSk4N7szBJrJYraHRYAeq', '2021-09-03 21:34:19'),
(72, 49, 'OpnFcANvqoYoNY64QW7JG38OfN8lLQ', '2021-09-05 11:18:37'),
(75, 53, 'sDxZ0uZiLje58BLcDXHmphf12Ivp8L', '2021-09-15 15:10:13');

-- --------------------------------------------------------

--
-- Table structure for table `videos`
--

CREATE TABLE `videos` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `courseId` bigint(20) UNSIGNED NOT NULL,
  `chapterId` bigint(20) UNSIGNED NOT NULL,
  `name` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `url` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `videos`
--

INSERT INTO `videos` (`id`, `courseId`, `chapterId`, `name`, `url`, `created_at`, `updated_at`) VALUES
(1, 1, 1, 'complet data', '1628835245.mp4', '2021-08-13 04:14:05', '2021-08-13 04:14:05');

-- --------------------------------------------------------

--
-- Table structure for table `wallets`
--

CREATE TABLE `wallets` (
  `id` int(11) NOT NULL,
  `userId` int(11) DEFAULT NULL,
  `instructorId` int(11) DEFAULT NULL,
  `total` float DEFAULT 0,
  `waitingValue` float DEFAULT 0,
  `approvValue` float DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `wallets`
--

INSERT INTO `wallets` (`id`, `userId`, `instructorId`, `total`, `waitingValue`, `approvValue`) VALUES
(1, NULL, 13, 4, 0, 0),
(2, NULL, 14, 3, 0, 0),
(3, NULL, 15, 4, 0, 0),
(4, NULL, 16, 3, 0, 0),
(5, NULL, 17, 4, 0, 0),
(6, NULL, 18, 3, 0, 0),
(7, NULL, 19, 4, 0, 0),
(8, NULL, 20, 3, 0, 0),
(9, NULL, 21, 4, 0, 0),
(10, NULL, 22, 3, 0, 0),
(11, NULL, 23, 4, 0, 0),
(12, NULL, 24, 3, 0, 0),
(13, NULL, 26, 4, 0, 0),
(14, NULL, 27, 3, 0, 0),
(15, NULL, 28, 4, 0, 0),
(16, NULL, 29, 3, 0, 0),
(17, NULL, 47, 4, 0, 0),
(18, NULL, 48, 3, 0, 0),
(19, NULL, 50, 4, 0, 0),
(20, NULL, 51, 3, 0, 0),
(21, NULL, 52, 4, 0, 0),
(22, NULL, 53, 3, 0, 0);

-- --------------------------------------------------------

--
-- Table structure for table `wishlists`
--

CREATE TABLE `wishlists` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `courseId` bigint(20) UNSIGNED NOT NULL,
  `userId` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `abouts`
--
ALTER TABLE `abouts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `answers`
--
ALTER TABLE `answers`
  ADD PRIMARY KEY (`id`),
  ADD KEY `answers_courseid_foreign` (`courseId`),
  ADD KEY `answers_questionid_foreign` (`questionId`);

--
-- Indexes for table `banks`
--
ALTER TABLE `banks`
  ADD PRIMARY KEY (`id`),
  ADD KEY `banks_userid_foreign` (`userId`);

--
-- Indexes for table `books`
--
ALTER TABLE `books`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `carts`
--
ALTER TABLE `carts`
  ADD PRIMARY KEY (`id`),
  ADD KEY `carts_bookid_foreign` (`bookId`),
  ADD KEY `carts_userid_foreign` (`userId`);

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `certificates`
--
ALTER TABLE `certificates`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `chapters`
--
ALTER TABLE `chapters`
  ADD PRIMARY KEY (`id`),
  ADD KEY `chapters_courseid_foreign` (`courseId`);

--
-- Indexes for table `child_categories`
--
ALTER TABLE `child_categories`
  ADD PRIMARY KEY (`id`),
  ADD KEY `child_categories_categoryid_foreign` (`categoryId`),
  ADD KEY `child_categories_subcategoryid_foreign` (`subCategoryId`);

--
-- Indexes for table `cities`
--
ALTER TABLE `cities`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `contacts`
--
ALTER TABLE `contacts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `contact_infos`
--
ALTER TABLE `contact_infos`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `countries`
--
ALTER TABLE `countries`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `coupons`
--
ALTER TABLE `coupons`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `courses`
--
ALTER TABLE `courses`
  ADD PRIMARY KEY (`id`),
  ADD KEY `courses_userid_foreign` (`userId`);

--
-- Indexes for table `degrees`
--
ALTER TABLE `degrees`
  ADD PRIMARY KEY (`id`),
  ADD KEY `degrees_courseid_foreign` (`courseId`);

--
-- Indexes for table `documents`
--
ALTER TABLE `documents`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `instructors`
--
ALTER TABLE `instructors`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `instructors_email_unique` (`email`);

--
-- Indexes for table `jobs`
--
ALTER TABLE `jobs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `jobs_queue_index` (`queue`);

--
-- Indexes for table `languagess`
--
ALTER TABLE `languagess`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `model_has_permissions`
--
ALTER TABLE `model_has_permissions`
  ADD PRIMARY KEY (`permission_id`,`model_id`,`model_type`),
  ADD KEY `model_has_permissions_model_id_model_type_index` (`model_id`,`model_type`);

--
-- Indexes for table `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`),
  ADD KEY `orders_courseid_foreign` (`courseId`),
  ADD KEY `orders_userid_foreign` (`userId`);

--
-- Indexes for table `password_resets`
--
ALTER TABLE `password_resets`
  ADD KEY `password_resets_email_index` (`email`);

--
-- Indexes for table `payments`
--
ALTER TABLE `payments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `payments_courseid_foreign` (`courseId`),
  ADD KEY `payments_userid_foreign` (`userId`);

--
-- Indexes for table `permissions`
--
ALTER TABLE `permissions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `permissions_name_guard_name_unique` (`name`,`guard_name`);

--
-- Indexes for table `privacies`
--
ALTER TABLE `privacies`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `questions`
--
ALTER TABLE `questions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `questions_courseid_foreign` (`courseId`),
  ADD KEY `questions_userid_foreign` (`userId`);

--
-- Indexes for table `quizes`
--
ALTER TABLE `quizes`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `reviews`
--
ALTER TABLE `reviews`
  ADD PRIMARY KEY (`id`),
  ADD KEY `reviews_courseid_foreign` (`courseId`);

--
-- Indexes for table `roles`
--
ALTER TABLE `roles`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `roles_name_guard_name_unique` (`name`,`guard_name`);

--
-- Indexes for table `settings`
--
ALTER TABLE `settings`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `sliders`
--
ALTER TABLE `sliders`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `socials`
--
ALTER TABLE `socials`
  ADD PRIMARY KEY (`id`),
  ADD KEY `socials_userid_foreign` (`userId`);

--
-- Indexes for table `states`
--
ALTER TABLE `states`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `students`
--
ALTER TABLE `students`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `students_email_unique` (`email`);

--
-- Indexes for table `sub_categories`
--
ALTER TABLE `sub_categories`
  ADD PRIMARY KEY (`id`),
  ADD KEY `sub_categories_categoryid_foreign` (`categoryId`);

--
-- Indexes for table `testimonials`
--
ALTER TABLE `testimonials`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `topics`
--
ALTER TABLE `topics`
  ADD PRIMARY KEY (`id`),
  ADD KEY `topics_courseid_foreign` (`courseId`),
  ADD KEY `topics_questionid_foreign` (`questionId`);

--
-- Indexes for table `transactions`
--
ALTER TABLE `transactions`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `user_activations`
--
ALTER TABLE `user_activations`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_activations_id_user_foreign` (`id_user`);

--
-- Indexes for table `videos`
--
ALTER TABLE `videos`
  ADD PRIMARY KEY (`id`),
  ADD KEY `videos_courseid_foreign` (`courseId`),
  ADD KEY `videos_chapterid_foreign` (`chapterId`);

--
-- Indexes for table `wallets`
--
ALTER TABLE `wallets`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `wishlists`
--
ALTER TABLE `wishlists`
  ADD PRIMARY KEY (`id`),
  ADD KEY `wishlists_courseid_foreign` (`courseId`),
  ADD KEY `wishlists_userid_foreign` (`userId`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `abouts`
--
ALTER TABLE `abouts`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `answers`
--
ALTER TABLE `answers`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `banks`
--
ALTER TABLE `banks`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=34;

--
-- AUTO_INCREMENT for table `books`
--
ALTER TABLE `books`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;

--
-- AUTO_INCREMENT for table `carts`
--
ALTER TABLE `carts`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `certificates`
--
ALTER TABLE `certificates`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `chapters`
--
ALTER TABLE `chapters`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `child_categories`
--
ALTER TABLE `child_categories`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `cities`
--
ALTER TABLE `cities`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `contacts`
--
ALTER TABLE `contacts`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `contact_infos`
--
ALTER TABLE `contact_infos`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `countries`
--
ALTER TABLE `countries`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=221;

--
-- AUTO_INCREMENT for table `coupons`
--
ALTER TABLE `coupons`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `courses`
--
ALTER TABLE `courses`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `degrees`
--
ALTER TABLE `degrees`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `documents`
--
ALTER TABLE `documents`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `instructors`
--
ALTER TABLE `instructors`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=54;

--
-- AUTO_INCREMENT for table `jobs`
--
ALTER TABLE `jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `languagess`
--
ALTER TABLE `languagess`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=39;

--
-- AUTO_INCREMENT for table `orders`
--
ALTER TABLE `orders`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `payments`
--
ALTER TABLE `payments`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `permissions`
--
ALTER TABLE `permissions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=39;

--
-- AUTO_INCREMENT for table `privacies`
--
ALTER TABLE `privacies`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `questions`
--
ALTER TABLE `questions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `quizes`
--
ALTER TABLE `quizes`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `reviews`
--
ALTER TABLE `reviews`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `roles`
--
ALTER TABLE `roles`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `settings`
--
ALTER TABLE `settings`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `sliders`
--
ALTER TABLE `sliders`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `socials`
--
ALTER TABLE `socials`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `states`
--
ALTER TABLE `states`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `students`
--
ALTER TABLE `students`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `sub_categories`
--
ALTER TABLE `sub_categories`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `testimonials`
--
ALTER TABLE `testimonials`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `topics`
--
ALTER TABLE `topics`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `transactions`
--
ALTER TABLE `transactions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=107;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `user_activations`
--
ALTER TABLE `user_activations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=76;

--
-- AUTO_INCREMENT for table `videos`
--
ALTER TABLE `videos`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `wallets`
--
ALTER TABLE `wallets`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=29;

--
-- AUTO_INCREMENT for table `wishlists`
--
ALTER TABLE `wishlists`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `answers`
--
ALTER TABLE `answers`
  ADD CONSTRAINT `answers_courseid_foreign` FOREIGN KEY (`courseId`) REFERENCES `courses` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `answers_questionid_foreign` FOREIGN KEY (`questionId`) REFERENCES `questions` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `banks`
--
ALTER TABLE `banks`
  ADD CONSTRAINT `banks_userid_foreign` FOREIGN KEY (`userId`) REFERENCES `instructors` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `carts`
--
ALTER TABLE `carts`
  ADD CONSTRAINT `carts_bookid_foreign` FOREIGN KEY (`bookId`) REFERENCES `books` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `carts_userid_foreign` FOREIGN KEY (`userId`) REFERENCES `instructors` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `chapters`
--
ALTER TABLE `chapters`
  ADD CONSTRAINT `chapters_courseid_foreign` FOREIGN KEY (`courseId`) REFERENCES `courses` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `child_categories`
--
ALTER TABLE `child_categories`
  ADD CONSTRAINT `child_categories_categoryid_foreign` FOREIGN KEY (`categoryId`) REFERENCES `categories` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `child_categories_subcategoryid_foreign` FOREIGN KEY (`subCategoryId`) REFERENCES `sub_categories` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `courses`
--
ALTER TABLE `courses`
  ADD CONSTRAINT `courses_userid_foreign` FOREIGN KEY (`userId`) REFERENCES `instructors` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `degrees`
--
ALTER TABLE `degrees`
  ADD CONSTRAINT `degrees_courseid_foreign` FOREIGN KEY (`courseId`) REFERENCES `courses` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `model_has_permissions`
--
ALTER TABLE `model_has_permissions`
  ADD CONSTRAINT `model_has_permissions_permission_id_foreign` FOREIGN KEY (`permission_id`) REFERENCES `permissions` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `orders`
--
ALTER TABLE `orders`
  ADD CONSTRAINT `orders_courseid_foreign` FOREIGN KEY (`courseId`) REFERENCES `courses` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `orders_userid_foreign` FOREIGN KEY (`userId`) REFERENCES `instructors` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `payments`
--
ALTER TABLE `payments`
  ADD CONSTRAINT `payments_courseid_foreign` FOREIGN KEY (`courseId`) REFERENCES `courses` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `payments_userid_foreign` FOREIGN KEY (`userId`) REFERENCES `instructors` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `questions`
--
ALTER TABLE `questions`
  ADD CONSTRAINT `questions_courseid_foreign` FOREIGN KEY (`courseId`) REFERENCES `courses` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `questions_userid_foreign` FOREIGN KEY (`userId`) REFERENCES `instructors` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `reviews`
--
ALTER TABLE `reviews`
  ADD CONSTRAINT `reviews_courseid_foreign` FOREIGN KEY (`courseId`) REFERENCES `courses` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `socials`
--
ALTER TABLE `socials`
  ADD CONSTRAINT `socials_userid_foreign` FOREIGN KEY (`userId`) REFERENCES `instructors` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `sub_categories`
--
ALTER TABLE `sub_categories`
  ADD CONSTRAINT `sub_categories_categoryid_foreign` FOREIGN KEY (`categoryId`) REFERENCES `categories` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `topics`
--
ALTER TABLE `topics`
  ADD CONSTRAINT `topics_courseid_foreign` FOREIGN KEY (`courseId`) REFERENCES `courses` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `topics_questionid_foreign` FOREIGN KEY (`questionId`) REFERENCES `questions` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `videos`
--
ALTER TABLE `videos`
  ADD CONSTRAINT `videos_chapterid_foreign` FOREIGN KEY (`chapterId`) REFERENCES `chapters` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `videos_courseid_foreign` FOREIGN KEY (`courseId`) REFERENCES `courses` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `wishlists`
--
ALTER TABLE `wishlists`
  ADD CONSTRAINT `wishlists_courseid_foreign` FOREIGN KEY (`courseId`) REFERENCES `courses` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `wishlists_userid_foreign` FOREIGN KEY (`userId`) REFERENCES `instructors` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
